

const W={"Phường Nam Định":[["1","Đường Trần Hưng Đạo","Đường Trần Nhân Tông","Đường Hàng Thao",100000,70000,85000,60000,42000,51000,42000,28000,35000,28000,14000,21000],["1","Đường Trần Hưng Đạo","Đường Hàng Thao","Ngõ Hai Bà Trưng",200000,100000,150000,120000,60000,90000,60000,40000,50000,40000,20000,30000],["1","Đường Trần Hưng Đạo","Ngõ Hai Bà Trưng","Ngã tư Quang Trung",250000,200000,225000,120000,90000,105000,90000,70000,80000,70000,40000,55000],["1","Đường Trần Hưng Đạo","Ngã tư Quang Trung","Đường Trường Chinh",250000,220000,235000,120000,90000,105000,90000,70000,80000,70000,44000,57000],["1","Đường Trần Hưng Đạo","Đường Trường Chinh","Đường Đông A",190000,150000,170000,114000,90000,102000,90000,60000,75000,60000,30000,45000],["2","Đường Hoàng Văn Thụ","Đường Trần Nhân Tông","Đường Phan Đình Phùng",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["2","Đường Hoàng Văn Thụ","Đường Phan Đình Phùng","Đường Lê Hồng Phong",80000,65000,72500,48000,39000,43500,39000,26000,32500,26000,13000,19500],["2","Đường Hoàng Văn Thụ","Đường Lê Hồng Phong","Đường Quang Trung",110000,90000,100000,66000,54000,60000,54000,36000,45000,36000,18000,27000],["2","Đường Hoàng Văn Thụ","Đường Quang Trung","Đường Trường Chinh",90000,80000,85000,54000,48000,51000,48000,32000,40000,32000,16000,24000],["3","Đường Hai Bà Trưng","Đường Phan Đình Phùng","Ngõ Nhà Thờ",75000,65000,70000,45000,39000,42000,39000,26000,32500,26000,13000,19500],["3","Đường Hai Bà Trưng","Ngõ Nhà Thờ","Đường Lê Hồng Phong",90000,75000,82500,54000,45000,49500,45000,30000,37500,30000,15000,22500],["3","Đường Hai Bà Trưng","Đường Lê Hồng Phong","Đường Bà Triệu",140000,115000,127500,84000,70000,77000,70000,46000,58000,46000,23000,34500],["4","Đường Bà Triệu","Đường Hoàng Văn Thụ","Đường Trần Hưng Đạo",150000,120000,135000,90000,72000,81000,72000,48000,60000,48000,24000,36000],["4","Đường Bà Triệu","Đường Trần Hưng Đạo","Đường Phạm Hồng Thái",150000,120000,135000,90000,72000,81000,72000,48000,60000,48000,24000,36000],["5","Đường Hàng Tiện","Chợ Diên Hồng","Đường Trần Hưng Đạo",150000,130000,140000,90000,78000,84000,78000,52000,65000,52000,26000,39000],["6","Đường Hàng Cấp","Đường Mạc Thị Bưởi","Chợ Diên Hồng",140000,120000,130000,84000,72000,78000,72000,48000,60000,48000,24000,36000],["7","Đường Nguyễn Chánh","Đường Trần Hưng Đạo","Đường Phạm Hồng Thái",150000,130000,140000,90000,78000,84000,78000,52000,65000,52000,26000,39000],["8","Đường Phạm Hồng Thái","Đường Trần Phú","Đường Trần Quốc Toản",75000,65000,70000,45000,39000,42000,39000,26000,32500,26000,13000,19500],["8","Đường Phạm Hồng Thái","Đường Trần Quốc Toản","Đường Quang Trung",125000,95000,110000,75000,57000,66000,57000,38000,47500,38000,19000,28500],["8","Đường Phạm Hồng Thái","Đường Quang Trung","Trường ĐH Công Nghiệp",100000,90000,95000,60000,54000,57000,54000,36000,45000,36000,18000,27000],["9","Đường Hàng Đồng","Đường Nguyễn Du","Đường Hoàng Văn Thụ",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["9","Đường Hàng Đồng","Đường Hoàng Văn Thụ","Đường Trần Hưng Đạo",150000,95000,122500,90000,57000,73500,57000,38000,47500,38000,19000,28500],["10","Đường Lê Hồng Phong","Đường Trần Nhật Duật","Đường Hùng Vương",85000,70000,77500,51000,42000,46500,42000,28000,35000,28000,14000,21000],["10","Đường Lê Hồng Phong","Đường Hùng Vương","Đường Nguyễn Du",105000,95000,100000,63000,57000,60000,57000,38000,47500,38000,19000,28500],["10","Đường Lê Hồng Phong","Đường Nguyễn Du","Đường Hoàng Văn Thụ",112000,100000,106000,67200,60000,63600,60000,40000,50000,40000,20000,30000],["10","Đường Lê Hồng Phong","Đường Hoàng Văn Thụ","Đường Trần Hưng Đạo",180000,150000,165000,108000,90000,99000,90000,60000,75000,60000,30000,45000],["11","Đường Trần Phú","Đường Trần Hưng Đạo","Ngã 6 Năng Tĩnh",120000,90000,105000,72000,54000,63000,54000,36000,45000,36000,18000,27000],["12","Đường Hàn Thuyên","Đường Trường Chinh","Đường Trần Nhật Duật",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["12","Đường Hàn Thuyên","Đường Trần Nhật Duật","Đường Hùng Vương",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["12","Đường Hàn Thuyên","Đường Hùng Vương","Đường Mạc Thị Bưởi",120000,100000,110000,72000,60000,66000,60000,40000,50000,40000,20000,30000],["13","Đường Quang Trung","Đường Mạc Thị Bưởi","Đường Hoàng Văn Thụ",150000,120000,135000,90000,72000,81000,72000,48000,60000,48000,24000,36000],["13","Đường Quang Trung","Đường Hoàng Văn Thụ","Đường Thành Chung",180000,140000,160000,108000,84000,96000,84000,56000,70000,56000,28000,42000],["13","Đường Quang Trung","Ngõ An Phong","Cuối tuyến",40000,30000,35000,24000,18000,21000,18000,12000,15000,12000,6000,9000],["14","Đường Thành Chung","Đường Quang Trung","Đường Trường Chinh",190000,150000,170000,114000,90000,102000,90000,60000,75000,60000,30000,45000],["15","Đường Mạc Thị Bưởi","Đường Nguyễn Du","Đường Trường Chinh",200000,170000,185000,120000,102000,111000,102000,68000,85000,68000,34000,51000],["15","Đường Mạc Thị Bưởi","Đường Trường Chinh","Đường Hưng Yên",90000,70000,80000,54000,42000,48000,42000,28000,35000,28000,14000,21000],["16","Đường Trường Chinh","Đường Thái Bình","Đường Phù Nghĩa",60000,40000,50000,36000,24000,30000,24000,16000,20000,16000,8000,12000],["16","Đường Trường Chinh","Đường Phù Nghĩa","Đường Nguyễn Đức Thuận (phía Bắc) và đường Hùng Vương (phía Nam)",85000,75000,80000,51000,45000,48000,45000,30000,37500,30000,15000,22500],["16","Đường Trường Chinh","Đường Nguyễn Đức Thuận","Đường Điện Biên",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["16","Đường Trường Chinh","Phố Doãn Kế Thiện: phố Lương Đình Của","Phố Đào Duy Từ",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["17","Đường Bắc Ninh","Đường Lê Hồng Phong","Đường Nguyễn Du",80000,60000,70000,48000,36000,42000,36000,24000,30000,24000,12000,18000],["17","Đường Bắc Ninh","Đường Nguyễn Du","Đường Hoàng Văn Thụ",75000,65000,70000,45000,39000,42000,39000,26000,32500,26000,13000,19500],["17","Đường Bắc Ninh","Đường Hoàng Văn Thụ","Đường Trần Hưng Đạo",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["18","Đường Hùng Vương","Đường Trần Nhân Tông","Đường Lê Hồng Phong",80000,50000,65000,48000,30000,39000,30000,20000,25000,20000,10000,15000],["18","Đường Hùng Vương","Đường Lê Hồng Phong","Đường Hàn Thuyên",140000,80000,110000,84000,48000,66000,48000,32000,40000,32000,16000,24000],["18","Đường Hùng Vương","Đường Hàn Thuyên","Đường Trường Chinh",95000,75000,85000,57000,45000,51000,45000,30000,37500,30000,15000,22500],["19","Đường Nguyễn Du","Đường Hùng Vương","Đường Trần Tế Xương (đường đôi)",180000,140000,160000,108000,84000,96000,84000,56000,70000,56000,28000,42000],["19","Đường Nguyễn Du","Đường Trần Tế Xương","Đường Lê Hồng Phong",180000,150000,165000,108000,90000,99000,90000,60000,75000,60000,30000,45000],["20","Đường Trần Đăng Ninh","Trần Hưng Đạo","Tràng Thi",90000,70000,80000,54000,42000,48000,42000,28000,35000,28000,14000,21000],["21","Đường Điện Biên","Đường Trường Chinh","Đường Giải Phóng",120000,100000,110000,72000,60000,66000,60000,40000,50000,40000,20000,30000],["22","Đường Hà Huy Tập","Đường Trần Phú","Đường Trần Đăng Ninh",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["22","Đường Hà Huy Tập","Đường Trần Đăng Ninh","Đường Thành Chung",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["23","Đường Phan Bội Châu","Đường Tràng Thi","Ngã 6 Năng Tĩnh",65000,55000,60000,39000,33000,36000,33000,22000,27500,22000,11000,16500],["24","Đường Nguyễn Hiền (Phan Bội Châu cũ )","Đường Trần Đăng Ninh","Ngã 6 Năng Tĩnh",65000,55000,60000,39000,33000,36000,33000,22000,27500,22000,11000,16500],["25","Đường Lý Thường Kiệt","Đường Bà Triệu","Đường Trường Chinh",140000,100000,120000,84000,60000,72000,60000,40000,50000,40000,20000,30000],["26","Đường Trần Quốc Toản","Đường Trần Hưng Đạo","Đường Hoàng Hoa Thám",95000,70000,82500,57000,42000,49500,42000,28000,35000,28000,14000,21000],["27","Đường Đông Kinh Nghĩa Thục","Đường Hà Huy Tập","Đường Trần Phú",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["28","Đường Hoàng Hoa Thám","Đường Trần Phú","Đường Trần Đăng Ninh",65000,55000,60000,39000,33000,36000,33000,22000,27500,22000,11000,16500],["29","Đường Cột Cờ","Đường Trần Hưng Đạo","Đường Bến Thóc",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["30","Đường Ngõ Quang Trung","Đường Hàng Tiện","Đường Quang Trung",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["31","Đường Hoàng Hữu Nam","Đường Hàng Đồng","Đường Hoàng Văn Thụ",85000,75000,80000,51000,45000,48000,45000,30000,37500,30000,15000,22500],["32","Đường Diên Hồng","Đường Nguyễn Du","Đường Quang Trung",80000,70000,75000,48000,42000,45000,42000,28000,35000,28000,14000,21000],["33","Đường Trần Bình Trọng","Đường Hoàng Văn Thụ","Đường Trần Hưng Đạo",130000,100000,115000,78000,60000,69000,60000,40000,50000,40000,20000,30000],["34","Đường Ngõ Văn Nhân","Đường Hoàng Văn Thụ","Đường Trần Hưng Đạo",60000,55000,57500,36000,33000,34500,33000,22000,27500,22000,11000,16500],["35","Đường Ngõ Nhà Thờ","Đường Hoàng Văn Thụ","Đường Hai Bà Trưng",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["35","Đường Ngõ Nhà Thờ","Đường Hai Bà Trưng","Đường Trần Hưng Đạo",80000,60000,70000,48000,36000,42000,36000,24000,30000,24000,12000,18000],["36","Đường Tô Hiệu","Đường Trần Nhân Tông","Đường Trần Phú",80000,60000,70000,48000,36000,42000,36000,24000,30000,24000,12000,18000],["37","Đường Hàng Thao","Đường Hai Bà Trưng","Đường Tô Hiệu",85000,60000,72500,51000,36000,43500,36000,24000,30000,24000,12000,18000],["37","Đường Hàng Thao","Đường Tô Hiệu","Đường Đinh Bộ Lĩnh",75000,60000,67500,45000,36000,40500,36000,24000,30000,24000,12000,18000],["38","Đường Ngô Quyền","Đường Trần Nhân Tông","Đường Máy Tơ",90000,60000,75000,54000,36000,45000,36000,24000,30000,24000,12000,18000],["39","Đường Phan Đình Phùng","Đường Nguyễn Trãi","Đường Hai Bà Trưng",100000,70000,85000,60000,42000,51000,42000,28000,35000,28000,14000,21000],["40","Đường Hoàng Ngân","Đường Nguyễn Trãi","Đường Hoàng Văn Thụ",55000,48000,51500,33000,28800,30900,28800,19200,24000,19200,9600,14400],["41","Đường Bến Ngự","Đường Trần Nhân Tông","Đường Lê Hồng Phong",70000,60000,65000,42000,36000,39000,36000,24000,30000,24000,12000,18000],["42","Đường Phan Chu Trinh","Đường Bến Ngự","Đường Hàng Cau",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["43","Đường Hồ Tùng Mậu","Đường Bến Ngự","Đường Hoàng Văn Thụ",50000,45000,47500,30000,27000,28500,27000,18000,22500,18000,9000,13500],["44","Đường Máy Tơ","Đường Trần Hưng Đạo","Đường Tô Hiệu",70000,60000,65000,42000,36000,39000,36000,24000,30000,24000,12000,18000],["44","Đường Máy Tơ","Đường Tô Hiệu","Công ty Dệt Nam Định",58000,52000,55000,35000,32000,33500,32000,21000,26500,21000,12000,16500],["45","Đường Cửa Trường","Đường Bến Thóc","Đường Tô Hiệu",60000,55000,57500,36000,33000,34500,33000,22000,27500,22000,11000,16500],["46","Đường Bến Thóc","Đường Trần Nhân Tông","Đường Trần Phú",65000,55000,60000,39000,33000,36000,33000,22000,27500,22000,11000,16500],["47","Đường Nguyễn Văn Tố","Đường Phan Đình Phùng","Đường Lê Hồng Phong",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["48","Đường Hàng Cau","Đường Trần Nhân Tông","Đường Phan Đình Phùng",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["49","Đường Máy Chai","Đường Trần Hưng Đạo","Đường Bến Thóc",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["50","Đường Nguyễn Thiện Thuật","Đường Hoàng Văn Thụ","Đường Hàng Cau",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["51","Đường Tống Văn Trân","Phố Máy Chai","Phố Máy Tơ",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["52","Đường Huỳnh Thúc Kháng","Phố Máy Chai","Đường Hàng Thao",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["53","Đường Phan Đình Giót","Đường Hoàng Diệu","Đường Văn Cao",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["54","Đường Nguyên Hồng","Đường Hoàng Diệu","Đường Phan Đình Giót",48000,42000,45000,28800,25200,27000,25200,16800,21000,16800,8400,12600],["55","Đường Hoàng Diệu","Đường Nguyễn Văn Trỗi","Đường Trần Phú",70000,60000,65000,42000,36000,39000,36000,24000,30000,24000,12000,18000],["56","Đường Nguyễn Văn Trỗi","Đường Đinh Bộ Lĩnh","Đường Trần Bích San",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["56","Đường Nguyễn Văn Trỗi","Đường Trần Bích San","Đường Trần Nhân Tông",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["57","Đường Trần Bích San","Đường Nguyễn Văn Trỗi","Đường Nguyễn Bính",75000,60000,67500,45000,36000,40500,36000,24000,30000,24000,12000,18000],["58","Đường Nguyễn Bính","Đường Âu Cơ","Đường Song Hào",42000,35000,38500,25200,21000,23100,21000,14000,17500,14000,7000,10500],["58","Đường Nguyễn Bính","Đường Song Hào","Đường Văn Cao",40000,30000,35000,24000,18000,21000,18000,12000,15000,12000,6000,9000],["59","Đường Trần Quang Khải","Phố Bến Thóc","Đường Nguyễn Văn Trỗi",42000,32000,37000,25200,19200,22200,19200,12800,16000,12800,6400,9600],["59","Đường Trần Quang Khải","Đường Nguyễn Văn Trỗi","Đường Văn Cao",55000,40000,47500,33000,24000,28500,24000,16000,20000,16000,8000,12000],["60","Đường Đinh Bộ Lĩnh","Đường Trần Nhân Tông","Đường Nguyễn Văn Trỗi",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["61","Đường Hàng Sắt","Đường Hàng Đồng","Đường Lê Hồng Phong",80000,70000,75000,48000,42000,45000,42000,28000,35000,28000,14000,21000],["62","Đường Minh Khai","Đường Hùng Vương","Đường Mạc Thị Bưởi",90000,70000,80000,54000,42000,48000,42000,28000,35000,28000,14000,21000],["62","Đường Minh Khai","Đường Mạc Thị Bưởi","Đường Hàng Đồng",80000,70000,75000,48000,42000,45000,42000,28000,35000,28000,14000,21000],["63","Đường Vị Xuyên","Đường Trần Nhật Duật","Đường Hùng Vương",75000,60000,67500,45000,36000,40500,36000,24000,30000,24000,12000,18000],["64","Đường Trần Nhân Tông","Đường Trần Nhật Duật","Đường Nguyễn Văn Trỗi",70000,50000,60000,42000,30000,36000,30000,20000,25000,20000,10000,15000],["65","Đường Song Hào","Giáp ranh phường Trường Thi","Đường D3",100000,70000,85000,60000,42000,51000,42000,28000,35000,28000,14000,21000],["65","Đường Song Hào","Đường D3","Đường Nguyễn Văn Trỗi",65000,55000,60000,39000,33000,36000,33000,22000,27500,22000,11000,16500],["66","Đường Nguyễn Trãi","Đường Trần Nhân Tông","Đường Lê Hồng Phong",75000,60000,67500,45000,36000,40500,36000,24000,30000,24000,12000,18000],["67","Đường Bạch Đằng","Đường Trần Nhân Tông","Đường Nguyễn Trãi",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["68","Đường Hưng Yên","Đường Mạc Thị Bưởi","Đường Trường Chinh",105000,70000,87500,63000,42000,52500,42000,28000,35000,28000,14000,21000],["69","Đường Vị Hoàng","Đường Nguyễn Du","Đường Hàn Thuyên",70000,60000,65000,42000,36000,39000,36000,24000,30000,24000,12000,18000],["69","Đường Vị Hoàng","Đường Hàn Thuyên","Đường Trường Chinh",80000,65000,72500,48000,39000,43500,39000,26000,32500,26000,13000,19500],["70","Đường Trần Thái Tông","Đường Hưng Yên","Cầu Sắt",75000,65000,70000,45000,39000,42000,39000,26000,32500,26000,13000,19500],["70","Đường Trần Thái Tông","Cầu Sắt","Quốc lộ 10 mới",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["70","Đường Trần Thái Tông","Quốc lộ 10 mới","Ngã ba đền Trần",40000,30000,35000,24000,18000,21000,18000,12000,15000,12000,6000,9000],["71","Đường Lương Thế Vinh (Rặng xoan Cũ)","Đường Điện Biên","Phi trường điện",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["71","Đường Lương Thế Vinh (Rặng xoan Cũ)","Phi trường điện","Ga",32000,22000,27000,19200,13200,16200,13200,8800,11000,8800,4400,6600],["72","Đường Kênh","Đường Điện Biên","Đường Đông A",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["72","Đường Kênh","Đường Đông A","UBND phường (đường Tức Mạc)",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["73","Đường Giải Phóng","Đường Trần Huy Liệu","Đường Điện Biên",85000,75000,80000,51000,45000,48000,45000,30000,37500,30000,15000,22500],["74","Đường Tràng Thi","Đường Phan Bội Châu","Đường Trần Huy Liệu",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["75","Đường Trần Huy Liệu","Ngã 6 Năng Tĩnh","Giáp ranh phường Trường Thi",90000,70000,80000,54000,42000,48000,42000,28000,35000,28000,14000,21000],["76","Đường Phù Nghĩa","Đường Hàn Thuyên","Đường Trường Chinh",80000,70000,75000,48000,42000,45000,42000,28000,35000,28000,14000,21000],["76","Đường Phù Nghĩa","Đường Trường Chinh","Cầu Lộc Hạ",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["77","Đường Thái Bình","Đường Hàn Thuyên","Đường Thanh Bình",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["77","Đường Thái Bình","Đường Thanh Bình","Trung tâm y tế thành phố (Bệnh viện tình thương)",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["77","Đường Thái Bình","Trung tâm y tế thành phố (Bệnh viện tình thương)","Chân cầu Tân Phong",45000,38000,41500,27000,22800,24900,22800,15200,19000,15200,7600,11400],["78","Đường Thanh Bình","Đường Thái Bình","Trạm dầu lửa",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["78","Đường Thanh Bình","Trạm dầu lửa","Kênh T3-11",30000,25000,27500,18000,15000,16500,15000,10000,12500,10000,5000,7500],["79","Đường Trần Nhật Duật (Đồng Tháp Mười cũ)","Đường Hàn Thuyên","Đường Phù Long",80000,70000,75000,48000,42000,45000,42000,28000,35000,28000,14000,21000],["79","Đường Trần Nhật Duật (Đồng Tháp Mười cũ)","Đường Phù Long","Đường Trần Nhân Tông",70000,60000,65000,42000,36000,39000,36000,24000,30000,24000,12000,18000],["80","Đường Trần Tế Xương","Đường Nguyễn Trãi","Đường Nguyễn Du",65000,60000,62500,39000,36000,37500,36000,24000,30000,24000,12000,18000],["81","Đường Phù Long","Đường Trần Nhật Duật","Đường Cù Chính Lan",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["81","Đường Phù Long","Đường Cù Chính Lan","Đê sông Đào",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["82","Đường Cù Chính Lan","Đê sông Đào","Công ty Cấp nước",38000,28000,33000,22800,16800,19800,16800,11200,14000,11200,5600,8400],["82","Đường Cù Chính Lan","Hết Công ty Cấp nước","Đường Phù Long",40000,30000,35000,24000,18000,21000,18000,12000,15000,12000,6000,9000],["82","Đường Cù Chính Lan","Đường Phù Long","Đường Hàn Thuyên",40000,30000,35000,24000,18000,21000,18000,12000,15000,12000,6000,9000],["83","Đường 19/5 Phường Trần Tế Xương","Đường Thái Bình","Trường Tô Hiệu",40000,30000,35000,24000,18000,21000,18000,12000,15000,12000,6000,9000],["83","Đường 19/5 Phường Trần Tế Xương","Trường Tô Hiệu","Trường mầm non số 4",38000,28000,33000,22800,16800,19800,16800,11200,14000,11200,5600,8400],["83","Đường 19/5 Phường Trần Tế Xương","Trường mầm non số 4","Ngõ 208 đường Thái Bình",25000,20000,22500,15000,12000,13500,12000,8000,10000,8000,4000,6000],["84","Đường Năng Tĩnh","Đường Hoàng Diệu","Ngã 6 Năng Tĩnh",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["85","Đường Đặng Xuân Thiều","Đường Hàn Thuyên","Đường Trường Chinh",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["86","Đường Trần Thánh Tông","Đường Phù Nghĩa","Đường Nguyễn Thị Trinh",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["86","Đường Trần Thánh Tông","Đường Nguyễn Thị Trinh","Đường Võ Nguyên Giáp",90000,70000,80000,54000,42000,48000,42000,28000,35000,28000,14000,21000],["86","Đường Trần Thánh Tông","Đường Võ Nguyên Giáp","Đường Mạc Thị Bưởi",85000,70000,77500,51000,42000,46500,42000,28000,35000,28000,14000,21000],["87","Đường Nguyễn Đức Thuận","Đường Trường Chinh","Quốc lộ 10",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["88","Đường Đặng Xuân Bảng (đường 21 cũ)","Cầu Đò Quan","Cống Trắng (Đường trục phía Nam)",60000,45000,52500,36000,27000,31500,27000,18000,22500,18000,9000,13500],["89","Đường Vũ Hữu Lợi (Đường 55 cũ)","Đường Đặng Xuân Bảng","Đường Nguyễn Cơ Thạch",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["89","Đường Vũ Hữu Lợi (Đường 55 cũ)","Đường Nguyễn Cơ Thạch","Giáp ranh phường Hồng Quan",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["90","Đường Đò Quan","Đường Đặng Xuân Bảng","Đường Vũ Hữu Lợi",42000,35000,38500,25200,21000,23100,21000,14000,17500,14000,7000,10500],["90","Đường Đò Quan","Đường Vũ Hữu Lợi","Đê sông Đào (Đường Lạc Long Quân)",30000,20000,25000,18000,12000,15000,12000,8000,10000,8000,4000,6000],["90","Đường Đò Quan","Đường Lạc Long Quân","Bến Phà cũ (ông Thuấn)",25000,20000,22500,15000,12000,13500,12000,8000,10000,8000,4000,6000],["91","Đường Đông A","Đài phun nước","Quốc lộ 10 mới",150000,130000,140000,90000,78000,84000,78000,52000,65000,52000,26000,39000],["92","Đường Nguyễn Công Trứ","Đường Điện Biên","Hết địa phận phường Đông A",80000,70000,75000,48000,42000,45000,42000,28000,35000,28000,14000,21000],["93","Đường Lê Văn Hưu","Công ty vận tải ô tô","Hết địa phận phường Đông A",62000,55000,58500,37200,33000,35100,33000,22000,27500,22000,11000,16500],["94","Đường Trần Anh Tông","Trung tâm TDTT","Đường Điện Biên",70000,50000,60000,42000,30000,36000,30000,20000,25000,20000,10000,15000],["95","Đường Ngô Sỹ Liên","Đường Trần Khánh Dư","Đường Trần Anh Tông",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["96","Đường Trần khánh Dư","Đường Đông A","Đường Trần Anh Tông",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["97","Đường Trần Đại Nghĩa","Đường Kênh","Đường Trần Anh Tông",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["98","Đường Nguyễn Viết Xuân","Đường Chu Văn An","Đường Trần Anh Tông",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["99","Đường Chu Văn An","Đường Nguyễn Viết Xuân","Giáp ranh phường Đông A",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["100","Đường Đào Sư Tích","Đường Trần Anh Tông","Đường Nguyễn Viết Xuân",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["101","Đường Phạm Văn Nghị","Đường Trần Khánh Dư","Đường Nguyễn Viết Xuân",55000,45000,50000,33000,27000,30000,27000,18000,22500,18000,9000,13500],["102","Đường Nguyễn Thiếp","Trần Khánh Dư","Chu Văn An",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["103","Đường Nguyễn Thực","Đào Sư Tích","Trần Bá Ngọc",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["104","Đường Trần Bá Ngọc","A1","Tôn Thất Đàm",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["105","Đường Đinh Thúc Dự","Đường Ngô Sỹ Liên","Đặng Thế Phong",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["106","Đường Phạm Hữu Du","Đường Lê Văn Hưu","Đỗ Hựu",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["107","Đường Đinh Lễ","Chu Văn An","Bùi Ngọc Oánh",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["108","Đường Vũ Cao","Chu Văn An","Đinh Thúc Dự",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["109","Đường Đặng Tiến Đông","Nguyễn Công Trứ","Đường Đào Diệu Thanh",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["110","Đường Trần Thiên Trạch","Nguyễn Công Trứ","Đường Đỗ Quang",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["111","Đường Hồ Xuân Hương","Phạm Văn Nghị","Đường Trần Bá Giáp",48000,38000,43000,28800,22800,25800,22800,15200,19000,15200,7600,11400],["112","Đường Trần Nhân Trứ","Trần Khánh Dư","Đường Nguyễn Cảnh Dị",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["113","Đường Trần Bá Hai","Trần Đại Nghĩa","Đường D2",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["114","Đường Bùi Tân","Ngô Sỹ Liên","Lý Văn Phúc",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["115","Đường Bùi Ngọc Oánh","Trần Khánh Dư","Phạm Hữu Du",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["116","Đường Đặng Thế Phong","Đường Trần Khánh Dư","Đường Vũ Cao",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["117","Đường Đỗ Hựu","Ngô Sỹ Liên","Đinh Lễ",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["118","Đường E4","Trần Đại Nghĩa","E2",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["119","Đường Phó Đức Chính","Trần Khánh Dư","Đường Phan Kế Bính",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["120","Đường Nguyễn Cảnh Dị","Nguyễn Công Trứ","Đường Bùi Tân",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["121","Đường Vũ Phạm Hàm","Trần Đại Nghĩa","Đường Trần Thiên Trạch",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["122","Đường Trần Tử Bình","Chu Văn An","Đường Kim Đồng",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["123","Đường Vũ Giao Hoan","Phạm Văn Nghị","Đường Lê Trọng Hàm",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["124","Đường Phan Kế Bính","Đào Sư Tích","Đường Trần Bá Ngọc",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["125","Đường E2 (KĐT Hòa Vượng)","Chu Văn An","Đường E1",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["126","Đường Trần Bá Giáp","Đường Trần Đại Nghĩa","Đường Đặng Tiến Đông",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["127","Đường Phan Phu Tiên","Phạm Văn Nghị","Đường E4",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["128","Đường Đào Diệu Thanh","Trần Khánh Dư","Đường Hồ Xuân Hương",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["129","Đường Lê Trọng Hàm","Trần Khánh Dư","Đường Trần Tử Bình",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["130","Đường Kim Đồng","Trần Đại Nghĩa","Đường Vũ Giao Hoan",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["131","Đường D2 (KĐT Hòa Vượng)","Phạm Văn Nghị","Đường D1",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["132","Đường A1 (KĐT Hòa Vượng)","Trần Anh Tông","Đường Lê Hiến Giản",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["133","Đường Đỗ Quang","Nguyễn Viết Xuân","Đường Vũ Phạm Hàm",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["134","Đường D1 (KĐT Hòa Vượng)","Nguyễn Viết Xuân","Đường Trần Bích Hoành",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["135","Đường Tôn Thất Đàm","Trần Anh Tông","Đường Phó Đức Chính",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["136","Đường Trần Bích Hoành","Nguyễn Công Trứ","Đường Trần Bá Hai",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["137","Đường Lý Văn Phức","Lê Văn Hưu","Đường Trần Nhân Trứ",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["138","Đường E1 (KĐT Hòa Vượng)","Nguyễn Viết Xuân","Đường Phan Phu Tiên",48000,40000,44000,28800,24000,26400,24000,16000,20000,16000,8000,12000],["139","Đường Lê Hiến Giản","Đường Nguyễn Viết Xuân","Đường Nguyễn Thực",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["140","Đường Đặng Việt Châu","Đường Điện Biên","Hồ An Trạch",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["141","Đường Trần Thừa (đường trước cửa Đền Trần)","Đường Trần Thái Tông","Cầu Bùi",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["142","Đường Trần Thủ Độ","Quốc Lộ 10","Đường Trần Thừa",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["143","Đường Tức Mạc","Đường Trần Thái Tông (cầu Sắt)","Quốc lộ 10",65000,55000,60000,39000,33000,36000,33000,22000,27500,22000,11000,16500],["144","Đường Lê Quý Đôn (Khu Đông Mạc)","Đường Võ Nguyên Giáp","Đường Vũ Năng An",65000,55000,60000,39000,33000,36000,33000,22000,27500,22000,11000,16500],["145","Đường Mạc Đĩnh Chi (Khu Đông Mạc)","Đường Nguyễn Đức Thuận","Đường Nguyễn Thị Trinh",60000,5000,32500,36000,3000,19500,3000,2000,2500,2000,1000,1500],["146","Đường Nguyễn Thi (Khu Đông Mạc)","Đường Nguyễn Đức Cảnh","Giáp ranh phường Thiên Trường",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["146","Đường Nguyễn Thi (Khu Đông Mạc)","Giáp ranh phường Thiên Trường","Đường Trần Thánh Tông",55000,50000,52500,33000,30000,31500,30000,20000,25000,20000,10000,15000],["147","Đường Bế Văn Đàn (Khu Đông Mạc)","Vũ Văn Hiếu","Hết đường hiện hữu",55000,40000,47500,33000,24000,28500,24000,16000,20000,16000,8000,12000],["148","Đường Nguyễn Trung Ngạn (Khu Đông Mạc)","Nguyễn Thi","Lã Xuân Oai",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["149","Đường Đỗ Huy Liêu (Khu Đông Mạc)","Nguyễn Thi","Lã Xuân Oai",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["150","Đường Lê Hữu Trác (Khu Đông Mạc)","Đường Bế Văn Đàn","Lương Đình Của",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["151","Đường Vũ Văn Hiếu (Khu Đông Mạc)","Nguyễn Đức Thuận","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["152","Đường Chế Lan Viên (Khu Đông Mạc)","Nguyễn Đức Thuận","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["153","Đường Lương Đình Của (Khu Đông Mạc)","Vũ Văn Hiếu","Đường Trường Chinh",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["154","Đường Đào Duy Từ (Khu Đông Mạc)","Chế Lan Viên","Đường Trường Chinh",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["155","Đường Vũ Trọng Phụng","Mương cầu Sắt","Quốc lộ 10",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["156","Đường Bùi Huy Đáp","Đường Phù Nghĩa","Hết địa phận chợ Hạ Long",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["157","Đường Vũ Ngọc Phan - Dãy A","Đường Phù Nghĩa","Hết địa phận phường Nam Định",55000,50000,52500,33000,30000,31500,30000,20000,25000,20000,10000,15000],["158","Đường Lê Ngọc Hân -Dãy B","Đường Phù Nghĩa","Đường Nguyễn Thị Trinh",55000,50000,52500,33000,30000,31500,30000,20000,25000,20000,10000,15000],["159","Đường Đinh Thị Vân -Dãy C","Đường Phù Nghĩa","Đường Nguyễn Thị Trinh",55000,50000,52500,33000,30000,31500,30000,20000,25000,20000,10000,15000],["160","Đường Lương Văn Can - Sau trường Cao đẳng sư phạm","Đường Phù Nghĩa","Tập thể Thực phẩm",48000,40000,44000,28800,24000,26400,24000,16000,20000,16000,8000,12000],["161","Đường Lưu Hữu Phước","Ngã ba đường Phù Nghĩa","Đường Thanh Bình",60000,55000,57500,36000,33000,34500,33000,22000,27500,22000,11000,16500],["162","Đường Chu Văn","Đường Phù Nghĩa","Đường Thanh Bình",45000,40000,42500,27000,24000,25500,24000,16000,20000,16000,8000,12000],["163","Đường Nam Cao - dọc Mương T3-11","Cầu Lộc Hạ","Đường Thanh Bình",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["164","Đường Âu Cơ (Đê bắc Sông Đào)","Đường Song Hào","Cống Kênh Gia",22000,18000,20000,13200,10800,12000,10800,7200,9000,7200,3600,5400],["165","Đường Lạc Long Quân","Đoạn thuộc địa phận phường Nam Định","Đoạn thuộc địa phận phường Nam Định",17000,14000,15500,10200,8400,9300,8400,5600,7000,5600,2800,4200],["166","Đường Nguyễn Cơ Thạch","Lạc Long Quân","Vũ Hữu Lợi",30000,25000,27500,18000,15000,16500,15000,10000,12500,10000,5000,7500],["167","Quốc lộ 10","Phần nằm trong địa phận phường Nam Định","Phần nằm trong địa phận phường Nam Định",30000,24000,27000,18000,14400,16200,14400,9600,12000,9600,4800,7200],["168","Đường Lộc Vượng - Thôn Tức Mạc phường Lộc Vượng (cũ là đường Nguyễn Ngọc Đồng)","Quốc lộ 10","Đường Tức Mạc",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["169","Đường Cầu Đông","Đường Trần Thái Tông","Quốc lộ 10",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["170","Đường Trần Tung (cũ N1) Khu Sau La","Đường Giải Phóng","Đường Kênh",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["171","Đường Phạm Tuấn Tài (cũ N3) - Khu Sau La","Đường Giải Phóng","Đường Kênh - 9m",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["172","Đường Đặng Trần Côn (Cũ N5) - Khu Sau La","Đường Giải Phóng","Đường Kênh - 9m",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["173","Đường Trần Kỳ (Cũ D1) - Khu Sau La","Khu dân cư","Đường Đặng Trần Côn",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["174","Đường Đoàn Nhữ Hài (Cũ D2) - Khu Sau La","Đường N2","Đường Đặng Trần Côn- 11m",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["175","Đường Đặng Xuân Viện (Cũ D4) - Khu Sau La","Đường Trần Tung","Hội người mù Tân Quang",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["176","Đường Nguyễn Văn Huyên (Cũ D6) - Khu Sau La","Đường Trần Tung","Đường Đặng Trần Côn",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["177","Đường Đặng Vũ Hỷ (Cũ D7) - Khu Sau La","Đường Trần Tung","Khu dân cư (thẳng đường Đặng Trần Côn)",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["178","Đường N2 - Khu Sau La","Đường Trần Kỳ","Đường Nguyễn Văn Huyên",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["179","Đường N4 - Khu Sau La","Đường Trần Kỳ","Đường Nguyễn Văn Huyên",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["180","Đường D5 - Khu Sau La","Đường Phạm Tuấn Tài","Đường N2",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["181","Đường khu Quân Nhân Cửa Bắc","Đường khu Quân Nhân","Cuối đường",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["182","Đường Võ Nguyên Giáp","Đường Trường Chinh","Quốc lộ 10",110000,90000,100000,66000,54000,60000,54000,36000,45000,36000,18000,27000],["183","Đường Đào Tấn (Khu TĐC đường Trần Nhân Tông)","KDC Nguyễn Bính","Mương Kênh Gia - 13m",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["184","Đường Lương Ngọc Quyến (Khu TĐC đường Trần Nhân Tông )","Đường Nguyễn Bính","Mương Kênh Gia 15m",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["185","Đường Bùi Xuân Phái (Khu TĐC đường Trần Nhân Tông)","Đường Lưu Trọng Lư","Mương Kênh Gia - 13m",45000,38000,41500,27000,22800,24900,22800,15200,19000,15200,7600,11400],["186","Đường Đỗ Huy Rừa (Khu TĐC đường Trần Nhân Tông)","Đường Lưu Trọng Lư","Mương Kênh Gia - 13m",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["187","Đường Lưu Trọng Lư (Khu TĐC đường Trần Nhân Tông)","Đường Song Hào","Đường Đỗ Huy Rừa",45000,38000,41500,27000,22800,24900,22800,15200,19000,15200,7600,11400],["188","Đường Tô Vĩnh Diện (N5 cũ) - khu TĐC đường Trần Nhân Tông","Đường Trần Bích San","Đường Tiền Phong",42000,35000,38500,25200,21000,23100,21000,14000,17500,14000,7000,10500],["189","Đường Trần Tự Khánh","Ngã ba Dốc Lốc","Cầu Bùi",42000,38000,40000,25200,22800,24000,22800,15200,19000,15200,7600,11400],["189","Đường Trần Tự Khánh","Cầu Bùi","Quốc lộ 10",42000,38000,40000,25200,22800,24000,22800,15200,19000,15200,7600,11400],["190","Đường Bái (Thôn Bái qua Thượng Lỗi ra đường Trần Thái Tông)","Đường Trần Thái Tông","Đường Kênh",40000,35000,37500,24000,21000,22500,21000,14000,17500,14000,7000,10500],["185","Đường Lê Hồng Sơn (khu tập thể công an tỉnh)","Trần Đăng Ninh","Lương Thế Vinh - 4m",40000,35000,37500,24000,21000,22500,21000,14000,17500,14000,7000,10500],["186","Đường Đoàn Trần Nghiệp (Cạnh chợ 5 tầng)","Trần Đăng Ninh","Khu dân cư",40000,30000,35000,24000,18000,21000,18000,12000,15000,12000,6000,9000],["187","Đường Trần Nghệ Tông (D1 cũ) - khu TĐC Tây đường 38A","Đường Trần Thừa","Quốc lộ 10",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["188","Đường Trần Bang Cẩn (D2 cũ) - khu TĐC Tây đường 38A","Đường Trần Thừa","Đường N4",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["189","Đường N4- khu TĐC Tây đường 38A","Đường D1","Đường D2",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["190","Đường Nguyễn Chí Thanh","Đầu đường","Cuối đường",90000,80000,85000,0,0,0,0,0,0,0,0,0],["191","Đường Văn Tiến Dũng","Đầu đường","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["192","Đường Nguyễn Hữu Huân (Khu TĐC hồ Hàng Nan)","Đầu đường","Cuối đường",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["193","Đường Phạm Đình Kính (Khu TĐC hồ Hàng Nan)","Đầu đường","Cuối đường",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["194","Đường N2 (Khu TĐC hồ Hàng Nan)","Đầu đường","Cuối đường",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["195","Đường D2 (Khu TĐC hồ Hàng Nan)","Đầu đường","Cuối đường",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["196","Phố Đỗ Huy Cảnh","Đường Đào Duy","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["197","Đường Hoàng Văn Tuấn (Khu TĐC Tây Đông Mạc)","Đường Đào Duy","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["198","Đường Trần Đình Long (N3) (Khu TĐC Tây Đông Mạc)","Đường Bế Văn Đàn","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["199","Đường Nguyễn Ngọc Đồng (N7 cũ) - Khu TĐC Tây Đông Mạc","Đường Lương Đình Của","Đường Bế Văn Đàn",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["200","Đường Thích Thế Long (N9 cũ) - Khu TĐC Tây Đông Mạc","Đường Đào Duy Từ","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["201","Đường D1' (Ngõ 59 Trần Thánh Tông) - Khu TĐC Tây Đông Mạc","Đường Chế Lan Viên","Đường N2",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["202","Đường Phạm Thị Vân (D3 cũ) - Khu TĐC Tây Đông Mạc","Đường Vũ Văn Hiếu","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["203","Đường Phan Bá Vành","Đường Vũ Văn Hiếu","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["204","Đường D4' (Khu TĐC Tây Đông Mạc)","Đường Trần Thánh Tông","Khu dân cư cũ",45000,35000,40000,27000,21000,24000,21000,14000,17500,14000,7000,10500],["205","Đường Thép Mới (C6) (Khu TĐC Tây Đông Mạc)","Cầu Sắt","Đường Võ Nguyên Giáp",75000,65000,70000,45000,39000,42000,39000,26000,32500,26000,13000,19500],["206","Đường Lã Xuân Oai (D3 cũ) - Khu TĐC Đông Đông Mạc","Giáp ranh phường Thiên Trường","Đường Trần Thánh Tông",60000,55000,57500,36000,33000,34500,33000,22000,27500,22000,11000,16500],["207","Đường Nguyễn Thị Trinh (D4 cũ) - Khu TĐC Đông Đông Mạc","Giáp ranh phường Thiên Trường","Đường Trần Thánh Tông",65000,55000,60000,39000,33000,36000,33000,22000,27500,22000,11000,16500],["208","Đường Phạm Thế Lịch (N10 + N10' cũ) - Khu TĐC Đông Đông Mạc","Đường Nguyễn Thi","Đường Phạm Văn Xô",60000,55000,57500,36000,33000,34500,33000,22000,27500,22000,11000,16500],["209","Đường Nguyễn Đức Cảnh (Khu TĐC Đông Đông Mạc)","Đường Nguyễn Đức Thuận","Giáp ranh phường Thiên Trường",65000,60000,62500,39000,36000,37500,36000,24000,30000,24000,12000,18000],["209","Đường Nguyễn Đức Cảnh (Khu TĐC Đông Đông Mạc)","Giáp ranh phường Thiên Trường","Cầu Lộc Hạ (Đường ven mương T3-11 cũ)",65000,60000,62500,39000,36000,37500,36000,24000,30000,24000,12000,18000],["210","Đường Trần Đăng Huỳnh (Khu TĐC Đông Đông Mạc)","Vũ Năng An","Nguyễn Thi",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["211","Đường Vũ Năng An (Khu TĐC Đông Đông Mạc)","Trần Thánh Tông","Nguyễn Đức Thuận",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["212","Đường Vũ Xuân Thiều","Đường Vũ Xuân Thiều","Cuối đường",60000,50000,28000,36000,30000,16800,30000,20000,25000,20000,10000,15000],["213","Tuyến đường mương (đường D3) - khu TĐC đường Trần Nhân Tông","Tuyến đường mương (đường D3) - khu TĐC đường Trần Nhân Tông","Cuối đường",25000,20000,22500,15000,12000,13500,12000,8000,10000,8000,4000,6000],["214","Đường Ngô Gia Tự","Đường Trường Chinh","Đường Võ Nguyên Giáp",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["215","Đường Nguyễn Văn Vịnh","Đường nối đường D3, D4 của khu TĐC Đông Đông Mạc (cũ là đường có điểm đầu D3 - điểm cuối D7)","Cuối đường",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["216","Đường trong khu đô thị Dệt may Nam Định","Đường rộng 20,5m","Cuối đường",100000,80000,90000,60000,48000,54000,48000,32000,40000,32000,16000,24000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Đặng Thị Kim: Trần Phú","Trần Đăng Ninh",85000,75000,80000,51000,45000,48000,45000,30000,37500,30000,15000,22500],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Phạm Sư Mạnh: Trần Đăng Ninh","Trần Phú",85000,75000,80000,51000,45000,48000,45000,30000,37500,30000,15000,22500],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Vũ Công Chấn: Trần Phú","Đường N3 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Đoàn Văn Cừ: Đường D2 - Khu đô thị Dệt","Đường Hoàng Hoa Thám",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Vũ Huy Trác: Đường D1 - Khu đô thị Dệt","Đường Hoàng Hoa Thám",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Nguyễn Khải: Đường D4 - Khu đô thị Dệt","Đường D5 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Hoàng Khắc Dược: Đường D4 - Khu đô thị Dệt","Đường D1 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Phạm Đình Hổ: Đường D4 - Khu đô thị Dệt","Đường D2 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Bùi Văn Ba: Đường D2 - Khu đô thị Dệt","Đường D1 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Hà Chương: Đường N4 - Khu đô thị Dệt","Đường Trần Phú",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Trần Mạnh Phấn: Đường N3 - Khu đô thị Dệt","Đường N5 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Trần Doãn Đạt: Đường N3 - Khu đô thị Dệt","Đường N5 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Phúc Đường: Đường Trần Phú","Đường N9 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Phạm Quang Diệu: Đường D8 - Khu đô thị Dệt","Đường D4 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["216","Đường trong khu đô thị Dệt may Nam Định","Phố Đỗ Dương Thanh: Đường D8 - Khu đô thị Dệt","Đường D4 - Khu đô thị Dệt",65000,50000,57500,39000,30000,34500,30000,20000,25000,20000,10000,15000],["217","Đường trục trung tâm phía Nam","Đoạn đường Đặng Xuân Bảng","Đường dẫn cầu Tân Phong",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["217","Đường trục trung tâm phía Nam","Vũ Hữu Lợi","Đặng Xuân Bảng",45000,40000,42500,27000,24000,25500,24000,16000,20000,16000,8000,12000],["218","Đường Tỉnh lộ 476","Ngã tư Hữu Bị","Cầu Bảo Lộc",12000,9000,10500,7200,5400,6300,5400,3600,4500,3600,1800,2700],["218","Đường Tỉnh lộ 476","Cầu Đền Bảo Lộc","Cầu UBND xã",15000,12000,13500,9000,7200,8100,7200,4800,6000,4800,2400,3600],["218","Đường Tỉnh lộ 476","Cầu UBND xã","Cầu Cấp Tiến 1",12000,9000,10500,7200,5400,6300,5400,3600,4500,3600,1800,2700],["218","Đường Tỉnh lộ 476","Cầu Cấp Tiến 1","Ngã 3 Dốc Lốc (hết địa giới phường Nam Định)",25000,15000,20000,15000,9000,12000,9000,6000,7500,6000,3000,4500],["219","Quốc lộ 38A","Ngã ba đền Trần","Đầu cống KC - 02",35000,30000,32500,21000,18000,19500,18000,12000,15000,12000,6000,9000],["219","Quốc lộ 38A","Cống KC- 02","Ao đình Đông",35000,30000,32500,21000,18000,19500,18000,12000,15000,12000,6000,9000],["219","Quốc lộ 38A","Ao đình Đông","Ngã tư Hữu Bị",28000,25000,26500,16800,15000,15900,15000,10000,12500,10000,5000,7500],["220","Đường Du lịch (phía Bắc đường 63B)","Ngã tư Hữu Bị","Cầu Bảo Lộc",25000,22000,23500,15000,13200,14100,13200,8800,11000,8800,4400,6600],["220","Đường Du lịch (phía Bắc đường 63B)","Cầu Đền Bảo Lộc","Cầu UBND xã",25000,20000,22500,15000,12000,13500,12000,8000,10000,8000,4000,6000],["220","Đường Du lịch (phía Bắc đường 63B)","Cầu UBND xã","Ngã ba Dốc Lốc",25000,20000,22500,15000,12000,13500,12000,8000,10000,8000,4000,6000],["221","Đường Vĩnh Giang (từ Cầu Viềng qua cầu Bùi đến Lộc Hòa)","Cầu Viềng","KC-02",22000,18000,20000,13200,10800,12000,10800,7200,9000,7200,3600,5400],["221","Đường Vĩnh Giang (từ Cầu Viềng qua cầu Bùi đến Lộc Hòa)","KC-02","Đình Trần Quang Khải",18000,15000,16500,10800,9000,9900,9000,6000,7500,6000,3000,4500],["221","Đường Vĩnh Giang (từ Cầu Viềng qua cầu Bùi đến Lộc Hòa)","Đình Trần Quang Khải","Cách cầu Bùi 100m",19000,16000,17500,11400,9600,10500,9600,6400,8000,6400,3200,4800],["221","Đường Vĩnh Giang (từ Cầu Viềng qua cầu Bùi đến Lộc Hòa)","Khu vực cầu Bùi","ra 100m (đường Vĩnh Giang hướng Tây + Đông)",22000,18000,20000,13200,10800,12000,10800,7200,9000,7200,3600,5400],["221","Đường Vĩnh Giang (từ Cầu Viềng qua cầu Bùi đến Lộc Hòa)","Cách cầu Bùi 100m","Hết cống ao Dàm",22000,18000,20000,13200,10800,12000,10800,7200,9000,7200,3600,5400],["221","Đường Vĩnh Giang (từ Cầu Viềng qua cầu Bùi đến Lộc Hòa)","Giáp cống ao Dàm","Giáp đường vào Trạm biến áp Mỹ Lộc",20000,15000,17500,12000,9000,10500,9000,6000,7500,6000,3000,4500],["221","Đường Vĩnh Giang (từ Cầu Viềng qua cầu Bùi đến Lộc Hòa)","Đường vào Trạm biến áp Mỹ Lộc","Giáp ranh phường Đông A",14000,10000,12000,8400,6000,7200,6000,4000,5000,4000,2000,3000],["222","Đoạn từ KC-02 đến cầu phao","Sông Vĩnh Giang","Cầu phao Nhân Hậu",20000,15000,17500,12000,9000,10500,9000,6000,7500,6000,3000,4500],["223","Đoạn từ đường 38A đến di tích lịch sử Trần Thủ Độ","Đoạn đường 38A","Di tích lịch sử Trần Thủ Độ",22000,18000,20000,13200,10800,12000,10800,7200,9000,7200,3600,5400],["224","Đường trục phía Nam thành phố Nam Định (cũ)","Đường Vũ Hữu Lợi","Cầu Thiên Trường",45000,40000,42500,27000,24000,25500,24000,16000,20000,16000,8000,12000],["225","Đường Vĩnh Mạc","Đường Lộc Vượng","Đường Trần Tự Khánh",22000,18000,20000,13200,10800,12000,10800,7200,9000,7200,3600,5400],["226","Từ Quốc lộ 10 mới về xóm Hồng Phúc","Đường Đường Bái","Trường trung học Trần Hưng Đạo cũ",18000,15000,16500,10800,9000,9900,9000,6000,7500,6000,3000,4500],["226","Từ Quốc lộ 10 mới về xóm Hồng Phúc","Đường đôi hồ Lộc Vượng qua đường Kênh","QL10",38000,28000,33000,22800,16800,19800,16800,11200,14000,11200,5600,8400],["226","Từ Quốc lộ 10 mới về xóm Hồng Phúc","Đường hồ Lộc Vượng","Cuối đường",22000,18000,20000,13200,10800,12000,10800,7200,9000,7200,3600,5400],["227","Phố Hoàng Việt","Đường Thép Mới","Đường Võ Nguyên Giáp",40000,35000,37500,24000,21000,22500,21000,14000,17500,14000,7000,10500],["228","Đường gom khu dân cư đường Võ Nguyên Giáp","Phố Doãn Kế Thiện","Cuối đường",40000,35000,37500,24000,21000,22500,21000,14000,17500,14000,7000,10500],["229","Khu tái định cư phục vụ GPMB đường Võ Nguyên Giáp","Đường Tức Mạc kéo dài","Lô HH số 6 khu đô thị Thống Nhất",40000,35000,37500,24000,21000,22500,21000,14000,17500,14000,7000,10500],["230","Phố Phạm Đạo Bảo","Đường N1 - khu TĐC phục vụ GPMB phường Nam Định","Đường D3 - khu TĐC phục vụ GPMB phường Nam Định",38000,30000,34000,0,0,0,0,0,0,0,0,0],["231","Phố Vũ Thiện Đễ","Đường D1 - khu TĐC phục vụ GPMB phường Nam Định","Đường N1 - khu TĐC phục vụ GPMB phường Nam Định",38000,30000,34000,0,0,0,0,0,0,0,0,0],["232","Đường N1","Đường Phong Lộc Tây","Đường D1",38000,30000,34000,0,0,0,0,0,0,0,0,0],["233","Phố Lê Châu","Đường D1 - khu TĐC phục vụ GPMB phường Nam Định","Đường D3 - khu TĐC phục vụ GPMB phường Nam Định",38000,30000,34000,0,0,0,0,0,0,0,0,0],["234","Tuyến đường kéo dài mang tên đường cũ","Đường xây dựng mới nối tiếp đường Nguyễn Thượng Hiền (Nguyễn Tri Phương","Trần Huy Liệu) - Khu Tái định cư Trầm Cá",38000,30000,34000,22800,18000,20400,18000,12000,15000,12000,6000,9000],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Đình Thâm","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Phụng Dương","Cuối đường",48000,40000,44000,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Duệ Tông","Cuối đường",58000,48000,53000,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Minh Tông","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Chiêu Đức","Cuối đường",48000,40000,44000,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Huyền Trân","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Đạo Tái","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Thị Dung","Cuối đường",48000,40000,44000,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Khắc Chung","Cuối đường",48000,40000,44000,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Đình Huyên","Cuối đường",48000,40000,44000,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Trần Quốc Tảng","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["235","Khu Văn hoá Đền Trần Lộc Vượng","Đường Lộc Vượng","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["236","Khu đô thị đường Nguyễn Công Trứ","Đường đôi hồ Lộc Vượng qua đường Kênh","QL10",75000,65000,70000,0,0,0,0,0,0,0,0,0],["236","Khu đô thị đường Nguyễn Công Trứ","Đường N1","Cuối đường",65000,55000,60000,0,0,0,0,0,0,0,0,0],["236","Khu đô thị đường Nguyễn Công Trứ","Các tuyến đường còn lại trong khu đô thị","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["237","Đường nội thị tại phường Nam Định","Phố Đỗ Huy Cảnh: Đường Võ Nguyên Giáp","Phố Đào Duy Từ",50000,40000,45000,0,0,0,0,0,0,0,0,0],["237","Đường nội thị tại phường Nam Định","Phố Khiếu Năng Tĩnh: đường Vũ Hữu Lợi","Phong Lộc Tây",42000,35000,38500,0,0,0,0,0,0,0,0,0],["237","Đường nội thị tại phường Nam Định","Phố Nguyễn Tuấn Thông: Đường D1 khu TĐC phục vụ GPMB phường Cửa Nam","đường N1 khu TĐC phục vụ GPMB phường Cửa Nam",42000,35000,38500,0,0,0,0,0,0,0,0,0],["237","Đường nội thị tại phường Nam Định","Phố Nguyễn Hữu Tiến","Cuối đường",42000,35000,38500,25200,21000,23100,21000,14000,17500,14000,7000,10500],["237","Đường nội thị tại phường Nam Định","Đường Vũ Trọng Phụng Đoạn Quốc lộ 10","Cuối khu dân cư",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["237","Đường nội thị tại phường Nam Định","Đường Vĩnh Trường (Ngã 3 cổng trường tiểu học","Ngã 3 Đình Vĩnh Trường)",35000,25000,30000,21000,15000,18000,15000,10000,12500,10000,5000,7500],["237","Đường nội thị tại phường Nam Định","Đường Thượng Hữu: Nguyễn Văn Trỗi","Nguyễn Bính",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["237","Đường nội thị tại phường Nam Định","Phố Nguyễn Hữu Tiến: Võ Nguyên Giáp","Phố Thép Mới",42000,35000,38500,25200,21000,23100,21000,14000,17500,14000,7000,10500],["237","Đường nội thị tại phường Nam Định","Phố Đỗ Huy Cảnh","Cuối đường",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["237","Đường nội thị tại phường Nam Định","Phố Nguyễn Tuấn Thông (Đường D1 khu TĐC phục vụ GPMB phường Cửa Nam - đường N1 khu TĐC phục vụ GPMB phường Cửa Nam)","Cuối đường",42000,35000,38500,25200,21000,23100,21000,14000,17500,14000,7000,10500],["237","Đường nội thị tại phường Nam Định","Phố Thích Tâm Nguyện: Trần Thái Tông","Võ Nguyên Giáp",42000,35000,38500,25200,21000,23100,21000,14000,17500,14000,7000,10500],["238","Các tuyến đường còn lại trên địa bàn phường (Thuộc xã Mỹ Phúc cũ)","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",15000,10000,12500,0,0,0,0,0,0,0,0,0],["238","Các tuyến đường còn lại trên địa bàn phường (Thuộc xã Mỹ Phúc cũ)","Đường có chiều rộng mặt cắt từ 2,5 đến 3,5m","Đường có chiều rộng mặt cắt từ 2,5 đến 3,5m",12000,9000,10500,0,0,0,0,0,0,0,0,0],["238","Các tuyến đường còn lại trên địa bàn phường (Thuộc xã Mỹ Phúc cũ)","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",8000,6000,7000,0,0,0,0,0,0,0,0,0],["239","Khu dân cư tập trung Nội Bồi","Đường N1","Cuối đường",15000,12000,13500,0,0,0,0,0,0,0,0,0],["239","Khu dân cư tập trung Nội Bồi","Đường N2, D1","Cuối đường",12000,9000,10500,0,0,0,0,0,0,0,0,0],["240","Đường Vũ Trọng Phụng","Quốc lộ 10","Cuối khu dân cư",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["241","Đường Vĩnh Trường","Ngã 3 cổng trường tiểu học","Ngã 3 Đình Vĩnh Trường",35000,25000,30000,21000,15000,18000,15000,10000,12500,10000,5000,7500],["242","Đường Thượng Hữu","Nguyễn Văn Trỗi","Nguyễn Bính",60000,50000,55000,36000,30000,33000,30000,20000,25000,20000,10000,15000],["243","Phố Năng Lự","Phố Năng Lự","Cuối đường",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["244","Đường Tiền Phong","Âu cơ","Trần Bích San",50000,40000,45000,30000,24000,27000,24000,16000,20000,16000,8000,12000],["245","Đường dạo hồ phường Cửa Bắc cũ","Đường dạo hồ phường Cửa Bắc cũ","Cuối đường",40000,30000,35000,24000,18000,21000,18000,12000,15000,12000,6000,9000],["246","Khu TDC phường Lộc Vượng (khu vực trường Đại học Lương Thế Vinh)","Đường N1","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["246","Khu TDC phường Lộc Vượng (khu vực trường Đại học Lương Thế Vinh)","Đường N2","Cuối đường",55000,50000,52500,0,0,0,0,0,0,0,0,0],["246","Khu TDC phường Lộc Vượng (khu vực trường Đại học Lương Thế Vinh)","Đường N3","Cuối đường",50000,40000,45000,0,0,0,0,0,0,0,0,0],["246","Khu TDC phường Lộc Vượng (khu vực trường Đại học Lương Thế Vinh)","Đường N4 + N5","Cuối đường",55000,50000,52500,0,0,0,0,0,0,0,0,0]],"Phường Trường Thi":[["1","Quốc lộ 10","Giáp Liên Minh","Hết cầu Chuối",26000,22000,24000,15000,11000,13000,8500,5600,7050,3300,2800,3050],["1","Quốc lộ 10","Giáp cầu Chuối","Hết nhà bà Hường (đầu Trình Xuyên)",30000,23000,26500,17000,12000,14500,8000,5900,6950,3500,3000,3250],["1","Quốc lộ 10","Hết nhà bà Hường","Hết trạm quản lý đường bộ",32000,25000,28500,17000,12000,14500,8400,5800,7100,3400,2900,3150],["1","Quốc lộ 10","Cuối trạm quản lý đường bộ (giáp xã Liên Bảo cũ)","Hết cầu Giành (hết xã Liên Bảo cũ)",32000,23000,27500,17000,11000,14000,8400,5600,7000,3300,2800,3050],["1","Quốc lộ 10","Cầu Giành","Tổ dân phố Tân Thành 9 (hết xã Thành Lợi cũ)",30000,22000,26000,16000,11000,13500,8000,5800,6900,3500,3000,3250],["1","Quốc lộ 10","Từ tổ dân phố Tân Thành 9 (hết xã Thành Lợi cũ)","Đầu tổ dân phố Vụ Bản (xã Lộc An cũ)",30000,20000,25000,16000,10000,13000,8000,5000,6500,3300,2600,2950],["1","Quốc lộ 10","Đầu tổ dân phố Vụ Bản","Giáp phường Thành Nam",30000,23000,26500,16000,12000,14000,8000,5900,6950,3500,3000,3250],["1","Quốc lộ 10","rẽ tổ dân phố Tổ Cầu","Trạm quản lý đường bộ (Nam đường sắt)",20000,13000,16500,12000,7000,9500,6000,3500,4750,2400,1800,2100],["1","Quốc lộ 10","Từ trạm quản lý đường bộ","Giáp tổ dân phố Tân Thành 9 (phía Nam đường sắt)",20000,12000,16000,12000,7000,9500,6500,3200,4850,2400,1700,2050],["1","Quốc lộ 10","Từ giáp tổ dân phố Tân Thành 9","Giáp tổ dân phố Vụ Bản (phía Nam đường sắt)",20000,12000,16000,12000,7000,9500,6000,3200,4600,2400,1700,2050],["2","Tuyến Đường Tân Khánh Liên Bảo","Đoạn từ giáp xã Hiển Khánh","Đường 485B",20000,13000,16500,10000,6000,8000,5500,3000,4250,1900,1200,1550],["3","Tuyến đường trục huyện Bất Di đi Dốc Sắn","Giáp xã Hiển Khánh","Hết tổ dân phố Trung Phu",23000,17000,20000,15000,9000,12000,7000,4300,5650,2600,2300,2450],["3","Tuyến đường trục huyện Bất Di đi Dốc Sắn","Hết tổ dân phố Trung Phu","Quốc lộ 10",32000,25000,28500,20000,10000,15000,9000,5200,7100,3500,2700,3100],["3","Tuyến đường trục huyện Bất Di đi Dốc Sắn","Từ Barie rẽ chợ Gạo (Quốc lộ 10)","Hết trường Nguyễn Đức Thuận (xã Thành Lợi cũ)",32000,25000,28500,20000,10000,15000,9000,5000,7000,3300,2500,2900],["3","Tuyến đường trục huyện Bất Di đi Dốc Sắn","Trường cấp III Nguyễn Đức Thuận","Hết đền Đông",36000,25000,30500,22000,11000,16500,11000,5600,8300,3500,2800,3150],["3","Tuyến đường trục huyện Bất Di đi Dốc Sắn","Đền Đông","Hết cổng trụ sở UBND xã cũ (Đường rẽ vào Xóm Đông)",45000,24000,34500,26000,12000,19000,13000,6200,9600,4000,3200,3600],["3","Tuyến đường trục huyện Bất Di đi Dốc Sắn","Giáp cổng trụ sở UBND xã cũ (Đường rẽ vào Xóm Đông)","Hết trạm y tế phường",50000,30000,40000,27000,14000,20500,14000,6800,10400,4300,3500,3900],["3","Tuyến đường trục huyện Bất Di đi Dốc Sắn","Hết trạm y tế phường","Dốc Sắn (giáp đê Đại Hà)",36000,25000,30500,22000,15000,18500,11000,7000,9000,3200,2800,3000],["4","Tuyến đường chợ Lời - Đại Thắng","Giáp xã Hiển Khánh","Giáp xã Liên Minh (Cống Hương)",28000,20000,24000,15000,10000,12500,8000,5100,6550,3200,2600,2900],["5","Tuyến đường trục huyện Từ xóm Dương Lai đi bờ sông Hùng Vương","Đường sắt (Quốc Lộ 10 xóm Dương Lai)","Hết ngã tư HTX Cốc Thành",26000,18000,22000,17000,10000,13500,9000,5000,7000,2400,2000,2200],["5","Tuyến đường trục huyện Từ xóm Dương Lai đi bờ sông Hùng Vương","Từ hết ngã tư HTX Cốc Thành","Cầu Hùng Vương đến giáp xã Liên Minh",22000,15000,18500,14000,9000,11500,6500,2700,4600,1800,1400,1600],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Nhà ông Bình (giáp Quốc lộ 10)","Hết cầu Rộc",20000,15000,17500,12500,8000,10250,6000,3900,4950,2600,2000,2300],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Ngã ba lối rẽ nhà thờ Trình Xuyên","Đường Trục huyện Bất Di đi Dốc Sắn (tổ dân phố Trung Phu)",18000,12000,15000,10000,6000,8000,5000,4000,4500,2000,1100,1550],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Giáp cầu Rộc","Hết trường THCS Liên Bảo",18000,14000,16000,10000,7000,8500,5000,4000,4500,2200,1800,2000],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Hết trường THCS Liên Bảo","Ngã ba tổ dân phố Định Trạch (chùa Định Trạch)",18000,13000,15500,10000,5000,7500,5000,2500,3750,1500,1100,1300],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Ngã ba tổ dân phố Định Trạch","Quốc lộ 10 (tổ dân phố Tổ Cầu)",18000,12000,15000,10000,4000,7000,5000,2500,3750,1100,800,950],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Ngã ba tổ dân phố Định Trạch","Đường Chợ Lời – Đại Thắng (tổ dân phố Cao Phương)",17000,10000,13500,8000,4000,6000,4000,2500,3250,1100,800,950],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Rẽ cầu Giành (rẽ trường Cao đẳng công nghiệp Nam Định)","Hết địa bàn phường (giáp phường Thành Nam)",17000,10000,13500,8000,4000,6000,5000,2200,3600,1500,1100,1300],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Ngã tư HTX Cốc Thành","Giáp Mả Tấn tổ dân phố xóm A",20000,15000,17500,11000,7000,9000,6000,4500,5250,2300,1900,2100],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Ngã tư HTX Cốc Thành","Hết trường THCS Thành Lợi",22000,15000,18500,12000,9000,10500,6000,4500,5250,2200,1800,2000],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Trường THCS Thành Lợi","Hết Chùa Gạo",32000,23000,27500,17000,10000,13500,10000,6000,8000,3000,2300,2650],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Chùa Gạo","Đám Hát",22000,15000,18500,13000,10000,11500,6500,4600,5550,2700,2300,2500],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Đám Hát","Cầu An Nhân",18000,12000,15000,10000,7000,8500,4300,3500,3900,2200,1800,2000],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Dốc Sắn","Bến đò Kĩa",18000,8000,13000,10000,8000,9000,6000,4000,5000,2400,1900,2150],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Đền Đông","Mả Cuối",25000,15000,20000,15000,10000,12500,8000,5000,6500,1500,1100,1300],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Đường sắt tổ dân phố Tân Thành 9 (Quốc lộ 10)","Đê Đại Hà",25000,15000,20000,13000,8000,10500,8000,5000,6500,2600,2100,2350],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Đường đê Đại Hà Từ Kênh Gia (giáp phường Nam Định)","Đường đê Đại Hà giáp cầu vượt sông Đào (S2)",22000,15000,18500,12000,8000,10000,6500,4000,5250,2000,1600,1800],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Đường đê Đại Hà từ giáp cầu vượt sông Đào (S2)","Lối rẽ tổ dân phố Phú Nội",20000,12000,16000,10000,7000,8500,5500,3300,4400,2200,1800,2000],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Tuyến giao thông tổ dân phố Tân Thành 1","Tổ dân phố Tân Thành 5",16000,10000,13000,9000,6000,7500,5000,2800,3900,1900,1400,1650],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Tuyến giao thông tổ dân phố Tân Thành 1","Đến tổ dân phố Tân Thành 5",16000,10000,13000,9000,5000,7000,5000,3000,4000,2600,2000,2300],["6","Các tuyến đường trục chính trên địa bàn phường Trường Thi","Tuyến giao thông tổ dân phố Tân Thành 6, 7, 8","Tuyến giao thông tổ dân phố Tân Thành 6, 7, 8",18000,15000,16500,10000,6000,8000,5000,2800,3900,1900,1400,1650],["7","Khu dân cư mới xã Thành Lợi","Tuyến đường đôi 12 m","",35000,25000,30000,20000,15000,17500,10000,4000,7000,2500,2000,2250],["7","Khu dân cư mới xã Thành Lợi","Tuyến đường 6 m","",28000,20000,24000,15000,10000,12500,7000,2400,4700,1600,1200,1400],["8","Điểm dân cư tập trung Tân Thành","Điểm dân cư tập trung Tân Thành","Hết khu",22000,15000,18500,13000,8000,10500,6000,3000,4500,1900,1500,1700],["9","Khu dân cư tập trung xã Liên Bảo cũ","Đường D4, N1","Cuối đường",18000,13000,15500,11000,7000,9000,6000,3300,4650,2000,1700,1850],["9","Khu dân cư tập trung xã Liên Bảo cũ","Các thửa (lô) đất còn lại","Cuối đường",15000,11000,13000,8000,6000,7000,5000,2800,3900,1900,1400,1650],["10","Khu đất dịch vụ Khu công nghiệp Bảo Minh","Đất ở","Đất ở",20000,16000,18000,0,0,0,0,0,0,0,0,0],["10","Khu đất dịch vụ Khu công nghiệp Bảo Minh","Đất dịch vụ","Đất dịch vụ",16000,15000,15500,0,0,0,0,0,0,0,0,0],["11","Đường Văn Cao","Ngã 6 Năng Tĩnh","Công ty dệt kim Thắng Lợi",90000,75000,82500,36000,30000,33000,18000,15000,16500,9200,7700,8450],["11","Đường Văn Cao","Phía Nam Đường sắt","Phía Nam Đường sắt",65000,55000,60000,26000,22000,24000,13000,11000,12000,6500,5500,6000],["11","Đường Văn Cao","Phía Bắc Đường sắt","Phía Bắc Đường sắt",60000,50000,55000,24000,20000,22000,12000,10000,11000,6000,5000,5500],["11","Đường Văn Cao","Không tiếp giáp đường sắt","Không tiếp giáp đường sắt",45000,37000,41000,20000,17000,18500,11400,9400,10400,5900,4800,5350],["11","Đường Văn Cao","Tiếp giáp đường sắt","Tiếp giáp đường sắt",23000,17000,20000,12000,9000,10500,7300,5400,6350,4400,3300,3850],["11","Đường Văn Cao","Không tiếp giáp đường sắt","Không tiếp giáp đường sắt",40000,33000,36500,18000,15000,16500,10200,8400,9300,5200,4300,4750],["11","Đường Văn Cao","Tiếp giáp đường sắt","Tiếp giáp đường sắt",18000,15000,16500,9000,8000,8500,5700,4800,5250,3500,2900,3200],["12","Đường Giải Phóng","Đường Văn Cao","Đường Trần Huy Liệu",77000,70000,73500,31000,29000,30000,15600,14200,14900,7800,7100,7450],["12","Đường Giải Phóng","Đường Trần Huy Liệu","Đường Điện Biên",80000,70000,75000,32000,28000,30000,16000,14000,15000,8000,7000,7500],["12","Đường Giải Phóng","Đường Điện Biên","Đường Đông A",94000,83000,88500,38000,34000,36000,18800,16600,17700,9400,8300,8850],["13","Đường Lưu Hữu Phước","Ngã ba đường Phù Nghĩa","Đường Thanh Bình",72000,60000,66000,29000,24000,26500,14400,12000,13200,7200,6000,6600],["14","Đường Âu Cơ (Đê bắc Sông Đào)","Đường Song Hào","Cống Kênh Gia",22000,18000,20000,14000,11000,12500,6600,5400,6000,4400,3600,4000],["15","Đường Nguyễn Thế Rục","Đường Nguyễn Thế Rục","Cuối đường",72000,65000,68500,18000,16000,17000,10100,9200,9650,5100,4600,4850],["16","Đường Lê Anh Xuân","Mương nước","Công ty Tổng hợp",60000,50000,55000,14000,12000,13000,6800,5700,6250,3400,2900,3150],["17","Đường Nguyễn An Ninh","Đường Trần Huy Liệu","Công ty Tổng hợp",60000,50000,55000,14000,12000,13000,6800,5700,6250,3400,2900,3150],["18","Đường Nguyễn Thái Học","Đường Trần Huy Liệu","Công ty Tổng hợp",50000,35000,42500,12000,8000,10000,5600,3900,4750,2800,2000,2400],["19","Đường Nguyễn Huy Tưởng","Đường Nguyễn Tri Phương","Đường Phùng Hưng",50000,38000,44000,12000,9000,10500,5700,4400,5050,2900,2200,2550],["20","Đường Nguyễn Thượng Hiền - xã Lộc An","Trần Huy Liệu","Phùng Hưng",50000,38000,44000,12000,9000,10500,5700,4400,5050,2900,2200,2550],["21","Đường Nguyễn Tri Phương","Đường Giải Phóng","Dọc mương nước khu Trầm Cá",52000,42000,47000,12000,9000,10500,5700,4600,5150,3000,2400,2700],["22","Đường Trần Khát Chân","Mương tiêu nước","Khu dân cư cũ",40000,30000,35000,12000,9000,10500,6000,4500,5250,3100,2400,2750],["23","Đường Đào Hồng Cẩm","Đường Trần Khát Chân","Đường Nguyễn Huy Tưởng",45000,35000,40000,11000,9000,10000,5400,4200,4800,2800,2200,2500],["24","Đường Trần Quý Cáp","Đường Lê Anh Xuân","Đường Nguyễn Thái Học",45000,35000,40000,11000,9000,10000,5400,4200,4800,2800,2200,2500],["25","Đường Xuân Diệu","Đường Trần Khát Chân","Đường Nguyễn Huy Tưởng",45000,35000,40000,11000,9000,10000,5400,4200,4800,2800,2200,2500],["26","Đường Trịnh Hoài Đức","Đường Nguyễn Thái Học","Nguyễn Thế Rục",50000,40000,45000,11000,9000,10000,5300,4200,4750,2700,2200,2450],["26","Đường Trịnh Hoài Đức","Đường Nguyễn Thế Rục","Đường Trần Khát Chân",43000,35000,39000,10000,9000,9500,5100,4100,4600,2600,2200,2400],["27","Đường Phùng Hưng","Đường Nguyễn Thái Học","Đường Trần Khát Chân",45000,36000,40500,10000,8000,9000,5000,4000,4500,2500,2000,2250],["28","Đường Nguyễn Cảnh Chân (N2 cũ) - Khu TĐC Trầm Cá","Đường Lê Anh Xuân","Đường Nguyễn An Ninh",45000,35000,40000,10000,8000,9000,5000,3900,4450,2500,2000,2250],["29","Đường Đỗ Huy Uyển","Đường Lê Anh Xuân","Đường Nguyễn An Ninh",50000,40000,45000,12000,10000,11000,6000,4800,5400,3000,2400,2700],["30","Đường Hoàng Ngọc Phách","Nguyễn Huy Tưởng","Trần Khát Chân",45000,38000,41500,9000,8000,8500,5400,4600,5000,2700,2300,2500],["31","Đường Hoài Thanh","Đào Hồng Cẩm","Xuân Diệu",45000,38000,41500,9000,8000,8500,5400,4600,5000,2700,2300,2500],["32","Đường Nguyễn Khuyến","Ga Nam Định","Khu CN",33000,28000,30500,15000,13000,14000,8400,7100,7750,4200,3600,3900],["33","Tô Hiến Thành (Đường vào trường Nguyễn Trãi cũ)","Đường Giải Phóng","Trường Nguyễn Trãi",39000,30000,34500,18000,14000,16000,9800,7500,8650,4900,3800,4350],["33","Tô Hiến Thành (Đường vào trường Nguyễn Trãi cũ)","Trường Nguyễn Trãi","Mương Kênh Gia",29000,23000,26000,13000,10000,11500,7500,6000,6750,3800,3000,3400],["34","Đường Nguyễn Cao Luyện (Ngõ số 2 cũ - Phường Trường Thi)","Đường Giải Phóng","Khu dân cư",32000,28000,30000,15000,13000,14000,8200,7200,7700,4100,3600,3850],["35","Đường Nguyễn Văn Cừ (Khu TĐC Đồng Quýt)","Trần Nhân Tông","Mương Kênh Gia",55000,45000,50000,0,0,0,0,0,0,0,0,0],["36","Đường Tô Ngọc Vân (Khu TĐC Đồng Quýt)","Đường Phạm Huy Thông","Khu dân cư cũ",40000,35000,37500,0,0,0,0,0,0,0,0,0],["37","Đường Đặng Thai Mai (Khu TĐC Đồng Quýt)","Đường Phạm Huy Thông","Đường Tạ Quang Bửu",40000,35000,37500,0,0,0,0,0,0,0,0,0],["38","Đường Phan Huy Chú (Khu TĐC Đồng Quýt)","Đường Trần Quốc Hoàn","Đường Tạ Quang Bửu",40000,35000,37500,0,0,0,0,0,0,0,0,0],["39","Đường Tạ Quang Bửu (Khu TĐC Đồng Quýt)","Đường Nguyễn Văn Cừ","Khu dân cư cũ",40000,35000,37500,0,0,0,0,0,0,0,0,0],["40","Đường Bùi Thị Xuân (Khu TĐC Đồng Quýt)","Đường Tô Ngọc Vân","Đường Đỗ Nguyên Sáu",40000,35000,37500,0,0,0,0,0,0,0,0,0],["41","Đường Tôn Thất Tùng (Khu TĐC Đồng Quýt)","Đường Văn Cao","Khu dân cư cũ",42000,35000,38500,0,0,0,0,0,0,0,0,0],["42","Đường Trần Quốc Hoàn (N2 cũ) - Khu TĐC Đồng Quýt","Đầu đường","Cuối đường",43000,38000,40500,0,0,0,0,0,0,0,0,0],["43","Đường Trần Thọ Quế","Văn Cao","Nguyễn Văn Cừ",42000,35000,38500,0,0,0,0,0,0,0,0,0],["44","Phố Đặng Ngọc Toản (Đường N4 - Khu TĐC Đồng Quýt)","Đường Đặng Thai Mai","Đường Phan Huy Ích",40000,35000,37500,0,0,0,0,0,0,0,0,0],["45","Phố Nguyễn Quyền (Đường N5 - Khu TĐC Đồng Quýt)","Đường Đặng Thai Mai","Đường Phan Huy Ích",40000,35000,37500,0,0,0,0,0,0,0,0,0],["46","Đường Vũ Công Tự (N7 cũ) - Khu TĐC Đồng Quýt","Đường Đặng Thai Mai","Đường Phan Huy Chú",45000,38000,41500,0,0,0,0,0,0,0,0,0],["47","Đường Phạm Huy Thông (D2 cũ) - Khu TĐC Đồng Quýt","Khu dân cư cũ","Đường Phan Huy Chú",48000,45000,46500,0,0,0,0,0,0,0,0,0],["48","Đường Đặng Tất (D3 cũ) - Khu TĐC Đồng Quýt","Đường Phạm Huy TDPg","Đường Tôn Thất Tùng",40000,35000,37500,0,0,0,0,0,0,0,0,0],["49","Đường Phan Huy Ích (D8 cũ) - Khu TĐC Đồng Quýt","Đường Trần Quốc Hoàn","Đường Bùi Thị Xuân",42000,34000,38000,0,0,0,0,0,0,0,0,0],["50","Đường Lê Trực (D11 cũ) - Khu TĐC Đồng Quýt","Đường Vũ Công Tự","Đường Tạ Quang Bửu",40000,35000,37500,0,0,0,0,0,0,0,0,0],["51","Đường Đỗ Nguyên Sáu (D10 cũ) - Khu TĐC Đồng Quýt","Bùi Thị Xuân","Đường Trần Quốc Hoàn",43000,38000,40500,0,0,0,0,0,0,0,0,0],["52","Đường Đặng Văn Minh - Khu TĐC Đồng Quýt","Tôn Thất Tùng","Đường Trần Quốc Hoàn",40000,35000,37500,0,0,0,0,0,0,0,0,0],["53","Quốc lộ 10","Phía giáp đường sắt","Phía giáp đường sắt",15000,12000,13500,8000,6000,7000,5100,4100,4600,2700,2200,2450],["53","Quốc lộ 10","Phía không giáp đường sắt","Phía không giáp đường sắt",33000,26000,29500,17000,13000,15000,8300,6500,7400,4200,3300,3750],["54","Đường Xuân Trình","Giải Phóng","Ngã 4 giao với ngõ 192 Trần Huy Liệu",35000,30000,32500,15000,13000,14000,8800,7500,8150,4600,3900,4250],["55","Đường D2","Đường D2","Cuối đường",30000,25000,27500,13000,11000,12000,7500,6300,6900,3900,3300,3600],["56","Đường D3","Đường D3","Cuối đường",25000,20000,22500,13000,11000,12000,7600,6100,6850,3900,3200,3550],["57","Đường dạo quanh hồ (Hồ Bảo Bối - Từ đường Tàu đến đường Trần Huy Liệu)","Đường Tàu","Đường Trần Huy Liệu",25000,21000,23000,13000,11000,12000,7500,6300,6900,3800,3200,3500],["58","Phố Thích Thuận Đức (N6)","Đường D1","Đường D5",40000,36000,38000,0,0,0,0,0,0,0,0,0],["59","Tuyến Tỉnh lộ 485B","Giáp xã Thành Lợi","Giáp xã Đại An (cũ)",16000,12000,14000,8000,6000,7000,4000,3000,3500,2000,1500,1750],["59","Tuyến Tỉnh lộ 485B","Giáp xã Liên Bảo (cũ)","Giáp xã Đại Thắng (Cũ)",13000,9000,11000,7000,5000,6000,3500,2400,2950,1800,1200,1500],["60","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Khu vực thuộc phường cũ",15000,10000,12500,0,0,0,0,0,0,0,0,0],["60","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Các vị trí còn lại",12000,10000,11000,0,0,0,0,0,0,0,0,0],["60","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",8000,5000,6500,0,0,0,0,0,0,0,0,0],["60","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",5000,3000,4000,0,0,0,0,0,0,0,0,0]],"Phường Thiên Trường":[["1","Đường Phù Nghĩa","Đường Hàn Thuyên","Đường Trường Chinh",80000,70000,75000,32000,28000,30000,16000,9000,12500,8000,6000,7000],["1","Đường Phù Nghĩa","Đường Trường Chinh","Cầu Lộc Hạ",100000,90000,95000,41000,37000,39000,20000,13000,16500,8000,7000,7500],["1","Đường Phù Nghĩa","Cầu Lộc Hạ","Quốc lộ 10 mới",90000,80000,85000,36000,32000,34000,18000,11000,14500,8000,7000,7500],["1","Đường Phù Nghĩa","Quốc lộ 10 mới","Khu đô thị Mỹ Trung",55000,45000,50000,22000,18000,20000,11000,7000,9000,5000,4000,4500],["2","Đường Thái Bình","Đường Thanh Bình","Trung tâm y tế thành phố (Bệnh viện tình thương)",60000,50000,55000,24000,20000,22000,12000,8000,10000,5000,4000,4500],["2","Đường Thái Bình","Trung tâm y tế thành phố (Bệnh viện tình thương)","Chân cầu Tân Phong",45000,38000,41500,18000,15000,16500,9000,7000,8000,5000,3000,4000],["3","Đường Thanh Bình","Đường Thái Bình","Trạm dầu lửa",43000,34000,38500,18000,14000,16000,9000,6000,7500,5000,2000,3500],["3","Đường Thanh Bình","Trạm dầu lửa","Kênh T3-11",30000,25000,27500,15000,13000,14000,9000,7000,8000,5000,3000,4000],["3","Đường Thanh Bình","Kênh T3-11","Quốc lộ 10 mới",30000,25000,27500,15000,13000,14000,9000,7000,8000,5000,3000,4000],["4","Đường Đê Sông Đào","Trung tâm y tế thành phố (Bệnh viện tình thương)","Chân cầu Tân Phong",15000,12000,13500,8000,6000,7000,5000,3000,4000,3000,2000,2500],["5","Phố Bùi Huy Bích","Trần Anh Tông","Nguyễn Bỉnh Khiêm",55000,50000,52500,22000,20000,21000,11000,9000,10000,6000,4000,5000],["6","Đường Nguyễn Thi (Khu Đông Mạc)","Đường Nguyễn Đức Cảnh","Giáp ranh phường Thiên Trường",60000,50000,55000,24000,20000,22000,12000,9000,10500,6000,4000,5000],["7","Đường Lê Ngọc Hân -Dãy B","Giáp địa phận phường Nam Định","Đường Nguyễn Thị Trinh",55000,50000,52500,25000,22000,23500,11000,9000,10000,6000,4000,5000],["8","Đường Đinh Thị Vân -Dãy C","Giáp địa phận phường Nam Định","Đường Nguyễn Thị Trinh",55000,50000,52500,25000,22000,23500,11000,9000,10000,6000,4000,5000],["9","Đường Chu Văn","Giáp địa phận phường Nam Định","Đường Thanh Bình",45000,40000,42500,18000,16000,17000,9000,7000,8000,5000,3000,4000],["10","Đường Nam Cao - dọc Mương T3-11","Cầu Lộc Hạ","Đường Thanh Bình",45000,35000,40000,27000,21000,24000,9000,6000,7500,5000,3000,4000],["11","Đường Ngô Tất Tố -dọc mương T3-11 P, Lộc Hạ","Cầu Đông Mạc","KĐT Mỹ Trung",45000,35000,40000,27000,21000,24000,9000,6000,7500,5000,4000,4500],["12","Đường Đông Mạc - Phường Lộc Hạ cũ","Cầu Đông Mạc","Đường Phù Nghĩa",45000,35000,40000,20000,16000,18000,9000,6000,7500,5000,4000,4500],["13","Đường Đinh Công Tráng (Đường chùa Đông Mạc)","Đường Đông Mạc","Đường Phù Nghĩa",40000,30000,35000,18000,14000,16000,8000,5000,6500,4000,3000,3500],["14","Đường Tuệ Tĩnh - Phường Lộc Hạ cũ","Đường Phù Nghĩa","Bệnh viện Đông Y",40000,30000,35000,18000,14000,16000,8000,5000,6500,4000,3000,3500],["15","Đường Phạm Ngọc Thạch - Phường Lộc Hạ cũ","Đường Phù Nghĩa","Bệnh viện Phổi Nam Định",60000,50000,55000,24000,20000,22000,12000,9000,10500,6000,4000,5000],["16","Đường Bùi Bằng Đoàn (đường thôn P, Phù Nghĩa cũ)","Đường Phù Nghĩa","Đường Thanh Bình",45000,35000,40000,20000,16000,18000,9000,6000,7500,5000,3000,4000],["17","Đường Đệ Tứ (đường thôn Đệ Tứ cũ)","Từ đường Phù Nghĩa","Nghĩa trang đệ tứ",27000,23000,25000,11000,10000,10500,8000,6000,7000,4000,3000,3500],["17","Đường Đệ Tứ (đường thôn Đệ Tứ cũ)","Nghĩa trang đệ tứ","Khu đô thị Mỹ Trung",25000,21000,23000,13000,11000,12000,8000,5000,6500,4000,3000,3500],["18","Đường Nguyễn Tuân - Phường Lộc Hạ","Đường Thái Bình","Khu đô thị Mỹ Trung",34000,29000,31500,14000,12000,13000,10000,8000,9000,5000,3000,4000],["19","Đường Ngô Thì Nhậm - Phường Lộc Hạ cũ","Đường Thái Bình","Ngõ 43 Nguyễn Tuân",32000,25000,28500,13000,11000,12000,10000,7000,8500,5000,3000,4000],["19","Đường Ngô Thì Nhậm - Phường Lộc Hạ cũ","Ngõ 43 Nguyễn Tuân","Thửa 31, tờ bản đồ số 40, Số nhà 105 (nhà ông Nam)",45000,35000,40000,20000,16000,18000,9000,6000,7500,5000,3000,4000],["19","Đường Ngô Thì Nhậm - Phường Lộc Hạ cũ","Thửa 31, tờ bản đồ số 40, Số nhà 105 (nhà ông Nam)","KĐT Mỹ Trung",28000,23000,25500,13000,10000,11500,8000,6000,7000,4000,3000,3500],["20","Phố Đào Duy Anh (Đường N1)","Đường D2","Đường D3",40000,35000,37500,0,0,0,0,0,0,0,0,0],["20","Phố Phạm Nhữ Tăng (đường N2)","Đường D2","Đường D1",40000,35000,37500,0,0,0,0,0,0,0,0,0],["20","Phố Duy Tân (Đường N3)","Đường D2","Lưu Hữu Phước kéo dài",45000,40000,42500,0,0,0,0,0,0,0,0,0],["20","Phố Dương Khuê (Đường N4)","Đường N4","Đường N3",30000,25000,27500,0,0,0,0,0,0,0,0,0],["20","Phố Chu Mạnh Chinh (Đường D1","Đường N1","Đường N5,N6",45000,40000,42500,0,0,0,0,0,0,0,0,0],["20","Đường D2","Đường N1","N4",45000,40000,42500,0,0,0,0,0,0,0,0,0],["20","Đường vào khu đấu giá","Đầu đường","Cuối đường",30000,25000,27500,0,0,0,0,0,0,0,0,0],["21","Tuyến đường ngõ 193 đường Liên Hà 1 với đường Thanh Bình (ngõ 193 Thanh Bình phường Lộc Hạ cũ)","Đầu đường","Cuối đường",20000,15000,17500,10000,8000,9000,6000,4000,5000,3000,2000,2500],["22","Khu dân cư xóm 3, Mỹ Trung, Mỹ Lộc - nay là TDP 3, phường Thiên Trường: Đường N1","Đường D3","Đến hết công viên đường N1",30000,25000,27500,15000,13000,14000,9000,7000,8000,5000,3000,4000],["22","Khu dân cư xóm 3, Mỹ Trung, Mỹ Lộc - nay là TDP 3, phường Thiên Trường: Đường N2","Đường D3","Đến hết công viên đường N2",20000,15000,17500,10000,8000,9000,6000,4000,5000,3000,2000,2500],["22","Khu dân cư xóm 3, Mỹ Trung, Mỹ Lộc - nay là TDP 3, phường Thiên Trường: Đường D1","Đường N1","Đường N2",20000,15000,17500,10000,8000,9000,6000,4000,5000,3000,2000,2500],["22","Khu dân cư xóm 3, Mỹ Trung, Mỹ Lộc - nay là TDP 3, phường Thiên Trường: Đường D2","Đường N1","Đường N2",30000,25000,27500,15000,13000,14000,9000,7000,8000,5000,3000,4000],["22","Khu dân cư xóm 3, Mỹ Trung, Mỹ Lộc - nay là TDP 3, phường Thiên Trường: Đường D3","Đường N1","Đường N2",20000,15000,17500,10000,8000,9000,6000,4000,5000,3000,2000,2500],["23","Đường Nguyễn Chí Thanh","Đầu đường","Cuối đường",90000,80000,85000,0,0,0,0,0,0,0,0,0],["24","Đường Văn Tiến Dũng","Đầu đường","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["25","Đường Hoàng Văn Thái","Đầu đường","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["26","Đường Nguyễn Lương Bằng","Đầu đường","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["27","Đường Đặng Đoàn Bằng","Đầu đường","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["28","Đường Mỹ Tho","Đầu đường","Cuối đường",70000,65000,67500,0,0,0,0,0,0,0,0,0],["29","Đường Huỳnh Tấn Phát","Đầu đường","Cuối đường",50000,45000,47500,0,0,0,0,0,0,0,0,0],["30","Đường Lê Văn Lương","Đầu đường","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["31","Đường Đoàn Khuê","Đầu đường","Cuối đường",65000,60000,62500,0,0,0,0,0,0,0,0,0],["32","Đường Lê Tiến Phục","Đầu đường","Cuối đường",65000,60000,62500,0,0,0,0,0,0,0,0,0],["33","Đường Vũ Đình Liệu","Đầu đường","Cuối đường",65000,60000,62500,0,0,0,0,0,0,0,0,0],["34","Đường Lê Ngọc Rư","Đầu đường","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["35","Đường Nguyễn Mậu Tài","Đầu đường","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["36","Đường Đào Duy Tùng","Đầu đường","Cuối đường",65000,60000,62500,0,0,0,0,0,0,0,0,0],["37","Đường Hoàng Sâm","Đầu đường","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["38","Đường Vũ Khế Bật","Đầu đường","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["39","Đường Phan Anh","Đầu đường","Cuối đường",63000,55000,59000,0,0,0,0,0,0,0,0,0],["40","Đường Lưu Chí Hiếu","Đầu đường","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["41","Đường Phạm Ngọc Hồ","Đầu đường","Cuối đường",65000,60000,62500,0,0,0,0,0,0,0,0,0],["42","Đường Phạm Thế Hiển","Đầu đường","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["43","Đường Vũ Mạnh Hùng","Đầu đường","Cuối đường",65000,60000,62500,0,0,0,0,0,0,0,0,0],["44","Đường Sơn Nam","Đầu đường","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["45","Đường Lương Khánh Thiện","Đầu đường","Cuối đường",60000,50000,55000,0,0,0,0,0,0,0,0,0],["46","Đường Võ Nguyên Giáp","Đường Võ Nguyên Giáp","Cuối đường",110000,90000,100000,44000,36000,40000,22000,17000,19500,11000,8000,9500],["47","Đường Lã Xuân Oai (D3 cũ) - Khu TĐC Đông Đông Mạc","Giáp ranh phường Thiên Trường","Đường Trần Thánh Tông",60000,55000,57500,24000,22000,23000,12000,10000,11000,6000,4000,5000],["48","Đường Nguyễn Thị Trinh (D4 cũ) - Khu TĐC Đông Đông Mạc","Giáp ranh phường Thiên Trường","Đường Trần Thánh Tông",65000,55000,60000,26000,22000,24000,13000,10000,11500,7000,4000,5500],["49","Đường Trần Cao Vân (D6 cũ) - Khu TĐC Đông Đông Mạc","Đường Nguyễn Đức Cảnh","Đường Phạm Văn Xô",55000,50000,52500,25000,22000,23500,11000,9000,10000,6000,4000,5000],["50","Đường D9- Khu tái định cư Đông Mạc","Từ đường Lã Xuân Oai","đến đường Phạm Thế Lịch",50000,45000,47500,22000,20000,21000,10000,8000,9000,5000,3000,4000],["51","Đường Phạm Thế Lịch (N10 + N10' cũ) - Khu TĐC Đông Đông Mạc","Đường Phạm Văn Xô","Đường Nguyễn Đức Cảnh",60000,55000,57500,24000,22000,23000,12000,10000,11000,6000,4000,5000],["52","Đường Nguyễn Đức Cảnh (Khu TĐC Đông Đông Mạc)","Đường Nguyễn Đức Thuận","Giáp ranh phường Thiên Trường",65000,60000,62500,26000,24000,25000,13000,11000,12000,7000,5000,6000],["52","Đường Nguyễn Đức Cảnh (Khu TĐC Đông Đông Mạc)","Giáp ranh phường Thiên Trường","Cầu Lộc Hạ (Đường ven mương T3-11 cũ)",65000,60000,62500,26000,24000,25000,13000,11000,12000,7000,5000,6000],["52","Đường Nguyễn Đức Cảnh (Khu TĐC Đông Đông Mạc)","Đường Nguyễn Đức Thuận","Cầu Lộc Hạ (Đường ven mương T3-11 cũ)",65000,60000,62500,26000,24000,25000,13000,11000,12000,7000,5000,6000],["53","Đường Trịnh Đình Thảo (Khu TĐC Đông Đông Mạc)","Đường Phạm Văn Xô","Nguyễn Thị Trinh",50000,45000,47500,20000,18000,19000,10000,8000,9000,5000,3000,4000],["54","Phố Đỗ Công Hạo (Đường lưu Hữu Phước kéo dài)","Đường Thanh Bình","Giáp KĐT Mỹ Trung",60000,55000,57500,24000,22000,23000,12000,10000,11000,6000,4000,5000],["55","Khu đô thị Mỹ Trung","Đường nối Lưu Hữu Phước qua bệnh viện 700 giường","Quốc lộ 10",60000,55000,57500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đường Võ Chí Công","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đường Phạm Văn Tráng","Cuối đường",55000,50000,52500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đường Doãn Khuê","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Trần Duy Hưng","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Huy Cận","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Phạm Trung Thứ","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đặng Hữu Dương","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đường Vũ Huy Hào","Cuối đường",50000,45000,47500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Các đường còn lại trong Khu đô thị Mỹ Trung","Cuối đường",40000,35000,37500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đường 11,5m","Cuối đường",45000,40000,42500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đường 13,5m","Cuối đường",50000,45000,47500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đường 17,5m","Cuối đường",55000,50000,52500,0,0,0,0,0,0,0,0,0],["55","Khu đô thị Mỹ Trung","Đường 31m","Cuối đường",60000,55000,57500,0,0,0,0,0,0,0,0,0],["56","Quốc lộ 38A","Đoạn Cầu Viềng","Đường rẽ vào TDP 6",35000,28000,31500,16000,13000,14500,7000,5000,6000,4000,3000,3500],["56","Quốc lộ 38A","Đoạn đường rẽ vào TDP 6","Đường vào Nhà thờ Trần Văn Lan",33000,25000,29000,17000,13000,15000,7000,4000,5500,4000,3000,3500],["56","Quốc lộ 38A","Đoạn đường vào Nhà thờ Trần Văn Lan","Dốc Hữu Bị",25000,20000,22500,13000,10000,11500,8000,5000,6500,4000,3000,3500],["57","Đường WB2","Đoạn Quốc lộ 10","Đường vào TDP 3",20000,15000,17500,10000,8000,9000,6000,4000,5000,3000,2000,2500],["57","Đường WB2","Đoạn giáp đường vào TDP 3","Cầu Bơi",20000,15000,17500,9000,7000,8000,6000,4000,5000,3000,2000,2500],["57","Đường WB2","Cầu Bơi","Hết nhà ông Hồng (đội 8)",14000,10000,12000,7000,5000,6000,4000,2000,3000,2000,1000,1500],["58","Quốc lộ 10 mới","Giáp phường Nam Định","Chân cầu Tân Đệ",33000,25000,29000,17000,13000,15000,7000,4000,5500,4000,3000,3500],["59","Quốc lộ 10 cũ","Đoạn cầu Tân Phong","Lối vào Đền Cây Quế",34000,28000,31000,17000,14000,15500,7000,5000,6000,4000,3000,3500],["59","Quốc lộ 10 cũ","Đoạn lối rẽ Đền Cây Quế","Phà Tân Đệ cũ",26000,21000,23500,15000,12000,13500,8000,5000,6500,4000,3000,3500],["60","Đường nhánh Quốc lộ 10 cũ","Quốc lộ 10 cũ","Đền Cây Quế",20000,15000,17500,11000,8000,9500,6000,4000,5000,3000,2000,2500],["60","Đường nhánh Quốc lộ 10 cũ","Quốc lộ 10 cũ","Đến trường THCS Mỹ Tân",20000,15000,17500,11000,8000,9500,6000,4000,5000,3000,2000,2500],["60","Đường nhánh Quốc lộ 10 cũ","Đền Cây Quế","Cuối tổ dân phố Hưng Phụ Long (nhà ông Huấn)",18000,15000,16500,9000,8000,8500,5000,4000,4500,3000,2000,2500],["61","Đường Ất Hợi","Quốc lộ 10","Hết nhà ông Khôi",15000,12000,13500,9000,7000,8000,5000,3000,4000,3000,2000,2500],["61","Đường Ất Hợi","Giáp nhà ông Khôi","Hết nhà ông Khỏe",18000,15000,16500,11000,10000,10500,5000,4000,4500,3000,2000,2500],["62","Đường ven đê Đông Bắc","Đầu đường","Cuối đường",18000,15000,16500,9000,8000,8500,5000,4000,4500,3000,2000,2500],["63","Đường dẫn cầu Tân Phong","Đầu đường","Cuối đường",20000,16000,18000,10000,8000,9000,6000,4000,5000,3000,2000,2500],["64","Đường trục xã từ Hồng Phú đến Đoàn Kết","Trường THCS Mỹ Tân","Đoàn Kết",15000,10000,12500,9000,6000,7500,5000,4000,4500,3000,2000,2500],["65","Đường trục xã từ Hồng Hà 2 đến Hồng Hà 1","Đường trục xã Hồng Hà 2","Hồng Hà 1",15000,10000,12500,8000,5000,6500,5000,4000,4500,3000,2000,2500],["66","Từ Quốc lộ 10 mới về xóm Hồng Phúc","Quốc lộ 10 mới","Hồng Phúc",10000,8000,9000,5000,4000,4500,3000,2000,2500,2000,1500,1750],["67","Vương Thừa Vũ","Đường Huỳnh Tấn Phát (nằm ở giữa đường Lương Khánh Thiện và đường Vũ Đình Liệu)","Đường Vũ Đình Liệu - Khu ĐTM Thống Nhất",30000,25000,27500,12000,10000,11000,9000,7000,8000,5000,3000,4000],["68","Phạm Tráng","Đoạn đường Phạm Ngọc Hồ","Đường Đoàn Khuê - Khu ĐTM Thống Nhất",30000,25000,27500,12000,10000,11000,9000,7000,8000,5000,3000,4000],["69","Đường nhánh Vũ Đình Liệu","Tương đương N25B-N37B, N37A-N38A - KĐT Thống Nhất","Cuối đường",20000,15000,17500,8000,6000,7000,6000,4000,5000,3000,2000,2500],["70","Đường Liên Hà 1: Từ đầu đường Thái Bình đến hết số nhà 98 (Hộ ông Trần Như Lưu)","Đầu đường Thái Bình","Hết số nhà 98 (Hộ ông Trần Như Lưu)",28000,20000,24000,14000,10000,12000,8000,5000,6500,4000,2000,3000],["71","Đường nội thị phường Thiên Trường","Đoạn Cầu Viềng","Cầu Bơi",30000,25000,27500,14000,12000,13000,9000,7000,8000,5000,3000,4000],["71","Đường nội thị phường Thiên Trường","Đoạn Cầu Bơi","Hết nhà ông Nhân (đội 4)",20000,15000,17500,10000,8000,9000,6000,4000,5000,3000,2000,2500],["71","Đường nội thị phường Thiên Trường","Hết nhà ông Nhân (đội 4)","Hết nhà ông Viên (đội 10 Nhất Đê)",18000,15000,16500,9000,8000,8500,5000,4000,4500,3000,2000,2500],["72","Ngoài đê sông Hồng","Ngoài đê sông Hồng","Cuối đường",12000,10000,11000,7000,3000,5000,4000,2000,3000,2000,1000,1500],["73","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",8000,6000,7000,0,0,0,0,0,0,0,0,0],["73","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",6000,4000,5000,0,0,0,0,0,0,0,0,0],["73","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",5000,3000,4000,0,0,0,0,0,0,0,0,0]],"Phường Đông A":[["1","Quốc lộ 10","Giáp địa phận Lộc Hạ cũ","Đầu chân Cầu Vượt xã Lộc An",38000,30000,34000,19300,15300,17300,9800,7800,8800,4900,3900,4400],["2","Quốc lộ 38B (từ đường D6 khu CN Hòa Xá đến hết địa phận phường Đông A)","Đường đường D6 khu CN Hòa Xá","Hết địa phận phường Đông A",25000,20000,22500,10600,8500,9550,6400,5100,5750,3200,2600,2900],["3","Đại lộ Thiên Trường","Đảo giao thông","Hết địa phận phường Đông A",62000,55000,58500,24800,22000,23400,12400,11000,11700,6200,5500,5850],["4","Đường Điện Biên","Đường Giải Phóng","Cty VT ôtô Nam Định",75000,60000,67500,30300,24200,27250,15300,12200,13750,7800,6200,7000],["4","Từ hết địa phận Cty Vận tải ô tô đến Cầu ốc","Phía không tiếp giáp đường sắt","Phía không tiếp giáp đường sắt",53000,45000,49000,23800,20200,22000,11900,10100,11000,6000,5100,5550],["4","Từ hết địa phận Cty Vận tải ô tô đến Cầu ốc","Phía tiếp giáp đường sắt","Phía tiếp giáp đường sắt",20000,15000,17500,11200,8400,9800,6700,5000,5850,3400,2500,2950],["4","Từ Cầu ốc đến hết địa giới phường Đông A","Phía không tiếp giáp đường sắt","Phía không tiếp giáp đường sắt",42000,35000,38500,18700,15600,17150,9500,7900,8700,4900,4100,4500],["4","Từ Cầu ốc đến hết địa giới phường Đông A","Phía tiếp giáp đường sắt","Phía tiếp giáp đường sắt",15500,13000,14250,8700,7300,8000,5200,4400,4800,2600,2200,2400],["5","Đường Giải Phóng","Đường Trần Huy Liệu","Đường Điện Biên",80000,70000,75000,32000,28000,30000,16000,14000,15000,8000,7000,7500],["5","Đường Giải Phóng","Đường Điện Biên","Đường Đông A",94000,83000,88500,37600,33200,35400,18800,16600,17700,9400,8300,8850],["6","Đường Đông A","Đài phun nước","Quốc lộ 10 mới",150000,130000,140000,60000,52000,56000,24100,20900,22500,9900,8600,9250],["7","Đường Nguyễn Công Trứ","Đường Điện Biên","Hết địa phận phường Đông A",80000,70000,75000,32000,28000,30000,12900,11300,12100,5300,4700,5000],["8","Đường Trương Hán Siêu","Đường Giải Phóng","Đường Trần Anh Tông",52000,45000,48500,20800,18000,19400,8400,7200,7800,3400,2900,3150],["9","Đường Lê Văn Hưu","Công ty vận tải ô tô","Hết địa phận phường Đông A",62000,55000,58500,24800,22000,23400,10100,9000,9550,4200,3700,3950],["10","Đường Phùng Chí Kiên","Đường Đông A","Đường Đặng Văn Ngữ",58000,50000,54000,23200,20000,21600,9400,8100,8750,3900,3400,3650],["11","Đường Nguyễn Bỉnh Khiêm","Phố Bùi Huy Bích","Đường Đặng Văn Ngữ",51000,44000,47500,20400,17600,19000,8300,7200,7750,3400,3000,3200],["12","Đường Yết Kiêu","Đường Đông A","Trương Hán Siêu",57000,48000,52500,22800,19200,21000,9300,7800,8550,3800,3200,3500],["13","Ngõ đường Yết Kiêu","Đầu đường","Cuối đường",50000,35000,42500,20000,14000,17000,8100,5700,6900,3400,2400,2900],["14","Phố Bùi Huy Bích","Trần Anh Tông","Nguyễn Bỉnh Khiêm",52000,45000,48500,20800,18000,19400,8500,7300,7900,3500,3000,3250],["15","Đường Trần Anh Tông","Trung tâm TDTT","Đường Điện Biên",70000,50000,60000,28000,20000,24000,11400,8100,9750,4700,3400,4050],["16","Đường Nguyễn Biểu","Đường Đông A","Đường Hoàng Minh Giám",38000,32000,35000,15200,12800,14000,6200,5200,5700,2600,2200,2400],["17","Đường Trần Quang Triều","Nguyễn Văn Hoan","Phạm Công Trứ",38000,32000,35000,15200,12800,14000,6200,5200,5700,2600,2200,2400],["18","Đường Phạm Công Trứ","Phùng Chí Kiên","Đường Nguyễn Biểu",52000,44000,48000,20800,17600,19200,8500,7200,7850,3500,3000,3250],["19","Đường Hoàng Minh Giám","Nguyễn Công Trứ","Đường Trần Quang Triều",48000,42000,45000,19200,16800,18000,7800,6800,7300,3200,2800,3000],["20","Đường Đặng Văn Ngữ","Đường Trần Anh Tông","Đường Nguyễn Công Trứ",45000,35000,40000,18000,14000,16000,7300,5700,6500,3000,2400,2700],["21","Đường Trần Nguyên Đán","Đường Trần Anh Tông","Khu dân cư Tân An",52000,40000,46000,20800,16000,18400,8500,6500,7500,3500,2700,3100],["22","Đường M1 (KĐT Hòa Vượng)","Phùng Chí Kiên","Đường Đội Nhân",42000,38000,40000,16800,15200,16000,6800,6200,6500,2800,2600,2700],["23","Đường M4 (KĐT Hòa Vượng)","Nguyễn Công Trứ","Đường Khúc Hạo",42000,38000,40000,16800,15200,16000,6800,6200,6500,2800,2600,2700],["24","Đường N1 (KĐT Hòa Vượng)","Phùng Chí Kiên","Đường Đặng Dung",42000,38000,40000,16800,15200,16000,6800,6200,6500,2800,2600,2700],["25","Đường N4 (KĐT Hòa Vượng)","Nguyễn Công Trứ","Đường Đốc Ngữ",47500,42000,44750,19000,16800,17900,7700,6800,7250,3200,2800,3000],["26","Đường Đốc Ngữ","Đường N1","Đặng Văn Ngữ",48000,43000,45500,19200,17200,18200,7800,7000,7400,3200,2900,3050],["27","Đường Đặng Dung","Đường N4","Trần Nguyên Đán",48000,43000,45500,19200,17200,18200,7800,7000,7400,3200,2900,3050],["28","Đường Bùi Đình Hòe - Khu tái định cư Cầu Vượt - Lộc Hòa","Nguyễn Văn Hoan","Đặng Văn Ngữ",43000,40000,41500,19300,18000,18650,9700,9000,9350,5000,4600,4800],["29","Đường Đội Nhân","Nguyễn Văn Hoan","Đường M4",42000,38000,40000,16800,15200,16000,6800,6200,6500,2800,2600,2700],["30","Đường Khúc Hạo","Trần Nguyên Đán","Đường M1",48000,43000,45500,19200,17200,18200,7800,7000,7400,3200,2900,3050],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường N4","Cuối đường",25000,20000,22500,10000,8000,9000,5000,4000,4500,2500,2000,2250],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D2","Cuối đường",20000,17000,18500,8000,6800,7400,4000,3400,3700,2000,1700,1850],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D2-1","Cuối đường",20000,17000,18500,8000,6800,7400,3300,2800,3050,1500,1300,1400],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D2-2","Cuối đường",20000,17000,18500,8000,6800,7400,3300,2800,3050,1500,1300,1400],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D3","Cuối đường",20000,17000,18500,8000,6800,7400,4000,3400,3700,2000,1700,1850],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D4","Cuối đường",20000,17000,18500,8000,6800,7400,4000,3400,3700,2000,1700,1850],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D4-1","Cuối đường",20000,16000,18000,8000,6400,7200,3200,2600,2900,1400,1200,1300],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D4-2","Cuối đường",20000,16000,18000,8000,6400,7200,3200,2600,2900,1400,1200,1300],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D5","Cuối đường",20000,17000,18500,8000,6800,7400,4000,3400,3700,2000,1700,1850],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường N1","Cuối đường",20000,17000,18500,8000,6800,7400,3300,2800,3050,1500,1300,1400],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường N1-1","Cuối đường",20000,17000,18500,8000,6800,7400,3300,2800,3050,1500,1300,1400],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường N2","Cuối đường",20000,17000,18500,8000,6800,7400,4000,3400,3700,2000,1700,1850],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường N3","Cuối đường",20000,17000,18500,8000,6800,7400,4000,3400,3700,2000,1700,1850],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường N3-1","Cuối đường",20000,17000,18500,8000,6800,7400,3300,2800,3050,1500,1300,1400],["31","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D7","Cuối đường",20000,17000,18500,8000,6800,7400,4000,3400,3700,2000,1700,1850],["32","Đường Đỗ Mạnh Đạo (N3)","Đường Phúc Trọng","Đường Giải Phóng",68000,60000,64000,0,0,0,0,0,0,0,0,0],["32","Đường Phạm Văn Ngọ (Đường D9)","Đường Đỗ Mạnh Đạo","Đường sắt",56000,50000,53000,0,0,0,0,0,0,0,0,0],["32","Phố Nguyễn Ngọc Tương (D3)","Đoạn phố Ngô Thế Vinh","Khu dân cư cũ",32000,30000,31000,0,0,0,0,0,0,0,0,0],["32","Phố Nguyễn Ngọc Tương (D3A)","Đoạn đường Kè hồ D3","Cuối đường",32000,30000,31000,0,0,0,0,0,0,0,0,0],["32","Đường Nguyễn Khánh Toàn (N10)","Đường Phúc Trọng","Đường Phạm Văn Ngọ",44000,38000,41000,0,0,0,0,0,0,0,0,0],["32","Đường Xuân Thủy (N11)","Đường Phúc Trọng","Đường Phạm Văn Ngọ",46000,43000,44500,0,0,0,0,0,0,0,0,0],["32","Phố Ngô Thế Vinh (N12)","Đường Phúc Trọng","Đường Lâm Hữu Lập",40000,35000,37500,0,0,0,0,0,0,0,0,0],["32","Đường Phúc Trọng (Đường D1A)","Đường Phạm Ngũ Lão","Khu dân cư",40000,35000,37500,0,0,0,0,0,0,0,0,0],["32","Đường Lâm Hữu Lập (Đường D5)","Đường Phùng Khắc Khoan","Ngô Thế Vinh",45000,35000,40000,0,0,0,0,0,0,0,0,0],["32","Đường Trần Xuân Vinh (Đường D6)","Đường Phùng Khắc Khoan","Phạm Đăng Giảng",45000,35000,40000,0,0,0,0,0,0,0,0,0],["32","Phố Phạm Đăng Giảng","Đường Trần Xuân Vinh","Phố Phạm Văn Ngọ",40000,35000,37500,16000,14000,15000,8000,7000,7500,4000,3500,3750],["32","Phố Trần Lựu","Phố Phạm Đăng Giảng","Đường sắt",40000,35000,37500,16000,14000,15000,8000,7000,7500,4000,3500,3750],["32","Phố Trần Xuân Thiều","Đường Xuân Thủy","Đường Sắt",40000,35000,37500,16000,14000,15000,8000,7000,7500,4000,3500,3750],["32","Phố Nguyễn Huấn","Phố Trần Xuân Thiều","Phố Phạm Văn Ngọ",40000,35000,37500,16000,14000,15000,8000,7000,7500,4000,3500,3750],["33","Phố Phan Lương","Đường Điện Biên","Đường Trương Hán Siêu",50000,40000,45000,20000,16000,18000,10000,8000,9000,5000,4000,4500],["34","Phố Vũ Công Độ","Đường Điện Biên","Cuối đường",30000,25000,27500,12000,10000,11000,6000,5000,5500,3000,2500,2750],["35","Phố Phúc Châu","Đường Điện Biên","Cuối đường",30000,25000,27500,12000,10000,11000,6000,5000,5500,3000,2500,2750],["36","Phố Phú Ốc","Đường Vĩnh Giang","Nhà thờ Phú Ốc",17000,13000,15000,6800,5200,6000,3400,2600,3000,1900,1400,1650],["37","Đường Văn Hưng","Cầu Hoàng","QL 38B",22000,18000,20000,8800,7200,8000,4400,3600,4000,2200,1800,2000],["37","Đường Văn Hưng","Đoạn QL 38B","Cầu bà Sen",18000,15000,16500,7200,6000,6600,3600,3000,3300,1800,1500,1650],["37","Đường Văn Hưng","Cầu bà Sen","Hết địa phận phường Đông A",13000,10000,11500,5200,4000,4600,2600,2000,2300,1300,1000,1150],["38","Đường Hồng Hà","Đường Điện Biên","Đại Lộ Thiên Trường",35000,30000,32500,14000,12000,13000,5700,4900,5300,2500,2100,2300],["39","Đường Vĩnh Giang","Cầu Ốc đường Điện Biên","Đại Lộ Thiên Trường",30000,25000,27500,12000,10000,11000,4800,4000,4400,2000,1700,1850],["40","Đường Trại Vi","Đường Điện Biên","Đường N4 (KDC Lương Xá, Phú Ốc)",16000,13000,14500,6400,5200,5800,2600,2200,2400,1100,900,1000],["40","Đường Trại Vi","Đường N4 (KDC Lương Xá, Phú Ốc)","Hết khu dân cư",12000,9000,10500,4800,3600,4200,2000,1500,1750,800,600,700],["41","Đường Lương Xá (Đường vào nhà máy rác) xã Lộc Hòa : Từ Quốc Lộ 21 đến Nhà máy xử lý rác","Đường Điện Biên","Cầu Hoàng",20000,16000,18000,9100,7300,8200,5500,4400,4950,2800,2300,2550],["41","Đường Lương Xá (Đường vào nhà máy rác) xã Lộc Hòa : Từ Quốc Lộ 21 đến Nhà máy xử lý rác","Cầu Hoàng","Đường vào khu lưu niệm đảng bộ xã Lộc Hòa",18000,15000,16500,9000,7500,8250,5400,4500,4950,2800,2400,2600],["41","Đường Lương Xá (Đường vào nhà máy rác) xã Lộc Hòa : Từ Quốc Lộ 21 đến Nhà máy xử lý rác","Đường vào khu lưu niệm đảng bộ xã Lộc Hòa","Hết địa phận phường Đông A",15000,13000,14000,7500,6500,7000,4500,3900,4200,2300,2000,2150],["42","Đường Tỉnh lộ 476","Dốc Lốc","Dốc Mai",25000,15000,20000,12500,7500,10000,6300,3800,5050,3300,2000,2650],["42","Đường Tỉnh lộ 476","Dốc Mai","Cống 32",15000,12000,13500,7500,6000,6750,3900,3100,3500,2000,1600,1800],["42","Đường Tỉnh lộ 476","Cống 32","Cây xăng Mỹ Hà",11000,8000,9500,5600,4100,4850,2800,2100,2450,1400,1100,1250],["42","Đường Tỉnh lộ 476","Cây xăng Mỹ Hà","Hết địa phận phường Đông A",10000,8000,9000,5200,4100,4650,2300,1800,2050,1200,900,1050],["43","Tuyến đê ất Hợi","Cầu chéo Vị Việt","Cống chéo phường Đông A - Tỉnh lộ 486 (63B)",10000,8000,9000,5200,4200,4700,2800,2300,2550,1400,1200,1300],["44","Đường Trần Tự Khánh","Ngã ba Dốc Lốc","Cầu Bùi",42000,40000,41000,15500,14800,15150,7800,7400,7600,4000,3800,3900],["45","Đường Thịnh Thắng","Giáp địa giới phường Mỹ Lộc","Cống 32",17000,15000,16000,8500,7500,8000,4500,3900,4200,2400,2100,2250],["46","Đường Thắng Hà","Cầu Kim","Cầu Đập",18000,12000,15000,7200,4800,6000,3000,2000,2500,1200,800,1000],["46","Đường Thắng Hà","Cầu Đập","Đê Ất Hợi",16000,10000,13000,6400,4000,5200,2600,1600,2100,1300,800,1050],["47","Đường nội thị phường Đông A","Giáp địa giới phường Mỹ Lộc","Cầu Thịnh",103000,90000,96500,51500,45000,48250,26000,22700,24350,13200,11600,12400],["47","Đường nội thị phường Đông A","Cầu Thịnh","Cầu Kim",97000,85000,91000,48500,42500,45500,24300,21300,22800,12200,10700,11450],["47","Đường nội thị phường Đông A","Cầu Kim","Đình Sắc",105000,90000,97500,52500,45000,48750,26300,22500,24400,13300,11400,12350],["47","Đường nội thị phường Đông A","Dốc Sắc","Cầu Sắc Hòa Hậu",45000,40000,42500,22500,20000,21250,11400,10200,10800,5700,5100,5400],["47","Đường nội thị phường Đông A","Đình Sắc","Đường tỉnh 476",80000,70000,75000,40000,35000,37500,20200,17700,18950,10300,9000,9650],["47","Đường nội thị phường Đông A","Đình Sắc","Phủ Mỹ",65000,60000,62500,32500,30000,31250,16300,15000,15650,8200,7500,7850],["47","Đường nội thị phường Đông A","Cầu Tây","Cầu Nội",90000,80000,85000,45000,40000,42500,22500,20000,21250,11400,10200,10800],["47","Đường nội thị phường Đông A","Đoạn Ngã 3 xóm sau đình Thịnh","Đường Đại lộ Thiên Trường",55000,50000,52500,27500,25000,26250,13800,12500,13150,7200,6500,6850],["47","Đường nội thị phường Đông A","Phủ Mỹ","Dốc Mai",25000,15000,20000,12500,7500,10000,6300,3800,5050,3300,2000,2650],["47","Đường nội thị phường Đông A","Cầu Kim","Đình Kim",40000,30000,35000,20000,15000,17500,10400,7800,9100,5600,4200,4900],["47","Đường nội thị phường Đông A","Đoạn ngã ba xóm sau đình Thịnh","Cầu Nội Trong",40000,30000,35000,20000,15000,17500,10000,7500,8750,5400,4000,4700],["47","Đường nội thị phường Đông A","Cầu Nội","Cầu Nội trong",55000,45000,50000,27500,22500,25000,14300,11700,13000,7700,6300,7000],["47","Đường nội thị phường Đông A","Cầu Thịnh","Đoạn ngã 3 xóm sau đình Thịnh",40000,30000,35000,16000,12000,14000,6700,5000,5850,2700,2000,2350],["47","Đường nội thị phường Đông A","Trường Mầm non Mỹ Thắng khu A","Nhà thờ Như Thức",40000,30000,35000,16000,12000,14000,8000,6000,7000,4000,3000,3500],["47","Đường nội thị phường Đông A","Sân bóng Chín Mười","Phủ Mỹ",40000,30000,35000,16000,12000,14000,8000,6000,7000,4000,3000,3500],["47","Đường nội thị phường Đông A","Cửa hàng HTX mua bán cũ","Cầu Nhân Tiến",14000,10000,12000,7000,5000,6000,3600,2600,3100,1800,1300,1550],["47","Đường nội thị phường Đông A","Đường 2 vào Chợ Sét","Cuối đường",18000,14000,16000,9300,7300,8300,4200,3300,3750,2100,1700,1900],["47","Đường nội thị phường Đông A","Đường 3 vào Chợ Sét","Cuối đường",18000,14000,16000,9400,7300,8350,5100,4000,4550,2600,2000,2300],["47","Đường nội thị phường Đông A","Cây xăng Mỹ Hà","Đê Ất Hợi",18000,14000,16000,9000,7000,8000,4700,3700,4200,2600,2000,2300],["48","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên khu vực Lộc Hòa và TDP Bẩy Tám, Chín Mười","Đường có chiều rộng mặt cắt từ 3,5m trở lên khu vực Lộc Hòa và TDP Bẩy Tám, Chín Mười",40000,30000,35000,0,0,0,0,0,0,0,0,0],["48","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên các TDP còn lại","Đường có chiều rộng mặt cắt từ 3,5m trở lên các TDP còn lại",18000,16000,17000,0,0,0,0,0,0,0,0,0],["48","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 2m đến 3,5m khu vực Lộc Hòa và TDP Bẩy Tám, Chín Mười","Đường có chiều rộng mặt cắt từ 2m đến 3,5m khu vực Lộc Hòa và TDP Bẩy Tám, Chín Mười",10000,8000,9000,0,0,0,0,0,0,0,0,0],["48","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 2m đến 3,5m các TDP còn lại","Đường có chiều rộng mặt cắt từ 2m đến 3,5m các TDP còn lại",7000,6000,6500,0,0,0,0,0,0,0,0,0],["48","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt dưới 2m khu vực Lộc Hòa và TDP Bẩy Tám, Chín Mười","Đường có chiều rộng mặt cắt dưới 2m khu vực Lộc Hòa và TDP Bẩy Tám, Chín Mười",5500,5000,5250,0,0,0,0,0,0,0,0,0],["48","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt dưới 2m các TDP còn lại","Đường có chiều rộng mặt cắt dưới 2m các TDP còn lại",5000,4500,4750,0,0,0,0,0,0,0,0,0]],"Phường Thành Nam":[["1","Đường Giải Phóng","Đường Văn Cao","Đường Trần Huy Liệu",80000,70000,75000,40000,28000,34000,16000,12000,14000,10000,4000,7000],["1","Đường Giải Phóng","Đường Trần Huy Liệu","Đường Điện Biên",85000,75000,80000,43000,30000,36500,20000,17000,18500,10000,5000,7500],["2","Đường Trần Huy Liệu","Đường Giải Phóng","Ngã ba Mỹ Trọng",75000,65000,70000,38000,26000,32000,15000,8000,11500,8000,5000,6500],["2","Đường Trần Huy Liệu","Ngã ba Mỹ Trọng","Quốc lộ 10 mới",63000,57000,60000,32000,23000,27500,13000,8000,10500,6000,4000,5000],["2","Đường Trần Huy Liệu","Quốc lộ 10 mới","Cầu An Duyên",45000,40000,42500,23000,16000,19500,11000,7000,9000,6000,4000,5000],["3","Đường Phạm Ngũ Lão (N5)","Giải Phóng","Quốc lộ 10 mới",80000,70000,75000,40000,28000,34000,16000,11000,13500,8000,6000,7000],["4","Đường Bùi Xuân Mẫn","Đường Phạm Ngũ Lão","Đường Dầu khí",48000,40000,44000,24000,16000,20000,10000,6000,8000,5000,3000,4000],["5","Đường Nguyễn Hới","Đường Phạm Ngũ Lão","Đường Dầu khí",45000,40000,42500,23000,16000,19500,10000,7000,8500,5000,4000,4500],["6","Đường Khuất Duy Tiến","Đường Phạm Ngũ Lão","Đường Dầu khí",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["7","Đường Trần Văn Lan","Đường Bùi Xuân Mẫn","Đường Khuất Duy Tiến",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["8","Đường Trần Quang Tặng","Đường Giải Phóng","Đường Khuất Duy Tiến",45000,40000,42500,23000,16000,19500,9000,6000,7500,5000,3000,4000],["9","Đường Nguyễn Phúc","Đường Bùi Xuân Mẫn","Đường Khuất Duy Tiến",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["10","Đường Trần Văn Ơn","Đường Bùi Xuân Mẫn","Đường Khuất Duy Tiến",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["11","Đường Tào Mạt","Đường Trần Huy Liệu","Đường Mỹ Xá",50000,45000,47500,25000,18000,21500,8000,5000,6500,3000,2000,2500],["12","Đường Vũ Duy Thiện","Từ đường Mỹ Xá","Đường Trần Huy Liệu",30000,25000,27500,15000,10000,12500,5000,3000,4000,3000,2000,2500],["13","Đường Lý Tự Trọng","Đường N6, KCN Hòa Xá","Đường Mỹ Xá",30000,25000,27500,15000,10000,12500,5000,3000,4000,3000,2000,2500],["14","Đường Phùng Khắc Khoan","Giải Phóng","Chùa Phúc Trọng",50000,40000,45000,25000,16000,20500,13000,8000,10500,6000,4000,5000],["15","Đường Nguyễn Khuyến","Ga Nam Định","Khu CN",40000,35000,37500,20000,14000,17000,10000,7000,8500,5000,3000,4000],["16","Tô Hiến Thành (Đường vào trường Nguyễn Trãi cũ)","Đường Giải Phóng","Trường Nguyễn Trãi",60000,55000,57500,30000,22000,26000,15000,12000,13500,8000,6000,7000],["16","Tô Hiến Thành (Đường vào trường Nguyễn Trãi cũ)","Trường Nguyễn Trãi","Mương Kênh Gia",45000,40000,42500,23000,16000,19500,12000,8000,10000,6000,4000,5000],["17","Quốc lộ 10","Giáp địa phận Lộc Hạ cũ","Đầu chân Cầu Vượt xã Lộc An",40000,30000,35000,20000,12000,16000,10000,6000,8000,5000,3000,4000],["18","Đường Vũ Đình Tụng (D4 phía Nam N5)","D7","Mương Kênh Gia",40000,35000,37500,20000,14000,17000,10000,7000,8500,5000,3000,4000],["19","Đường Trần Hữu Tước (Cũ N3 phía Nam N4)","D7","Mương Kênh Gia",40000,35000,37500,20000,14000,17000,10000,7000,8500,5000,3000,4000],["20","Đường Trần Văn Bảo (Cũ N2 phía Nam N3)","Đường D7","Khu Kênh Gia",42000,37000,39500,21000,15000,18000,11000,7000,9000,5000,4000,4500],["21","Đường Vũ Tuấn Chiêu (D1 giáp Kênh Gia)","Đường Phạm Ngũ Lão","Dân cư Mỹ Xá - 15m",45000,40000,42500,23000,16000,19500,9000,6000,7500,5000,3000,4000],["22","Đường Trần Tuấn Khải (D2) phía Đông Đường D1","Đường Phạm Ngũ Lão","Đường N2 - 18,5m",55000,50000,52500,28000,20000,24000,11000,8000,9500,6000,4000,5000],["23","Đường Trần Văn Chử (D3 phía Đông D2","Đường Phạm Ngũ Lão","Khu dân cư Mỹ Xá - 13m",50000,45000,47500,25000,18000,21500,13000,9000,11000,6000,5000,5500],["24","Đường Đào Văn Tiến (D4 phía đông D3)","Đường N4","Đường N2 - 13m",50000,45000,47500,25000,18000,21500,13000,9000,11000,6000,5000,5500],["25","Đường Ngô Gia Khảm ( D5 phía Đông D4)","Đường Phạm Ngũ Lão","Đường N1 - 20,5m",60000,55000,57500,30000,22000,26000,12000,9000,10500,6000,5000,5500],["26","Đường Lê Văn Phúc (D7 phía Đông D6)","Đường N3","Đường N1",40000,35000,37500,20000,14000,17000,10000,7000,8500,5000,3000,4000],["27","Đường Trương Định (N2A, N2B)","Đường Vũ Tuấn Chiêu","Đường Trần Tuấn Khải",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["28","Đường Xuân Hồng (N3A, N3B)","Ngô Gia Khảm","Lê Văn Phúc",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["29","Đường N2 - khu TĐC Dầu Khí","Đường D1","Đường D2",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["30","Đường N3 - khu TĐC Dầu Khí","Đường D1","Đường D2",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["31","Đường N4 - khu TĐC Dầu Khí","Đường D1","Đường D2",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["32","Đường N5 - khu TĐC Dầu Khí","Đường D1","Khu dân cư cũ",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["33","Đường Phạm Văn Ngọ (Đường D9)","Khu dân cư cũ","Đỗ Mạnh Đạo",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["33","Đường Phạm Văn Ngọ (Đường D9)","Đỗ Mạnh Đạo","Đường sắt",55000,50000,52500,0,0,0,0,0,0,0,0,0],["34","Đường Cao Bá Quát","Đỗ Mạnh Đạo","Phùng Khắc Khoan",40000,35000,37500,20000,14000,17000,10000,7000,8500,5000,3000,4000],["35","Đường Mỹ Xá","Trần Huy Liệu","Quốc lộ 10",40000,35000,37500,20000,14000,17000,8000,5000,6500,4000,3000,3500],["36","Đường Đỗ Mạnh Đạo (N3)","Đường Phúc Trọng","Đường Giải Phóng",70000,60000,65000,0,0,0,0,0,0,0,0,0],["36","Phố Thích Thuận Đức (N6)","Đường D1","Đường D5",50000,45000,47500,0,0,0,0,0,0,0,0,0],["36","Phố Đặng Kim Toán (N7)","Đường D5","Đường D6",45000,40000,42500,0,0,0,0,0,0,0,0,0],["36","Phố Ngô Quý Duật (N9)","Phố Đỗ Tông Phát","Phố Trần Văn Gia",45000,40000,42500,0,0,0,0,0,0,0,0,0],["37","Đường Phúc Trọng (Đường D1A)","Đường Phạm Ngũ Lão","Ngô Thế Vinh",45000,40000,42500,0,0,0,0,0,0,0,0,0],["38","Đường Lâm Hữu Lập (Đường D5)","Đường N4 (Phùng Khắc Khoan)","Đường Ngô Thế Vinh",45000,35000,40000,0,0,0,0,0,0,0,0,0],["39","Đường Trần Xuân Vinh (Đường D6)","Đường Phùng Khắc Khoan","Đường Phạm Đăng Giảng",45000,35000,40000,0,0,0,0,0,0,0,0,0],["40","Phố Đỗ Tông Phát (D2)","Phố Thích Thuận Đức","Đường Đỗ Mạnh Đạo",45000,35000,40000,0,0,0,0,0,0,0,0,0],["41","Phố Trần Văn Gia (D7)","Đường Phùng Khắc Khoan","Đường Đỗ Mạnh Đạo",45000,35000,40000,0,0,0,0,0,0,0,0,0],["42","Đường N1","Đường Phùng Khắc Khoan","Đường D1A",45000,40000,42500,0,0,0,0,0,0,0,0,0],["43","Phố Đặng Hồi Xuân (N8)","Phố Đỗ Tông Phát","Phố Trần Văn Gia",45000,40000,42500,0,0,0,0,0,0,0,0,0],["44","Tuyến đường QL 38B đi Nam Định (đường 12 cũ)","Cầu Bát Di (Giáp xã Hiển Khánh)","Cầu An Duyên",26000,22000,24000,13000,11000,12000,7000,5000,6000,3000,2000,2500],["44","Tuyến đường QL 38B đi Nam Định (đường 12 cũ)","TDP Trung Thượng Đại Đê","Giáp phường Mỹ Lộc",22000,18000,20000,11000,9000,10000,6000,4000,5000,3000,2000,2500],["45","Quốc lộ 38B (từ đường D6 khu CN Hòa Xá đến hết địa phận phường Đông A)","Đường đường D6 khu CN Hòa Xá","Cầu Vĩnh Giang",23000,19000,21000,10000,8000,9000,6000,4000,5000,3000,2000,2500],["46","Tuyến Tỉnh lộ 485B","Giáp xã Liên Bảo (cũ)","Xã Hợp Hưng (cũ)",22000,18000,20000,11000,9000,10000,6000,5000,5500,3000,2000,2500],["47","Đường nội thị phường Thành Nam","Ngã ba chợ Quán (đường 38B)","Cầu Đồng Lạc (giáp Hợp Hưng)",15000,10000,12500,8000,5000,6500,4000,3000,3500,1500,1000,1250],["47","Đường nội thị phường Thành Nam","Đoạn nối đường Khả Chính - Bối Xuyên (giáp xã Hợp Hưng)","Đường QL 38B đi Nam Định (công ty Tân Phát Trường Sơn)",18000,14000,16000,9000,7000,8000,5000,2000,3500,1500,1000,1250],["48","Các trục đường chính TDP Đoài 1, Đoài 2, Trung, Thắng, Thượng, Gôi Quan","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",16000,12000,14000,0,0,0,0,0,0,0,0,0],["48","Các trục đường chính TDP Đoài 1, Đoài 2, Trung, Thắng, Thượng, Gôi Quan","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",12000,10000,11000,0,0,0,0,0,0,0,0,0],["48","Các trục đường chính TDP Đoài 1, Đoài 2, Trung, Thắng, Thượng, Gôi Quan","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",9000,7000,8000,0,0,0,0,0,0,0,0,0],["48","Các trục đường chính TDP Đoài 1, Đoài 2, Trung, Thắng, Thượng, Gôi Quan","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",12000,10000,11000,0,0,0,0,0,0,0,0,0],["48","Các trục đường chính TDP Đoài 1, Đoài 2, Trung, Thắng, Thượng, Gôi Quan","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",8000,6000,7000,0,0,0,0,0,0,0,0,0],["48","Các trục đường chính TDP Đoài 1, Đoài 2, Trung, Thắng, Thượng, Gôi Quan","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",4000,3000,3500,0,0,0,0,0,0,0,0,0],["49","TDP Trung Thượng Đại Đê, TDP Giữa An Duyên","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",9000,7000,8000,0,0,0,0,0,0,0,0,0],["49","TDP Trung Thượng Đại Đê, TDP Giữa An Duyên","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",8000,6000,7000,0,0,0,0,0,0,0,0,0],["49","TDP Trung Thượng Đại Đê, TDP Giữa An Duyên","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",5000,4000,4500,0,0,0,0,0,0,0,0,0],["49","TDP Thượng An Duyên; TDP Đông Đại Đê, Tây Đại Đê; An Cự; Ngói; Miễu An Hưng","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",8000,6000,7000,0,0,0,0,0,0,0,0,0],["49","TDP Thượng An Duyên; TDP Đông Đại Đê, Tây Đại Đê; An Cự; Ngói; Miễu An Hưng","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",8000,6000,7000,0,0,0,0,0,0,0,0,0],["49","TDP Thượng An Duyên; TDP Đông Đại Đê, Tây Đại Đê; An Cự; Ngói; Miễu An Hưng","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",4000,3000,3500,0,0,0,0,0,0,0,0,0],["49","Các TDP còn lại","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",8000,6000,7000,0,0,0,0,0,0,0,0,0],["49","Các TDP còn lại","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",5000,4000,4500,0,0,0,0,0,0,0,0,0],["49","Các TDP còn lại","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",3000,2000,2500,0,0,0,0,0,0,0,0,0]],"Phường Vị Khê":[["1","Đường Đặng Xuân Bảng (đường 21 cũ)","Cầu Đò Quan","Cống Trắng (Đường trục phía Nam)",60000,45000,52500,24800,18600,21700,13800,10400,12100,7100,5300,6200],["1","Đường Đặng Xuân Bảng (đường 21 cũ)","Cống Trắng (Đường trục phía Nam)","Ngã tư Lê Đức Thọ",44000,35000,39500,22000,17500,19750,11000,8800,9900,5500,4400,4950],["1","Đường Đặng Xuân Bảng (đường 21 cũ)","Ngã tư Lê Đức Thọ","Cầu Nam Vân",33000,28000,30500,16500,14000,15250,8300,7000,7650,4200,3500,3850],["2","Quốc lộ 21","Cầu Vòi","Cầu Đỗ Xá",43000,38000,40500,21800,19200,20500,11000,9700,10350,5600,5000,5300],["2","Quốc lộ 21","Cầu Đỗ Xá","Giáp xã Nam Hồng",42000,38000,40000,21300,19200,20250,10900,9800,10350,5600,5000,5300],["2","Quốc lộ 21","Đoạn Vụng Định Lễ Nam Vân","Đất nhà ông Hùng",36000,34000,35000,18200,17100,17650,9300,8800,9050,4700,4400,4550],["3","Đường Lạc Long Quân","Đoạn chân cầu đò Quan","Đường dẫn cầu Tân Phong",17000,14000,15500,10200,8400,9300,5100,4200,4650,3400,2800,3100],["4","Đường dẫn cầu Tân Phong","Đường đê Lạc long Quân","Quốc lộ 21",32000,28000,30000,16200,14200,15200,8200,7200,7700,4100,3600,3850],["4","Đường dẫn cầu Tân Phong","Cầu Tân Phong xã Nam Phong","Đường đê Lạc long Quân",27000,23000,25000,10800,9200,10000,5400,4600,5000,2700,2300,2500],["5","Đường trục Nam Phong","Đoạn từ trường Nông Nghiệp","Đê Lạc Long Quân",25000,20000,22500,12500,10000,11250,6300,5000,5650,3200,2500,2850],["5","Đường trục Nam Phong","Cống Khúc","Đê Lạc Long Quân",25000,20000,22500,12500,10000,11250,6300,5000,5650,3200,2500,2850],["5","Đường trục Nam Phong","Từ đê Lạc Long Quân (nhà ông Chí, phù Long 1)","Đường dẫn cầu Tân Phong",13000,8000,10500,6500,4000,5250,3300,2000,2650,1700,1100,1400],["5","Đường trục Nam Phong","Đường dẫn cầu Tân Phong","Điếm Ngô Xá",16000,12000,14000,8000,6000,7000,4000,3000,3500,2100,1600,1850],["5","Đường trục Nam Phong","Đường Đê Bối: Từ điếm Vạn Diệp","Điếm Ống Bò",10000,6000,8000,5000,3000,4000,2700,1600,2150,1400,800,1100],["6","Tỉnh lộ 490C (Đường 55 cũ)","Cầu Cao","Giáp đất giáp xã Nam Trực",40000,35000,37500,20300,17800,19050,10300,9000,9650,5300,4600,4950],["7","Đường Lê Đức Thọ (Đường S2 cũ)","Tỉnh lộ 490C (Đường 55 cũ)","Ngã tư QL 21",30000,28000,29000,15000,14000,14500,6000,5600,5800,3000,2800,2900],["8","Đường trục trung tâm phía Nam","Đoạn đường Đặng Xuân Bảng","Đường dẫn cầu Tân Phong",33000,28000,30500,10600,9000,9800,5300,4500,4900,2700,2300,2500],["9","Đường An Thắng","Cầu Cao (đường 490)","Cầu Mì (giáp ranh phường Hồng Quang)",23000,21000,22000,11800,10800,11300,6000,5500,5750,3000,2800,2900],["9","Đường An Thắng","Cầu Mì (giáp ranh phường Hồng Quang)","Giáp trại cá giống (giáp đất Hồng Quang)",23000,21000,22000,11500,10500,11000,8800,8000,8400,4400,4000,4200],["9","Đường An Thắng","Cầu Đỗ Xá","Chợ Mành",27000,25000,26000,13500,12500,13000,8600,8000,8300,4300,4000,4150],["9","Đường An Thắng","Chợ Mành","Giáp xã Nam Hồng",23000,21000,22000,11800,10800,11300,6000,5500,5750,3000,2800,2900],["10","Đường trục Nam Mỹ","Đường Mỹ Điền: Đoạn từ ngã ba đường 21","Đường dẫn cầu Tân Phong",25000,20000,22500,12500,10000,11250,6400,5100,5750,3200,2600,2900],["10","Đường trục Nam Mỹ","Đường Mỹ Điền: Đoạn từ Đường dẫn cầu Tân Phong","Đê Hữu hồng",26000,24000,25000,13000,12000,12500,6500,6000,6250,3300,3000,3150],["10","Đường trục Nam Mỹ","Đường Phong Quang: đường Ngô Xá xã Nam Phong","Trạm bơm Bùi Hạ (4,000m3/h)",17000,14000,15500,8500,7000,7750,4200,3500,3850,2200,1800,2000],["11","Đường trục Nam Toàn","Ngã ba Quốc lộ 21","Đường An Thắng",18500,15000,16750,9300,7500,8400,4600,3700,4150,2400,2000,2200],["11","Đường trục Nam Toàn","Từ Nhà ông Kiên","Đường Lê Đức Thọ",16000,14000,15000,8000,7000,7500,4000,3500,3750,2100,1800,1950],["11","Đường trục Nam Toàn","Đường Lê Đức Thọ","Đường An Thắng",16000,14000,15000,8000,7000,7500,4000,3500,3750,2100,1800,1950],["12","Đường trục Điền Xá","Đường số 6: Từ Quốc lộ 21","Đường đê Hữu Hồng",42000,35000,38500,21000,17500,19250,10100,8400,9250,5100,4200,4650],["12","Đường trục Điền Xá","Đường số 8: Quốc lộ 21","Chợ Mành",32000,28000,30000,16000,14000,15000,8000,7000,7500,4000,3500,3750],["12","Đường trục Điền Xá","Đoạn từ Chợ Mành","cuối đường số 8",32000,28000,30000,16000,14000,15000,8000,7000,7500,4000,3500,3750],["12","Đường trục Điền Xá","Đoạn cầu công nhân","Đường Nguyễn Hiền (Ngã tư bot điện 2)",36000,35000,35500,18000,17500,17750,9000,8800,8900,4700,4600,4650],["12","Đường trục Điền Xá","Đoạn cầu Đỗ Xá (chợ Nam Xá)","Cầu giáp xã Nam Thắng",30000,28000,29000,15000,14000,14500,7500,7000,7250,3800,3500,3650],["12","Đường trục Điền Xá","Đường Nguyễn Hiền : Đoạn từ Nhà Máy nước (đê Hữu Hồng).","Cầu Cối",30000,25000,27500,15000,12500,13750,7500,6300,6900,3800,3200,3500],["12","Đường trục Điền Xá","Cầu Cối","giáp xã Nam Hồng",26000,24000,25000,13000,12000,12500,6500,6000,6250,3300,3000,3150],["12","Đường trục Điền Xá","Đường Hoàng Thụ: đoạn chợ Trừng Uyên","Đường đê Hữu Hồng",23000,20000,21500,11500,10000,10750,5800,5000,5400,3100,2700,2900],["13","Khu dân cư tập trung khu vực Quyết Tiến","Đường D1: Từ đường 45m","vào trong KDC",28000,26000,27000,0,0,0,0,0,0,0,0,0],["13","Khu dân cư tập trung khu vực Quyết Tiến","Đường N1: đường D1","Đường bê tông cũ",22000,20000,21000,0,0,0,0,0,0,0,0,0],["13","Khu dân cư tập trung khu vực Quyết Tiến","Đường N2: đường D1","Cuối đường",15000,13000,14000,0,0,0,0,0,0,0,0,0],["14","Khu dân cư Ao Lân Tuyền","Khu dân cư Ao Lân Tuyền","Hết khu",13000,10000,11500,6700,5200,5950,3400,2600,3000,1700,1300,1500],["16","Khu tái định cư, khu dân cư tập trung xã Nam Toàn","Đường N2: đường nối từ đường D5","vào trong KDC",19000,16500,17750,0,0,0,0,0,0,0,0,0],["16","Khu tái định cư, khu dân cư tập trung xã Nam Toàn","Đường N3: đường nối từ đường D5","vào trong KDC",19000,16500,17750,0,0,0,0,0,0,0,0,0],["16","Khu tái định cư, khu dân cư tập trung xã Nam Toàn","Đường N4: đoạn từ đường D5 đến D4","vào trong KDC",19000,16500,17750,0,0,0,0,0,0,0,0,0],["16","Khu tái định cư, khu dân cư tập trung xã Nam Toàn","Đường D1","Cuối đường",17000,15000,16000,0,0,0,0,0,0,0,0,0],["16","Khu tái định cư, khu dân cư tập trung xã Nam Toàn","Đường D2","Cuối đường",18000,15000,16500,0,0,0,0,0,0,0,0,0],["16","Khu tái định cư, khu dân cư tập trung xã Nam Toàn","Đường D3","Cuối đường",19000,16000,17500,0,0,0,0,0,0,0,0,0],["16","Khu tái định cư, khu dân cư tập trung xã Nam Toàn","Đường D4","Cuối đường",19000,16000,17500,0,0,0,0,0,0,0,0,0],["16","Khu tái định cư, khu dân cư tập trung xã Nam Toàn","Đường D5 (Đường phía Đông ngoài cùng khu dân cư, nối từ đường Lê Đức Thọ vào khu dân cư)","Cuối đường",22000,18000,20000,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường D1","Cuối đường",20000,18000,19000,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường D2","Cuối đường",21000,19000,20000,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường D3","Cuối đường",24000,21000,22500,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường D4","Cuối đường",21000,19000,20000,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường D5","Cuối đường",20000,18000,19000,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường D6","Cuối đường",25000,22000,23500,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường N1","Cuối đường",22000,19000,20500,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường N2","Cuối đường",21000,19000,20000,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường N3","Cuối đường",21000,19000,20000,0,0,0,0,0,0,0,0,0],["17","Khu dân cư Vạn Diệp","Đường N4","Cuối đường",21000,19000,20000,0,0,0,0,0,0,0,0,0],["18","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Thuộc khu vực phường Nam Phong cũ",9000,6000,7500,0,0,0,0,0,0,0,0,0],["18","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Các khu vực còn lại",8000,6000,7000,0,0,0,0,0,0,0,0,0],["18","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",6000,3000,4500,0,0,0,0,0,0,0,0,0],["18","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",4000,2000,3000,0,0,0,0,0,0,0,0,0]],"Phường Hồng Quang":[["1","Đường Đặng Xuân Bảng (đường 21 cũ)","Cống Trắng (Đường trục phía Nam)","ngã tư Lê Đức Thọ",35000,30000,32500,17500,15000,16250,8800,7500,8150,4400,3800,4100],["1","Đường Đặng Xuân Bảng (đường 21 cũ)","ngã tư Lê Đức Thọ","Cầu Nam Vân",32000,28000,30000,16000,14000,15000,8000,7000,7500,4000,3500,3750],["2","Quốc lộ 21","Cầu Nam Vân","Cầu Vòi",43000,36000,39500,21500,18000,19750,10800,9000,9900,5400,4500,4950],["2","Quốc lộ 21","Đoạn ngã ba cầu Vòi","Cầu Dứa",31000,27000,29000,15500,13500,14500,7800,6800,7300,3900,3400,3650],["2","Quốc lộ 21","Đoạn cầu Dứa","Giáp đất xã Nam Trực",26000,25000,25500,13000,12500,12750,6600,6400,6500,3300,3200,3250],["3","Tỉnh lộ 490C (Đường 55 cũ)","Đoạn giáp thành phố Nam Định","Ngã tư đường Lê Đức Thọ",33000,28000,30500,16500,14000,15250,8500,7200,7850,4300,3600,3950],["3","Tỉnh lộ 490C (Đường 55 cũ)","Đoạn ngã tư đường Lê Đức Thọ","Cầu Cao",34000,30000,32000,17000,15000,16000,8500,7500,8000,4300,3800,4050],["3","Tỉnh lộ 490C (Đường 55 cũ)","Đoạn cầu Cao","Chợ Cà",33000,29000,31000,16500,14500,15500,8400,7400,7900,4200,3700,3950],["3","Tỉnh lộ 490C (Đường 55 cũ)","Đoạn giáp đất Nam Cường","Giáp đất TT Nam Giang (phía tây đường)",36000,30000,33000,18000,15000,16500,9000,7500,8250,4500,3800,4150],["4","Đường Lê Đức Thọ (Đường S2 cũ)","Cầu vượt sông Đào","Tỉnh lộ 490C (Đường 55 cũ)",33000,28000,30500,16500,14000,15250,6600,5600,6100,3300,2800,3050],["4","Đường Lê Đức Thọ (Đường S2 cũ)","Tỉnh lộ 490C (Đường 55 cũ)","Ngã tư QL 21",33000,28000,30500,16500,14000,15250,6600,5600,6100,3300,2800,3050],["5","Đường Quốc phòng (phía Nam đường)","Đoạn đường tỉnh lộ 490C","Đê Đại Hà",13000,10000,11500,6500,5000,5750,3300,2500,2900,1700,1300,1500],["6","Đường Ông Ty","Đoạn Đình Thượng Hữu","Trạm Bơm",14000,10000,12000,8000,5800,6900,4000,2900,3450,2000,1500,1750],["7","Đường Hồ Sen ( TDP Địch Lễ B)","Ngã 3 Lê Đức Thọ","QL 21",14000,10000,12000,8000,5800,6900,4000,2900,3450,2000,1500,1750],["8","Đường An Thắng","Đoạn TL 490C","Đê Đại Hà",24000,20000,22000,12000,10000,11000,6000,5000,5500,3000,2500,2750],["8","Đường An Thắng","Giáp đất xã Nam Toàn","Ngã ba Quốc lộ 21",26000,22000,24000,13300,11300,12300,7000,5900,6450,3500,3000,3250],["9","Đường An Quang","Đoạn ngã ba Quốc lộ 21","Cầu Ảnh",13000,10000,11500,6500,5000,5750,3400,2600,3000,1700,1300,1500],["9","Đường An Quang","Đoạn cầu Ảnh","Cầu Trắng",12000,10000,11000,6000,5000,5500,3100,2600,2850,1600,1300,1450],["9","Đường An Quang","Đoạn cầu Trắng","Giáp xã Nam Trực",18000,13000,15500,9000,6500,7750,3600,2600,3100,1800,1300,1550],["10","Đường Phong Quang","Đoạn trạm bơm Bùi Hạ","Cầu Vòi (Dọc sông Châu Thành)",16000,13000,14500,8000,6500,7250,4000,3300,3650,2200,1800,2000],["11","Đường trục phía Nam thành phố Nam Định (ĐT 484)","Đường Vũ Hữu Lợi","Sông Lèo",40000,36000,38000,0,0,0,0,0,0,0,0,0],["11","Đường trục phía Nam thành phố Nam Định (ĐT 484)","Sông Lèo","Đường Lê Đức Thọ (S2)",22000,20000,21000,8800,8000,8400,4400,4000,4200,2200,2000,2100],["11","Đường trục phía Nam thành phố Nam Định (ĐT 484)","Đường Lê Đức Thọ (đường S2)","phường Vị Khê",20000,18000,19000,10000,9000,9500,5000,4500,4750,2500,2300,2400],["11","Đường trục phía Nam thành phố Nam Định (ĐT 484)","Phường Vị Khê","xã Nam Trực",17000,16000,16500,8500,8000,8250,4300,4000,4150,2200,2000,2100],["11","Đường trục phía Nam thành phố Nam Định (ĐT 484)","Xã Nam Trực","QL 21",17000,16000,16500,8500,8000,8250,4300,4000,4150,2200,2000,2100],["12","Đường nội thị tại phường Hồng Quang","Đoạn ngã ba đường tỉnh lộ 490C","Hết UBND xã",17000,12000,14500,8500,6000,7250,4500,3200,3850,2400,1700,2050],["12","Đường nội thị tại phường Hồng Quang","Đoạn giáp UBND xã","Đê Đại Hà (Nam An)",13000,10000,11500,6500,5000,5750,3600,2800,3200,2000,1500,1750],["12","Đường nội thị tại phường Hồng Quang","Đoạn ngã ba Tỉnh lộ 490C","Trường MN Nam Nghĩa",16000,12000,14000,8000,6000,7000,4200,3200,3700,2300,1700,2000],["12","Đường nội thị tại phường Hồng Quang","Đoạn trường MN Nam Nghĩa","Hết khu tái định cư số 01",13000,10000,11500,6500,5000,5750,3300,2500,2900,1700,1300,1500],["12","Đường nội thị tại phường Hồng Quang","Đoạn ngã ba Vân Đồn","Trường MN Nam Nghĩa",12000,11000,11500,6000,5500,5750,3000,2800,2900,1500,1400,1450],["12","Đường nội thị tại phường Hồng Quang","Đoạn chợ An Lá","Đường Quốc Phòng",13000,12000,12500,5600,5200,5400,3000,2800,2900,1500,1400,1450],["12","Đường nội thị tại phường Hồng Quang","Đoạn giáp đất xã Nam Trực (cầu Nguyễn)","Đê Đại Hà",13000,11000,12000,5800,4900,5350,3200,2700,2950,1600,1400,1500],["12","Đường nội thị tại phường Hồng Quang","Cầu Dứa","TDP Mộng Giáo",13000,11000,12000,5800,4900,5350,3200,2700,2950,1600,1400,1500],["12","Đường nội thị tại phường Hồng Quang","TDP Mộng Giáo","Xuống TDP Bàn Thạch",13000,10000,11500,6500,5000,5750,3600,2800,3200,2000,1500,1750],["12","Đường nội thị tại phường Hồng Quang","Công chào đường QL21","Cầu Chiền",17000,13000,15000,8500,6500,7500,4300,3300,3800,2200,1700,1950],["13","Đường chùa Bồ đề","Đoạn đường VHL","Đường trục xã Nam Vân cũ",18000,14000,16000,7200,5600,6400,3600,2800,3200,1800,1400,1600],["14","Từ đường Vũ Hữu Lợi qua UBND xã đến đường Đặng Xuân Bảng","Đường Vũ Hữu Lợi qua UBND xã","Đường Đặng Xuân Bảng",27000,20000,23500,11300,8400,9850,6800,5000,5900,3400,2500,2950],["15","Tuyến đường, đoạn đường trong các khu đô thị phía Nam Sông Đào","Đường trục trung tâm phía Nam thành phố","Cuối đường",43000,38000,40500,0,0,0,0,0,0,0,0,0],["15","Tuyến đường, đoạn đường trong các khu đô thị phía Nam Sông Đào","Tuyến đường chính số 2, số 3","Cuối đường",36000,32000,34000,0,0,0,0,0,0,0,0,0],["15","Tuyến đường, đoạn đường trong các khu đô thị phía Nam Sông Đào","Tuyến đường số 4, số 4A","Cuối đường",31000,26000,28500,0,0,0,0,0,0,0,0,0],["15","Tuyến đường, đoạn đường trong các khu đô thị phía Nam Sông Đào","Các tuyến đường còn lại trong KĐT","Cuối đường",26000,24000,25000,0,0,0,0,0,0,0,0,0],["16","Khu dân cư tập trung Nội Bồi","Đường N1","Cuối đường",12000,10000,11000,0,0,0,0,0,0,0,0,0],["16","Khu dân cư tập trung Nội Bồi","Đường N2, D1","Cuối đường",9000,8000,8500,0,0,0,0,0,0,0,0,0],["18","Khu tái định cư (khu tái định cư số 1, 2, 3)","Khu tái định cư (khu tái định cư số 1, 2, 3)","Hết khu",16000,15000,15500,6900,6500,6700,3700,3500,3600,0,0,0],["19","Khu tái định cư giáp mặt đường trục xã Nghĩa An (cũ)","Khu tái định cư giáp mặt đường trục xã Nghĩa An (cũ)","Hết khu",16000,15000,15500,8000,7500,7750,4000,3800,3900,0,0,0],["21","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",8500,7000,7750,0,0,0,0,0,0,0,0,0],["21","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 2 đến 3,5m","Đường có chiều rộng mặt cắt từ 2 đến 3,5m",5500,4500,5000,0,0,0,0,0,0,0,0,0],["21","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",3500,3000,3250,0,0,0,0,0,0,0,0,0]],"Phường Mỹ Lộc":[["1","Quốc Lộ 21","Km số 4","Giáp Ngân hàng Nông nghiệp",40000,32000,36000,20000,16000,18000,10000,7000,8500,5000,4000,4500],["1","Quốc Lộ 21","Ngân hàng Nông Nghiệp","Cầu Đặng",35000,30000,32500,18000,15000,16500,9000,7000,8000,4000,3000,3500],["1","Quốc Lộ 21","Cầu Đặng","Hết cầu Giáng",35000,30000,32500,18000,15000,16500,9000,7000,8000,4000,3000,3500],["1","Quốc Lộ 21","Cầu Giáng","Cổng UBND xã Mỹ Thịnh (cũ)",32000,27000,29500,16000,14000,15000,8000,6000,7000,4000,2000,3000],["1","Quốc Lộ 21","Đường phía Nam Đường Sắt","Cuối đường",13000,9000,11000,7000,6000,6500,5000,4000,4500,3000,2000,2500],["1","Quốc Lộ 21","Giáp xã Hiển khánh - huyện Vụ Bản (cũ)","Cây xăng dầu khí",28000,22000,25000,14000,11000,12500,7000,5000,6000,4000,2500,3250],["1","Quốc Lộ 21","Giáp Cây xăng dầu khí","Hết Trạm thu phí Mỹ Lộc cũ",30000,25000,27500,15000,13000,14000,8000,6000,7000,4000,2500,3250],["1","Quốc Lộ 21","Giáp trạm thu phí","Hết cây xăng Hàng Không",30000,25000,27500,15000,13000,14000,8000,5000,6500,4000,2500,3250],["1","Quốc Lộ 21","Giáp cây xăng hàng không","Cầu Họ",30000,25000,27500,15000,13000,14000,8000,6000,7000,4000,2500,3250],["1","Quốc Lộ 21","Nam Quốc Lộ 21 (Nam đường sắt)","Cuối đường",18000,12000,15000,9000,6000,7500,5000,4000,4500,3000,2000,2500],["1","Quốc Lộ 21","UBND xã Mỹ Lộc (cũ)","Ngã ba Đồng Nhuệ",25000,20000,22500,13000,10000,11500,6000,4000,5000,3000,2000,2500],["1","Quốc Lộ 21","Ngã ba Đồng Nhuệ","Cầu Mái (bắc Quốc Lộ 21)",25000,20000,22500,13000,10000,11500,6000,4000,5000,3000,2000,2500],["2","Đường Thịnh Thắng","Giáp xã Hiển Khánh","Giáp khu dân cư chợ huyện Mỹ Thịnh",20000,15000,17500,10000,8000,9000,5000,3000,4000,3000,2000,2500],["2","Đường Thịnh Thắng","đoạn đất nhà bà Đỗ Thị Ngát (ngã ba Trung Quyên)","Chân Cầu Giáng",12000,9000,10500,7000,6000,6500,5000,4000,4500,3000,2000,2500],["2","Đường Thịnh Thắng","Cầu La","Giáp phường Đông A (địa bàn xã Mỹ Tiến)",25000,20000,22500,13000,10000,11500,6000,4000,5000,3000,2000,2500],["3","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường N4","Cuối đường",28000,22000,25000,11000,9000,10000,6000,3000,4500,3000,2000,2500],["3","Khu dân cư Lương Xá, Phú Ốc","Khu dân cư Lương Xá, Phú Ốc đường D2","Cuối đường",22000,19000,20500,9000,8000,8500,4000,3000,3500,2000,1500,1750],["4","Đường Nam Đường Sắt","Giáp TP Nam Định","Bia Căm Thù",19000,14000,16500,10000,7000,8500,5000,4000,4500,3000,2000,2500],["4","Đường Nam Đường Sắt","Bia Căm Thù","Cầu Đặng",20000,14000,17000,10000,7000,8500,4000,3000,3500,3000,2000,2500],["5","Tuyến đường, đoạn đường trong các khu đô thị phía Nam Sông Đào","Các tuyến đường còn lại trong khu đô thị","Cuối đường",45000,35000,40000,0,0,0,0,0,0,0,0,0],["6","Đường 485B","Đại lộ Thiên Trường","Quốc lộ 21",32000,27000,29500,16000,14000,15000,8000,6000,7000,4000,3000,3500],["6","Đường 485B","Quốc lộ 21","Đường Thịnh Thắng (hết địa phận thị trấn Mỹ Lộc cũ)",23000,18000,20500,12000,9000,10500,6000,4000,5000,3000,2000,2500],["6","Đường 485B","Đường Thịnh Thắng (giáp địa phận thị trấn Mỹ Lộc cũ)","Đến giáp ranh xã Hiển Khánh",20000,16000,18000,10000,8000,9000,5000,3000,4000,3000,2000,2500],["7","Đường 486 B (đường 56 cũ)","Quốc Lộ 21","Giáp xã Hiển Khánh",22000,15000,18500,11000,8000,9500,6000,3000,4500,3000,2000,2500],["8","Đại lộ Thiên Trường","Phường Đông A","Trạm thu phí",40000,32000,36000,25000,20000,22500,12000,9000,10500,6000,4000,5000],["8","Đại lộ Thiên Trường","Trạm thu phí","Ngã tư xóm Đình",31000,25000,28000,16000,13000,14500,8000,5000,6500,4000,2000,3000],["8","Đại lộ Thiên Trường","Ngã tư xóm Đình","Hết ranh phường Mỹ Lộc",24000,19000,21500,12000,10000,11000,6000,4000,5000,4000,3000,3500],["9","Đường nội thị phường Mỹ Lộc","Đường Thống Nhất (Cầu Mái)","Trạm bơm Cộng Hưu",19000,13000,16000,10000,7000,8500,4000,3000,3500,3000,2000,2500],["9","Đường nội thị phường Mỹ Lộc","Từ Đường 21","Bói Trung",18000,13000,15500,9000,7000,8000,5000,4000,4500,3000,2000,2500],["9","Đường nội thị phường Mỹ Lộc","Đại lộ Thiên Trường","Đê Ất Hợi",19000,13000,16000,10000,7000,8500,4000,3000,3500,3000,2000,2500],["9","Đường nội thị phường Mỹ Lộc","Đường đê Ất hợi khuvực Mỹ Thuận","Khu vực Mỹ Tiến",12000,9000,10500,7000,6000,6500,5000,4000,4500,3000,2000,2500],["9","Đường nội thị phường Mỹ Lộc","Khu vực chợ huyện bám đường","Đền Trần Quang Khải",23000,16000,19500,12000,8000,10000,6000,3000,4500,2000,1500,1750],["9","Đường nội thị phường Mỹ Lộc","Đường Đa Mễ","Mỹ Tho",14000,10000,12000,8000,7000,7500,6000,5000,5500,4000,3000,3500],["9","Đường nội thị phường Mỹ Lộc","Mỹ Tho","Xóm 7 Cầu Nhát",14000,10000,12000,8000,7000,7500,6000,5000,5500,4000,3000,3500],["9","Đường nội thị phường Mỹ Lộc","Cầu Nhát","Lộc Hòa",14000,10000,12000,8000,7000,7500,6000,5000,5500,4000,3000,3500],["9","Đường nội thị phường Mỹ Lộc","Nhà Ông Tuyến","Nhà bà Gương (Xóm 3) đi cầu Nhát",14000,10000,12000,8000,7000,7500,6000,5000,5500,4000,3000,3500],["9","Đường nội thị phường Mỹ Lộc","Đoạn Kho HTX","Cống Mỹ Tho",14000,10000,12000,8000,7000,7500,6000,5000,5500,4000,3000,3500],["9","Đường nội thị phường Mỹ Lộc","Đường Bà Vằng","An Cổ",15000,12000,13500,8000,7000,7500,6000,5000,5500,4000,3000,3500],["9","Đường nội thị phường Mỹ Lộc","Đoạn nhà ông Yên TDP Đa Mễ Tây","ĐT 485B",14000,10000,12000,8000,7000,7500,6000,5000,5500,4000,3000,3500],["9","Đường nội thị phường Mỹ Lộc","Đường đền Trần Quang Khải","Đường 485",14000,10000,12000,8000,7000,7500,6000,5000,5500,4000,3000,3500],["10","Khu chợ huyện Mỹ Thịnh","Khu chợ huyện Mỹ Thịnh","Hết khu",24000,20000,22000,12000,10000,11000,6000,5000,5500,3000,2000,2500],["11","Đường khác","Tuyến đê ất Hợi Quốc Lộ 21 (cầu Họ)","Cống Đá",10000,8000,9000,6000,5000,5500,3000,2000,2500,2000,1500,1750],["11","Đường khác","Cống Đá","Chợ Mạng (bao gồm cả khu vực chợ Mạng)",18000,15000,16500,11000,9000,10000,6000,4000,5000,2000,1500,1750],["11","Đường khác","Trạm bơm (HTX Nhân Phú)","Cống Đá",12000,9000,10500,7000,6000,6500,5000,4000,4500,3000,2000,2500],["12","Đường Hạnh Lâm khu vực Cầu Họ","Đường Hạnh Lâm khu vực Cầu Họ","Cuối đường",10000,8000,9000,5000,4000,4500,3000,2000,2500,2000,1500,1750],["13","Khu tái định cư đường BT","Khu tái định cư đường BT","Hết khu",18000,15000,16500,9000,8000,8500,5000,4000,4500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Đoạn giáp thị trấn","Cổng trào TDP La Chợ",28000,24000,26000,11000,10000,10500,6000,4000,5000,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Đoạn Cổng chào La chợ","Dốc La",25000,20000,22500,10000,8000,9000,5000,3000,4000,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Quốc Lộ 21 Cầu Giáng","Giáp địa giới xã Mỹ Tiến",22000,19000,20500,11000,10000,10500,6000,4000,5000,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Quốc Lộ 21","Ngã 3 Hào Hưng, Hào Quang",12000,9000,10500,7000,6000,6500,5000,4000,4500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Quốc Lộ 21","Trạm bơm tổ dân phố Mỹ Tục",15000,12000,13500,8000,7000,7500,6000,5000,5500,4000,3000,3500],["14","Đường nội thị phường Mỹ Lộc","Quốc Lộ 21","Chợ Huyện xã Mỹ Thịnh",21000,17000,19000,11000,9000,10000,5000,3000,4000,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Cầu Lê","Nhà văn hóa Nam Lê Xá (gồm 2 bên đường)",16000,12000,14000,8000,6000,7000,4000,3000,3500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Cầu Lê","Đại lộ Thiên Trường",16000,12000,14000,8000,6000,7000,4000,3000,3500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Cầu Đặng","Đại lộ Thiên Trường",15000,12000,13500,8000,7000,7500,6000,5000,5500,4000,3000,3500],["14","Đường nội thị phường Mỹ Lộc","Cầu Đặng","Gốc đa rẽ vào TDP Vạn Đồn",21000,17000,19000,8000,7000,7500,4000,3000,3500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Gốc đa","TDP Vạn đồn",16000,12000,14000,6000,5000,5500,3000,2000,2500,2000,1500,1750],["14","Đường nội thị phường Mỹ Lộc","QL21","Nhà văn hóa TDP An Hưng",14000,10000,12000,8000,7000,7500,6000,5000,5500,4000,3000,3500],["14","Đường nội thị phường Mỹ Lộc","Đường 21","Hết ngã ba nhà ông Phê",21000,17000,19000,11000,9000,10000,5000,3000,4000,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Ngã ba nhà ông Phê","Cầu Dừa",12000,9000,10500,7000,6000,6500,5000,4000,4500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Nhà ông Phê","Ao cầu Vồng",12000,9000,10500,7000,6000,6500,5000,4000,4500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Đoạn cầu ông Thưởng","Đường Thịnh Thắng",12000,9000,10500,7000,6000,6500,5000,4000,4500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Ngã ba chợ Hôm","Cầu Đặng xóm 3",17000,15000,16000,9000,8000,8500,4000,3000,3500,2000,1500,1750],["14","Đường nội thị phường Mỹ Lộc","Cầu Chéo sông T3","Cầu Kiều",30000,25000,27500,15000,13000,14000,8000,5000,6500,4000,3000,3500],["14","Đường nội thị phường Mỹ Lộc","Đoạn cầu Kiều","Hết địa phận phường Mỹ Lộc",45000,40000,42500,23000,20000,21500,11000,9000,10000,6000,4000,5000],["14","Đường nội thị phường Mỹ Lộc","Đại lộ Thiên Trường","Hết nhà ông Thưởng",19000,12000,15500,10000,6000,8000,4000,3000,3500,3000,2000,2500],["14","Đường nội thị phường Mỹ Lộc","Bưu điện Đặng xá","Đại lộ Thiên Trường",17000,15000,16000,9000,8000,8500,4000,3000,3500,3000,2000,2500],["15","Khu tái định cư đường Nam Định - Phủ Lý","Khu tái định cư đường Nam Định - Phủ Lý","Hết khu",45000,40000,42500,23000,20000,21500,11000,9000,10000,6000,4000,5000],["16","Các tuyến đường trong khu đô thị thị trấn Mỹ Lộc (thuộc địa giới xã Mỹ Hưng)","Các tuyến đường trong khu đô thị thị trấn Mỹ Lộc (thuộc địa giới xã Mỹ Hưng)","Hết khu",30000,25000,27500,12000,10000,11000,6000,4000,5000,3000,2000,2500],["17","Khu Tái định cư đường sắt tốc độ cao","Khu Tái định cư đường sắt tốc độ cao","Hết khu",30000,25000,27500,12000,10000,11000,6000,4000,5000,3000,2000,2500],["18","Đường nối đường Đại lộ Thiên Trường với Quốc lộ 21","Đại lộ Thiên Trường","Quốc lộ 21",45000,40000,42500,0,0,0,0,0,0,0,0,0],["19","Khu dân cư tập trung (thuộc xã Mỹ Hưng cũ)","Tuyến đường D1","Tuyến đường D1",45000,40000,42500,0,0,0,0,0,0,0,0,0],["19","Khu dân cư tập trung (thuộc xã Mỹ Hưng cũ)","Đường D3 (các lô Biệt thự)","Đường D3 (các lô Biệt thự)",28000,23000,25500,0,0,0,0,0,0,0,0,0],["19","Khu dân cư tập trung (thuộc xã Mỹ Hưng cũ)","Đường N3","Đường N3",26000,20000,23000,0,0,0,0,0,0,0,0,0],["19","Khu dân cư tập trung (thuộc xã Mỹ Hưng cũ)","Đường N1, N2, D2","Đường N1, N2, D2",33000,25000,29000,0,0,0,0,0,0,0,0,0],["20","Tuyến đê ất Hợi","Đoạn Dốc La ( đất nhà ông Kế)","Cửa hàng Lang Xá",18000,14000,16000,9000,7000,8000,3000,2000,2500,2000,1500,1750],["20","Tuyến đê ất Hợi","Đoạn Cửa hàng Lang Xá","Lăng nhà thánh",18000,14000,16000,9000,7000,8000,5000,4000,4500,3000,2000,2500],["20","Tuyến đê ất Hợi","Đoạn Lăng nhà thánh","Giáp xã Mỹ Hà",15000,12000,13500,8000,7000,7500,6000,5000,5500,4000,3000,3500],["20","Tuyến đê ất Hợi","Đoạn dốc La","Cầu chéo Vị Việt",18000,14000,16000,9000,7000,8000,4000,3000,3500,2500,2000,2250],["21","Đường liên TDP đoạn từ (Dốc Nguộn đến Phạm Thức)","Đường liên TDP đoạn (Dốc Nguộn","Phạm Thức)",12000,9000,10500,7000,6000,6500,5000,4000,4500,3000,2000,2500],["22","Đường nối đường Đại lộ Thiên Trường với Quốc lộ 21 (tuyến tránh)","Đại lộ Thiên Trường","Quốc lộ 21 (tuyến tránh)",25000,20000,22500,13000,10000,11500,6000,5000,5500,4000,3000,3500],["23","Các tuyến đường trong khu đô thị thị trấn Mỹ Lộc","Các tuyến đường trong khu đô thị thị trấn Mỹ Lộc","Hết khu",40000,20000,30000,16000,8000,12000,8000,5000,6500,4000,3000,3500],["24","Khu dân cư tập trung An Cổ","Đường D3, N2","Cuối đường",25000,20000,22500,0,0,0,0,0,0,0,0,0],["24","Khu dân cư tập trung An Cổ","Các tuyến đường còn lại","Cuối đường",20000,15000,17500,0,0,0,0,0,0,0,0,0],["25","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 3,5m trở lên","Đường có chiều rộng mặt cắt từ 3,5m trở lên",12000,9000,10500,0,0,0,0,0,0,0,0,0],["25","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt từ 2m đến 3,5m","Đường có chiều rộng mặt cắt từ 2m đến 3,5m",9000,7000,8000,0,0,0,0,0,0,0,0,0],["25","Các tuyến đường còn lại trên địa bàn phường","Đường có chiều rộng mặt cắt dưới 2m","Đường có chiều rộng mặt cắt dưới 2m",5000,3000,4000,0,0,0,0,0,0,0,0,0]]};

// ===== STATE =====
let bgd_currentWard = 'Phường Nam Định';
let bgd_currentVT = 'all';
let bgd_currentPage = 1;
const bgd_PAGE_SIZE = 50;
let bgd_filteredRows = [];


const bgd_UBND={"Phường Nam Định":{"đường trần nhân tông|||đường hàng thao":[22000,8800,4400,2200],"đường hàng thao|||ngõ hai bà trưng":[80000,24000,12000,6000],"ngõ hai bà trưng|||ngã tư quang trung":[95000,27600,13800,6900],"ngã tư quang trung|||đường trường chinh":[80000,24000,12000,6000],"đường trường chinh|||đường đông a":[62400,20800,10400,5200],"đường trần nhân tông|||đường phan đình phùng":[35000,15000,7500,3800],"đường phan đình phùng|||đường lê hồng phong":[39000,15600,7800,3900],"đường lê hồng phong|||đường quang trung":[37100,14900,7500,3800],"đường quang trung|||đường trường chinh":[52500,12600,6300,3200],"đường phan đình phùng|||ngõ nhà thờ":[31200,12500,6300,3200],"ngõ nhà thờ|||đường lê hồng phong":[36400,14600,7300,3700],"đường lê hồng phong|||đường bà triệu":[41600,16700,8400,4200],"đường hoàng văn thụ|||đường trần hưng đạo":[46000,18400,9200,4600],"đường trần hưng đạo|||đường phạm hồng thái":[53500,19300,9700,4900],"chợ diên hồng|||đường trần hưng đạo":[66000,22000,11000,5500],"đường mạc thị bưởi|||chợ diên hồng":[60000,19700,9900,5000],"đường trần phú|||đường trần quốc toản":[32400,13000,6500,3300],"đường trần quốc toản|||đường quang trung":[43700,17700,9400,4700],"đường quang trung|||trường đh công nghiệp":[32400,13000,6500,3300],"đường nguyễn du|||đường hoàng văn thụ":[56000,20200,10100,5100],"đường trần nhật duật|||đường hùng vương":[40000,16000,8000,4000],"đường hùng vương|||đường nguyễn du":[50000,18000,9000,4500],"đường trần hưng đạo|||ngã 6 năng tĩnh":[52000,19000,9400,4700],"đường trường chinh|||đường trần nhật duật":[32400,13000,6500,3300],"đường hùng vương|||đường mạc thị bưởi":[51500,18600,9300,4700],"đường mạc thị bưởi|||đường hoàng văn thụ":[55600,18200,9100,4600],"đường hoàng văn thụ|||đường thành chung":[60000,20000,10000,5000],"ngõ an phong|||cuối tuyến":[10000,5000,2500,1300],"đường nguyễn du|||đường trường chinh":[47300,19000,9500,4800],"đường trường chinh|||đường hưng yên":[36100,14500,7300,3700],"đường thái bình|||đường phù nghĩa":[28500,11400,5700,2900],"đường phù nghĩa|||đường nguyễn đức thuận (phía bắc) và đường hùng vương (phía nam)":[38200,15300,7700,3900],"đường nguyễn đức thuận|||đường điện biên":[43600,17500,8800,4400],"phố doãn kế thiện: phố lương đình của|||phố đào duy từ":[18700,8400,4200,2100],"đường lê hồng phong|||đường nguyễn du":[32000,12900,6500,3300],"đường trần nhân tông|||đường lê hồng phong":[33000,13200,6600,3300],"đường lê hồng phong|||đường hàn thuyên":[48600,19500,9800,4900],"đường hàn thuyên|||đường trường chinh":[31800,12800,6400,3200],"đường hùng vương|||đường trần tế xương (đường đôi)":[50000,18000,9000,4500],"đường trần tế xương|||đường lê hồng phong":[55000,20000,10000,5000],"trần hưng đạo|||tràng thi":[36800,14700,7400,3700],"đường trường chinh|||đường giải phóng":[41600,16700,8400,4200],"đường trần phú|||đường trần đăng ninh":[30000,12000,6000,3000],"đường trần đăng ninh|||đường thành chung":[38900,15600,7800,3900],"đường tràng thi|||ngã 6 năng tĩnh":[30300,12200,6100,3100],"đường trần đăng ninh|||ngã 6 năng tĩnh":[32700,13100,6600,3300],"đường bà triệu|||đường trường chinh":[44000,17600,8800,4400],"đường trần hưng đạo|||đường hoàng hoa thám":[26800,10700,5400,2700],"đường hà huy tập|||đường trần phú":[21000,8400,4200,2100],"đường trần hưng đạo|||đường bến thóc":[33900,13600,6800,3400],"đường hàng tiện|||đường quang trung":[30000,12000,6000,3000],"đường hàng đồng|||đường hoàng văn thụ":[33000,13200,6600,3300],"đường nguyễn du|||đường quang trung":[26800,10700,5400,2700],"đường hoàng văn thụ|||đường hai bà trưng":[26800,10700,5400,2700],"đường hai bà trưng|||đường trần hưng đạo":[30600,12300,6200,3100],"đường trần nhân tông|||đường trần phú":[29500,11800,5900,3000],"đường hai bà trưng|||đường tô hiệu":[36800,14700,7400,3700],"đường tô hiệu|||đường đinh bộ lĩnh":[34500,13800,6900,3500],"đường trần nhân tông|||đường máy tơ":[36600,14700,7400,3700],"đường nguyễn trãi|||đường hai bà trưng":[34200,13700,6900,3500],"đường nguyễn trãi|||đường hoàng văn thụ":[28500,11400,5700,2900],"đường bến ngự|||đường hàng cau":[20500,9200,4600,2300],"đường bến ngự|||đường hoàng văn thụ":[22600,9100,4600,2300],"đường trần hưng đạo|||đường tô hiệu":[35000,14000,7000,3500],"đường tô hiệu|||công ty dệt nam định":[33000,13200,6600,3300],"đường bến thóc|||đường tô hiệu":[28000,11200,5600,2800],"đường hoàng văn thụ|||đường hàng cau":[25000,11200,5600,2800],"phố máy chai|||phố máy tơ":[20200,8100,4100,2100],"phố máy chai|||đường hàng thao":[20000,8000,4000,2000],"đường hoàng diệu|||đường văn cao":[20000,8000,4000,2000],"đường hoàng diệu|||đường phan đình giót":[23600,9500,4800,2400],"đường nguyễn văn trỗi|||đường trần phú":[26000,10400,5200,2600],"đường đinh bộ lĩnh|||đường trần bích san":[35000,14100,7100,3600],"đường trần bích san|||đường trần nhân tông":[32100,12900,6500,3300],"đường nguyễn văn trỗi|||đường nguyễn bính":[38500,12000,6000,3000],"đường âu cơ|||đường song hào":[17000,8600,4300,2200],"đường song hào|||đường văn cao":[15000,7500,3800,1900],"phố bến thóc|||đường nguyễn văn trỗi":[15200,6100,3100,1600],"đường nguyễn văn trỗi|||đường văn cao":[21400,8600,4300,2200],"đường trần nhân tông|||đường nguyễn văn trỗi":[16000,8000,4000,2000],"đường hàng đồng|||đường lê hồng phong":[43200,17300,8700,4400],"đường mạc thị bưởi|||đường hàng đồng":[36400,14600,7300,3700],"đường trần nhật duật|||đường nguyễn văn trỗi":[31200,12500,6300,3200],"giáp ranh phường trường thi|||đường d3":[36800,14700,7400,3700],"đường d3|||đường nguyễn văn trỗi":[30900,12400,6200,3100],"đường trần nhân tông|||đường nguyễn trãi":[28000,11200,5600,2800],"đường mạc thị bưởi|||đường trường chinh":[36400,14600,7300,3700],"đường nguyễn du|||đường hàn thuyên":[30000,0,0,0],"đường hưng yên|||cầu sắt":[30300,12200,6100,3100],"cầu sắt|||quốc lộ 10 mới":[26000,10400,5200,2600],"quốc lộ 10 mới|||ngã ba đền trần":[20000,8900,4500,2300],"đường điện biên|||phi trường điện":[20800,8400,4200,2100],"phi trường điện|||ga":[11700,5900,3600,1800],"đường điện biên|||đường đông a":[25000,11200,5600,2800],"đường đông a|||ubnd phường (đường tức mạc)":[20000,8900,4500,2300],"đường trần huy liệu|||đường điện biên":[42000,16800,8400,4200],"đường phan bội châu|||đường trần huy liệu":[25000,10000,5000,2500],"ngã 6 năng tĩnh|||giáp ranh phường trường thi":[32000,13000,7000,3500],"đường trường chinh|||cầu lộc hạ":[34600,14100,7600,3800],"đường hàn thuyên|||đường thanh bình":[29500,11800,5900,3000],"đường thanh bình|||trung tâm y tế thành phố (bệnh viện tình thương)":[23000,9200,4600,2300],"trung tâm y tế thành phố (bệnh viện tình thương)|||chân cầu tân phong":[20000,8000,4000,2000],"đường thái bình|||trạm dầu lửa":[13900,5800,3500,1800],"trạm dầu lửa|||kênh t3-11":[11700,5900,3600,1800],"đường hàn thuyên|||đường phù long":[33900,13600,6800,3400],"đường phù long|||đường trần nhân tông":[29700,12800,6400,3200],"đường nguyễn trãi|||đường nguyễn du":[34500,13800,6900,3500],"đường trần nhật duật|||đường cù chính lan":[25000,10000,5000,2500],"đường cù chính lan|||đê sông đào":[20400,8200,4100,2100],"đê sông đào|||công ty cấp nước":[14200,5900,3600,1800],"hết công ty cấp nước|||đường phù long":[15400,6600,3300,1700],"đường phù long|||đường hàn thuyên":[17100,7500,4300,2200],"đường thái bình|||trường tô hiệu":[12500,6300,3200,1600],"trường tô hiệu|||trường mầm non số 4":[12000,6000,3000,1500],"trường mầm non số 4|||ngõ 208 đường thái bình":[10700,5400,3300,1700],"đường hoàng diệu|||ngã 6 năng tĩnh":[25000,10000,5000,2500],"đường phù nghĩa|||đường nguyễn thị trinh":[24000,10700,5400,2700],"đường nguyễn thị trinh|||đường võ nguyên giáp":[33900,13800,7500,3800],"đường võ nguyên giáp|||đường mạc thị bưởi":[31800,12800,6400,3200],"đường trường chinh|||quốc lộ 10":[60000,24000,12000,6000],"cầu đò quan|||cống trắng (đường trục phía nam)":[25700,10600,5900,3000],"đường đặng xuân bảng|||đường nguyễn cơ thạch":[21000,8400,4200,2100],"đường nguyễn cơ thạch|||giáp ranh phường hồng quan":[16600,7300,4200,2100],"đường đặng xuân bảng|||đường vũ hữu lợi":[20000,8000,4000,2000],"đường vũ hữu lợi|||đê sông đào (đường lạc long quân)":[12700,5300,3200,1600],"đường lạc long quân|||bến phà cũ (ông thuấn)":[10400,5200,3200,1600],"đài phun nước|||quốc lộ 10 mới":[58000,23200,9300,3800],"đường điện biên|||hết địa phận phường đông a":[48500,19400,7800,3200],"công ty vận tải ô tô|||hết địa phận phường đông a":[21000,8400,3400,1400],"trung tâm tdtt|||đường điện biên":[21000,8400,3400,1400],"đường trần khánh dư|||đường trần anh tông":[20400,8200,3300,1400],"đường đông a|||đường trần anh tông":[22000,8800,3600,1500],"đường kênh|||đường trần anh tông":[21400,8600,3500,1400],"đường chu văn an|||đường trần anh tông":[20600,8300,3400,1400],"đường nguyễn viết xuân|||giáp ranh phường đông a":[20600,8300,3400,1400],"đường trần anh tông|||đường nguyễn viết xuân":[20400,8200,3300,1400],"đường trần khánh dư|||đường nguyễn viết xuân":[20400,8200,3300,1400],"trần khánh dư|||chu văn an":[18200,7300,3000,1200],"đào sư tích|||trần bá ngọc":[18200,7300,3000,1200],"a1|||tôn thất đàm":[18200,7300,3000,1200],"đường ngô sỹ liên|||đặng thế phong":[20000,8000,3200,1300],"đường lê văn hưu|||đỗ hựu":[19800,8000,3200,1300],"chu văn an|||bùi ngọc oánh":[19800,8000,3200,1300],"chu văn an|||đinh thúc dự":[19800,8000,3200,1300],"nguyễn công trứ|||đường đào diệu thanh":[21000,8400,3400,1400],"nguyễn công trứ|||đường đỗ quang":[19800,8000,3200,1300],"phạm văn nghị|||đường trần bá giáp":[21000,8400,3400,1400],"trần khánh dư|||đường nguyễn cảnh dị":[19800,8000,3200,1300],"trần đại nghĩa|||đường d2":[19800,8000,3200,1300],"ngô sỹ liên|||lý văn phúc":[19800,8000,3200,1300],"trần khánh dư|||phạm hữu du":[19800,8000,3200,1300],"đường trần khánh dư|||đường vũ cao":[18500,7400,3000,1200],"ngô sỹ liên|||đinh lễ":[18500,7400,3000,1200],"trần đại nghĩa|||e2":[21000,8400,3400,1400],"trần khánh dư|||đường phan kế bính":[18200,7300,3000,1200],"nguyễn công trứ|||đường bùi tân":[21000,8400,3400,1400],"trần đại nghĩa|||đường trần thiên trạch":[18200,7300,3000,1200],"chu văn an|||đường kim đồng":[18000,7200,2900,1200],"phạm văn nghị|||đường lê trọng hàm":[19100,7700,3100,1300],"đào sư tích|||đường trần bá ngọc":[19100,7700,3100,1300],"chu văn an|||đường e1":[21000,8400,3400,1400],"đường trần đại nghĩa|||đường đặng tiến đông":[19100,7700,3100,1300],"phạm văn nghị|||đường e4":[19100,7700,3100,1300],"trần khánh dư|||đường hồ xuân hương":[21000,8400,3400,1400],"trần khánh dư|||đường trần tử bình":[19100,7700,3100,1300],"trần đại nghĩa|||đường vũ giao hoan":[19100,7700,3100,1300],"phạm văn nghị|||đường d1":[21000,8400,3400,1400],"trần anh tông|||đường lê hiến giản":[21000,8400,3400,1400],"nguyễn viết xuân|||đường vũ phạm hàm":[18000,7200,2900,1200],"nguyễn viết xuân|||đường trần bích hoành":[23800,9600,3900,1600],"trần anh tông|||đường phó đức chính":[21400,8600,3500,1400],"nguyễn công trứ|||đường trần bá hai":[21400,8600,3500,1400],"lê văn hưu|||đường trần nhân trứ":[21400,8600,3500,1400],"nguyễn viết xuân|||đường phan phu tiên":[23800,9600,3900,1600],"đường nguyễn viết xuân|||đường nguyễn thực":[21400,8600,3500,1400],"đường điện biên|||hồ an trạch":[18400,8200,4100,2100],"đường trần thái tông|||cầu bùi":[18400,8200,4100,2100],"quốc lộ 10|||đường trần thừa":[16300,7200,4100,2100],"đường trần thái tông (cầu sắt)|||quốc lộ 10":[29000,11600,5800,2900],"đường võ nguyên giáp|||đường vũ năng an":[29000,11600,4700,1900],"đường nguyễn đức thuận|||đường nguyễn thị trinh":[29000,11600,4700,1900],"đường nguyễn đức cảnh|||giáp ranh phường thiên trường":[23500,9500,4800,2400],"giáp ranh phường thiên trường|||đường trần thánh tông":[32000,12800,6400,3200],"vũ văn hiếu|||hết đường hiện hữu":[22000,8800,3600,1500],"nguyễn thi|||lã xuân oai":[22000,8800,3600,1500],"đường bế văn đàn|||lương đình của":[22000,8800,3600,1500],"nguyễn đức thuận|||đường võ nguyên giáp":[22000,8800,3600,1500],"vũ văn hiếu|||đường trường chinh":[22000,8800,3600,1500],"chế lan viên|||đường trường chinh":[22000,8800,3600,1500],"mương cầu sắt|||quốc lộ 10":[15500,6200,3100,1600],"đường phù nghĩa|||hết địa phận chợ hạ long":[21200,9500,4800,2400],"đường phù nghĩa|||hết địa phấn phường nam định":[25000,11200,5600,2800],"đường phù nghĩa|||tập thể thực phẩm":[21400,8600,4300,2200],"ngã ba đường phù nghĩa|||đường thanh bình":[25000,10000,5000,2500],"đường phù nghĩa|||đường thanh bình":[20000,8000,4000,2000],"cầu lộc hạ|||đường thanh bình":[11300,6800,3400,1700],"đường song hào|||cống kênh gia":[7100,3100,2100,1600],"đoạn thuộc địa phận phường nam định|||":[6000,3600,1800,1200],"lạc long quân|||vũ hữu lợi":[14400,6000,3600,1800],"phần nằm trong địa phận phường nam định|||":[13600,6800,3800,1700],"quốc lộ 10|||đường tức mạc":[23000,9200,4600,2300],"đường trần thái tông|||quốc lộ 10":[18700,8400,4200,2100],"đường giải phóng|||đường kênh":[18200,8000,4600,2300],"đường giải phóng|||đường kênh - 9m":[20400,8200,4100,2100],"khu dân cư|||đường đặng trần côn":[16000,7000,4000,2000],"đường n2|||đường đặng trần côn- 11m":[20000,8000,4000,2000],"đường trần tung|||hội người mù tân quang":[18700,8200,4700,2400],"đường trần tung|||đường đặng trần côn":[17300,7600,4400,2200],"đường trần tung|||khu dân cư (thẳng đường đặng trần côn)":[18700,8200,4700,2400],"đường trần kỳ|||đường nguyễn văn huyên":[16000,7000,4000,2000],"đường phạm tuấn tài|||đường n2":[16000,7000,4000,2000],"đường khu quân nhân|||cuối đường":[13600,5700,3400,1700],"kdc nguyễn bính|||mương kênh gia - 13m":[21000,7000,4000,2000],"đường nguyễn bính|||mương kênh gia 15m":[23000,8000,4000,2000],"đường lưu trọng lư|||mương kênh gia - 13m":[23000,7700,4400,2200],"đường song hào|||đường đỗ huy rừa":[21200,7100,4100,2100],"đường trần bích san|||đường tiền phong":[19000,7000,4000,2000],"ngã ba dốc lốc|||cầu bùi":[19000,7000,3500,1800],"cầu bùi|||quốc lộ 10":[19000,7000,4000,2000],"đương trần thái tông|||đường kênh":[16500,7300,4200,2100],"trần đăng ninh|||lương thế vinh - 4m":[17000,6800,3400,1700],"trần đăng ninh|||khu dân cư":[15000,6000,3000,1500],"đường trần thừa|||quốc lộ 10":[16000,7000,4000,2000],"đường trần thừa|||đường n4":[17000,7000,4000,2000],"đường d1|||đường d2":[16000,7000,4000,2000],"đầu đường|||cuối đường":[20000,8000,4000,2000],"đường đào duy|||đường võ nguyên giáp":[20000,8000,4000,2000],"đường bế văn đàn|||đường võ nguyên giáp":[20000,8000,4000,2000],"đường lương đình của|||đường bế văn đàn":[20000,8000,4000,2000],"đường đào duy từ|||đường võ nguyên giáp":[20000,8000,4000,2000],"đường chế lan viên|||đường n2":[16000,7000,4000,2000],"đường vũ văn hiếu|||đường võ nguyên giáp":[20000,8000,4000,2000],"đường trần thánh tông|||khu dân cư cũ":[16000,7000,4000,2000],"cầu sắt|||đường võ nguyên giáp":[32000,12800,6400,3200],"đường nguyễn thi|||đường phạm văn xô":[24000,9600,4800,2400],"đường nguyễn đức thuận|||giáp ranh phường thiên trường":[25000,10000,5000,2500],"giáp ranh phường thiên trường|||cầu lộc hạ (đường ven mương t3-11 cũ)":[25000,10000,5000,2500],"vũ năng an|||nguyễn thi":[18000,8000,4000,2000],"trần thánh tông|||nguyễn đức thuận":[17000,7500,4300,2200],"đường vũ xuân thiều|||cuối đường":[20000,8800,5000,2500],"tuyến đường mương (đường d3) - khu tđc đường trần nhân tông|||cuối đường":[10000,5000,3000,1500],"đường trường chinh|||đường võ nguyên giáp":[16800,7400,4200,2100],"đường nối đường d3, d4 của khu tđc đông đông mạc (cũ là đường có điểm đầu d3 - điểm cuối d7)|||cuối đường":[15000,6000,3000,1500],"đường rộng 20,5m|||cuối đường":[36000,14400,7200,3600],"phố đặng thị kim: trần phú|||trần đăng ninh":[32000,13700,6900,3500],"phố phạm sư mạnh: trần đăng ninh|||trần phú":[32000,12800,6400,3200],"phố vũ công chấn: trần phú|||đường n3 - khu đô thị dệt":[30000,12000,6000,3000],"phố đoàn văn cừ: đường d2 - khu đô thị dệt|||đường hoàng hoa thám":[30000,12000,6000,3000],"phố vũ huy trác: đường d1 - khu đô thị dệt|||đường hoàng hoa thám":[30000,12000,6000,3000],"phố nguyễn khải: đường d4 - khu đô thị dệt|||đường d5 - khu đô thị dệt":[30000,12000,6000,3000],"phố hoàng khắc dược: đường d4 - khu đô thị dệt|||đường d1 - khu đô thị dệt":[30000,12000,6000,3000],"phố phạm đình hổ: đường d4 - khu đô thị dệt|||đường d2 - khu đô thị dệt":[30000,12000,6000,3000],"phố bùi văn ba: đường d2 - khu đô thị dệt|||đường d1 - khu đô thị dệt":[30000,12000,6000,3000],"phố hà chương: đường n4 - khu đô thị dệt|||đường trần phú":[30000,12000,6000,3000],"phố trần mạnh phấn: đường n3 - khu đô thị dệt|||đường n5 - khu đô thị dệt":[30000,12000,6000,3000],"phố trần doãn đạt: đường n3 - khu đô thị dệt|||đường n5 - khu đô thị dệt":[30000,12000,6000,3000],"phố phúc đường: đường trần phú|||đường n9 - khu đô thị dệt":[30000,12000,6000,3000],"phố phạm quang diệu: đường d8 - khu đô thị dệt|||đường d4 - khu đô thị dệt":[30000,12000,6000,3000],"phố đỗ dương thanh: đường d8 - khu đô thị dệt|||đường d4 - khu đô thị dệt":[30000,12000,6000,3000],"đoạn đường đặng xuân bảng|||đường dẫn cầu tân phong":[25000,8000,4000,2000],"vũ hữu lợi|||đặng xuân bảng":[35000,17500,8500,4000],"ngã tư hữu bị|||cầu bảo lộc":[9000,4200,2100,1100],"cầu đền bảo lộc|||cầu ubnd xã":[10000,5100,2200,1100],"cầu ubnd xã|||cầu cấp tiến 1":[6800,3200,1600,800],"cầu cấp tiến 1|||ngã 3 dốc lốc (hết địa giới phường nam định)":[12600,6300,3200,1600],"ngã ba đền trần|||đầu cống kc - 02":[12600,6300,3200,1600],"cống kc- 02|||ao đình đông":[15800,7400,3700,1900],"ao đình đông|||ngã tư hữu bị":[11600,5300,2700,1400],"cầu ubnd xã|||ngã ba dốc lốc":[7300,3400,1700,900],"cầu viềng|||kc-02":[10000,5000,2500,1300],"kc-02|||đình trần quang khải":[7000,3500,1800,900],"đình trần quang khải|||cách cầu bùi 100m":[8000,4000,2000,1000],"khu vực cầu bùi|||ra 100m (đường vĩnh giang hướng tây + đông)":[11000,5500,2800,1400],"cách cầu bùi 100m|||hết cống ao dàm":[10000,5000,2500,1300],"giáp cống ao dàm|||giáp đường vào trạm biến áp mỹ lộc":[8000,4000,2000,1000],"đường vào trạm biến áp mỹ lộc|||giáp ranh phường đông a":[5000,2500,1300,700],"sông vĩnh giang|||cầu phao nhân hậu":[8000,4000,2000,1000],"đoạn đường 38a|||di tích lịch sử trần thủ độ":[10000,5000,2500,1300],"đường vũ hữu lợi|||cầu thiên trường":[35000,17500,8500,4300],"đường lộc vượng|||đường trần tự khánh":[11100,4500,2300,1700],"đường đường bái|||trường trung học trần hưng đạo cũ":[10300,4200,2100,1600],"đường đôi hồ lộc vượng qua đường kênh|||ql10":[47000,0,0,0],"đường hồ lộc vượng|||cuối đường":[12000,4800,2400,1800],"đường thép mới|||đường võ nguyên giáp":[16000,7000,4000,2000],"phố doãn kế thiện|||cuối đường":[18000,8000,4000,2000],"đường tức mạc kéo dài|||lô hh số 6 khu đô thị thống nhất":[18000,8000,4000,2000],"đường n1 - khu tđc phục vụ gpmb phường nam định|||đường d3 - khu tđc phục vụ gpmb phường nam định":[15000,0,0,0],"đường d1 - khu tđc phục vụ gpmb phường nam định|||đường n1 - khu tđc phục vụ gpmb phường nam định":[15000,0,0,0],"đường phong lộc tây|||đường d1":[15000,0,0,0],"đường d1 - khu tđc phục vụ gpmb phường nam định|||đường d3 - khu tđc phục vụ gpmb phường nam định":[15000,0,0,0],"đường xây dựng mới nối tiếp đường nguyễn thượng hiền (nguyễn tri phương|||trần huy liệu) - khu tái định cư trầm cá":[15000,6000,3000,1500],"đường trần đình thâm|||cuối đường":[27000,0,0,0],"đường phụng dương|||cuối đường":[27000,0,0,0],"đường trần duệ tông|||cuối đường":[29000,0,0,0],"đường trần minh tông|||cuối đường":[31000,0,0,0],"đường trần chiêu đức|||cuối đường":[27000,0,0,0],"đường huyền trân|||cuối đường":[27000,0,0,0],"đường trần đạo tái|||cuối đường":[27000,0,0,0],"đường trần thị dung|||cuối đường":[29000,0,0,0],"đường trần khắc chung|||cuối đường":[29000,0,0,0],"đường trần đình huyên|||cuối đường":[27000,0,0,0],"đường trần quốc tảng|||cuối đường":[27000,0,0,0],"đường lộc vượng|||cuối đường":[31000,0,0,0],"đường n1|||cuối đường":[40000,0,0,0],"các tuyến đường còn lại trong khu đô thị|||cuối đường":[35000,0,0,0],"phố đỗ huy cảnh: đưỡng võ nguyên giáp|||phố đào duy từ":[20000,0,0,0],"phố khiếu năng tĩnh: đường vũ hữu lợi|||phong lộc tây":[16000,0,0,0],"phố nguyễn tuấn thông: đường d1 khu tđc phục vụ gpmb phường cửa nam|||đường n1 khu tđc phục vụ gpmb phường cửa nam":[15000,0,0,0],"phố nguyễn hữu tiến|||cuối đường":[16000,6400,3200,1600],"đường vũ trọng phụng đoạn quốc lộ 10|||cuối khu dân cư":[15000,6000,3000,1500],"đường vĩnh trường (ngã 3 cổng trường tiểu học|||ngã 3 đình vĩnh trường)":[10000,4000,2000,1000],"đường thượng hữu: nguyễn văn trỗi|||nguyễn bính":[30000,12000,6000,3000],"phố nguyễn hữu tiến: võ nguyên giáp|||phố thép mới":[16000,6400,3200,1600],"phố đỗ huy cảnh|||cuối đường":[16000,6400,3200,1600],"phố nguyễn tuấn thông (đường d1 khutđc phục vụgpmb phườg cửa nam - đường n1 khu tđc phục vụ gpmb phường cửa nam)|||cuối đường":[15000,6000,3000,1500],"phố thích tâm nguyện: trần thái tông|||võ nguyên giáp":[16000,6400,3200,1600],"đường có chiều rộng mặt cắt từ 3,5m trở lên|||":[4000,0,0,0],"đường có chiều rộng mặt cắt từ 2,5 đến 3,5m|||":[3000,0,0,0],"đường có chiều rộng mặt cắt dưới 2m|||":[2000,0,0,0],"đường n2, d1|||cuối đường":[7000,0,0,0],"quốc lộ 10|||cuối khu dân cư":[15000,6000,3000,1500],"ngã 3 cổng trường tiểu học|||ngã 3 đình vĩnh trường":[10000,4000,2000,1000],"nguyễn văn trỗi|||nguyễn bính":[40000,16000,8000,4000],"phố năng lự|||cuối đường":[30000,12000,6000,3000],"âu cơ|||trần bích san":[25000,10000,5000,2500],"đường dạo hồ phường cửa bắc cũ|||cuối đường":[15000,6000,3000,1500],"đường n2|||cuối đường":[35000,0,0,0],"đường n3|||cuối đường":[30000,0,0,0],"đường n4 + n5|||cuối đường":[35000,0,0,0]},"Phường Trường Thi":{"giáp liên minh|||hết cầu chuối":[15000,7500,3800,1900],"giáp cầu chuối|||hết nhà bà hường (đầu trình xuyên)":[16500,8300,4200,2100],"hết nhà bà hường|||hết trạm quản lý đường bộ":[16000,8000,4000,2000],"cuối trạm quản lý đường bộ (giáp xã liên bảo cũ)|||hết cầu giành (hết xã liên bảo cũ)":[15000,7500,3800,1900],"cầu giành|||tổ dân phố tân thành 9 (hết xã thành lợi cũ)":[15000,7500,3900,2000],"từ tổ dân phố tân thành 9 (hết xã thành lợi cũ)|||đầu tổ dân phố vụ bản (xã lộc an cũ)":[14000,7000,3500,1800],"đầu tổ dân phố vụ bản|||giáp phường thành nam":[15000,7500,3800,1900],"rẽ tổ dân phố tổ cầu|||trạm quản lý đường bộ (nam đường sắt)":[7500,3800,2000,1000],"từ trạm quản lý đường bộ|||giáp tổ dân phố tân thành 9 (phía nam đường sắt)":[6500,3300,1700,900],"từ giáp tổ dân phố tân thành 9|||giáp tổ dân phố vụ bản (phía nam đường sắt)":[6500,3300,1700,900],"đoạn từ giáp xã hiển khánh|||đường 485b":[5000,2500,1300,700],"giáp xã hiển khánh|||hết tổ dân phố trung phu":[10000,5000,2500,1300],"hết tổ dân phố trung phu|||quốc lộ 10":[12000,6000,3100,1600],"từ barie rẽ chợ gạo (quốc lộ 10)|||hết trường nguyễn đức thuận (xã thành lợi cũ)":[12000,6000,3000,1500],"trường cấp iii nguyễn đức thuận|||hết đền đông":[15000,7500,3800,1900],"đền đông|||hết cổng trụ sở ubnd xã cũ (đường rẽ vào xóm đông)":[16000,8000,4100,2100],"giáp cổng trụ sở ubnd xã cũ (đường rẽ vào xóm đông)|||hết trạm y tế phường":[18000,9000,4500,2300],"hết trạm y tế phường|||dốc sắn (giáp đê đại hà)":[15000,7600,3800,1900],"giáp xã hiển khánh|||giáp xã liên minh (cống hương)":[15000,7500,3800,1900],"đường sắt (quốc lộ 10 xóm dương lai)|||hết ngã tư htx cốc thành":[10000,5200,2600,1300],"từ hết ngã tư htx cốc thành|||cầu hùng vương đến giáp xã liên minh":[8000,4200,2100,1100],"nhà ông bình (giáp quốc lộ 10)|||hết cầu rộc":[9000,4500,2300,1200],"ngã ba lối rẽ nhà thờ trình xuyên|||đường trục huyện bất di đi dốc sắn (tổ dân phố trung phu)":[6000,3000,1500,800],"giáp cầu rộc|||hết trường thcs liên bảo":[8000,4100,2200,1100],"hết trường thcs liên bảo|||ngã ba tổ dân phố định trạch (chùa định trạch)":[7000,2800,1400,700],"ngã ba tổ dân phố định trạch|||quốc lộ 10 (tổ dân phố tổ cầu)":[6000,2400,1200,600],"ngã ba tổ dân phố định trạch|||đường chợ lời- đai thắng (tổ dân phố cao phương)":[6000,2400,1200,600],"rẽ cầu giành (rẽ trường cao đẳng công nghiệp nam định)|||hết địa bàn phường (giáp phường thành nam)":[6000,3000,1600,800],"ngã tư htx cốc thành|||giáp mả tấn tổ dân phố xóm a":[7000,3500,1900,1000],"ngã tư htx cốc thành|||hết trường thcs thành lợi":[8000,4000,2000,1000],"trường thcs thành lợi|||hết chùa gạo":[9000,4500,2300,1200],"chùa gạo|||đám hát":[9000,4500,2400,1200],"đám hát|||cầu an nhân":[8000,4000,2000,1000],"dốc sắn|||bến đò kĩa":[9000,4500,2200,1100],"đền đông|||mả cuối":[6000,3000,1600,800],"đường sắt tổ dân phố tân thành 9 (quốc lộ 10)|||đê đại hà":[10000,5000,2500,1300],"đường đê đại hà từ kênh gia (giáp phường nam định)|||đường đê đại hà giáp cầu vượt sông đào (s2)":[6000,3100,1600,800],"đường đê đại hà từ giáp cầu vượt sông đào (s2)|||lối rẽ tổ dân phố phú nội":[5500,2800,1500,800],"tuyến giao thông tổ dân phố tân thành 1|||tổ dân phố tân thành 5":[5000,2600,1400,700],"tuyến giao thông tổ dân phố tân thành 1|||đến tổ dân phố tân thành 5":[5000,2500,1500,1000],"tuyến giao thông tổ dân phố tân thành 6, 7, 8|||":[5000,2600,1400,700],"tuyến đường đôi 12 m|||":[15000,6000,3000,1500],"tuyến đường 6 m|||":[10000,4000,2000,1000],"điểm dân cư tập trung tân thành|||hết khu":[8000,4000,2000,1000],"đường d4, n1|||cuối đường":[10000,5000,2500,1250],"các thửa (lô) đất còn lại|||cuối đường":[8000,4000,2000,1000],"đất ở|||":[8000,0,0,0],"đất dịch vụ|||":[5000,0,0,0],"ngã 6 năng tĩnh|||công ty dệt kim thắng lợi":[34500,13800,6900,3500],"phía nam đường sắt|||":[26000,10400,5200,2600],"phía bắc đường sắt|||":[22000,8800,4400,2200],"không tiếp giáp đường sắt|||":[17000,7500,4300,2200],"tiếp giáp đường sắt|||":[14000,7000,4400,2700],"đường văn cao|||đường trần huy liệu":[33600,13500,6800,3400],"đường trần huy liệu|||đường điện biên":[42000,16800,8400,4200],"đường điện biên|||đường đông a":[50000,20000,10000,5000],"ngã ba đường phù nghĩa|||đường thanh bình":[25000,10000,5000,2500],"đường song hào|||cống kênh gia":[7000,4200,2100,1400],"đường nguyễn thế rục|||cuối đường":[32800,8000,4600,2300],"mương nước|||công ty tổng hợp":[30000,6700,3400,1700],"đường trần huy liệu|||công ty tổng hợp":[27000,6000,3000,1500],"đường nguyễn tri phương|||đường phùng hưng":[30000,6700,3400,1700],"trần huy liệu|||phùng hưng":[30000,6700,3400,1700],"đường giải phóng|||dọc mương nước khu trầm cá":[32200,6900,3500,1800],"mương tiêu nước|||khu dân cư cũ":[22000,6600,3300,1700],"đường trần khát chân|||đường nguyễn huy tưởng":[27500,6600,3300,1700],"đường lê anh xuân|||đường nguyễn thái học":[27500,6600,3300,1700],"đường nguyễn thái học|||nguyễn thế rục":[33400,6900,3500,1800],"đường nguyễn thế rục|||đường trần khát chân":[29900,6900,3500,1800],"đường nguyễn thái học|||đường trần khát chân":[32400,7200,3600,1800],"đường lê anh xuân|||đường nguyễn an ninh":[25000,6000,3000,1500],"nguyễn huy tưởng|||trần khát chân":[25000,5000,3000,1500],"đào hồng cẩm|||xuân diệu":[25000,5000,3000,1500],"ga nam định|||khu cn":[19000,8400,4800,2400],"đường giải phóng|||trường nguyễn trãi":[22400,9800,5600,2800],"trường nguyễn trãi|||mương kênh gia":[14000,5900,3600,1800],"đường giải phóng|||khu dân cư":[16500,7300,4200,2100],"trần nhân tông|||mương kênh gia":[30000,0,0,0],"đường phạm huy thông|||khu dân cư cũ":[20200,0,0,0],"đường phạm huy thông|||đường tạ quang bửu":[20000,0,0,0],"đường trần quốc hoàn|||đường tạ quang bửu":[20000,0,0,0],"đường nguyễn văn cừ|||khu dân cư cũ":[20000,0,0,0],"đường tô ngọc vân|||đường đỗ nguyên sáu":[20000,0,0,0],"đường văn cao|||khu dân cư cũ":[21500,0,0,0],"đầu đường|||cuối đường":[21500,0,0,0],"văn cao|||nguyễn văn cừ":[21500,0,0,0],"đường đặng thai mai|||đường phan huy ích":[19000,0,0,0],"đường đặng thai mai|||đường phan huy chú":[19200,0,0,0],"khu dân cư cũ|||đường phan huy chú":[24700,0,0,0],"đường phạm huy tdpg|||đường tôn thất tùng":[20000,0,0,0],"đường trần quốc hoàn|||đường bùi thị xuân":[22400,0,0,0],"đường vũ công tự|||đường tạ quang bửu":[19000,0,0,0],"bùi thị xuân|||đường trần quốc hoàn":[21500,0,0,0],"tôn thất tùng|||đường trần quốc hoàn":[20000,0,0,0],"phía giáp đường sắt|||":[6800,3400,2300,1200],"phía không giáp đường sắt|||":[13600,6800,3400,1700],"giải phóng|||ngã 4 giao với ngõ 192 trần huy liệu":[12400,5200,3100,1600],"đường d2|||cuối đường":[12400,5200,3100,1600],"đường d3|||cuối đường":[10300,5200,3100,1600],"đường tàu|||đường trần huy liệu":[10000,5000,3000,1500],"đường d1|||đường d5":[36000,0,0,0],"giáp xã thành lợi|||giáp xã đại an (cũ)":[9600,4800,2400,1200],"giáp xã liên bảo (cũ)|||giáp xã đại thắng (cũ)":[6000,3000,1600,800],"đường có chiều rộng mặt cắt từ 3,5m trở lên|||khu vực thuộc phường cũ":[7000,0,0,0],"đường có chiều rộng mặt cắt từ 2m đến 3,5m|||":[2200,0,0,0],"đường có chiều rộng mặt cắt dưới 2m|||":[1500,0,0,0]},"Phường Thiên Trường":{"đường hàn thuyên|||đường trường chinh":[32400,13000,6500,3300],"đường trường chinh|||cầu lộc hạ":[34600,14100,7600,3800],"cầu lộc hạ|||quốc lộ 10 mới":[29800,11900,6000,3000],"quốc lộ 10 mới|||khu đô thị mỹ trung":[15000,6000,3000,1500],"đường thanh bình|||trung tâm y tế thành phố (bệnh viện tình thương)":[23000,9200,4600,2300],"trung tâm y tế thành phố (bệnh viện tình thương)|||chân cầu tân phong":[4000,2000,1000,500],"đường thái bình|||trạm dầu lửa":[13900,5800,3500,1800],"trạm dầu lửa|||kênh t3-11":[11700,5900,3600,1800],"kênh t3-11|||quốc lộ 10 mới":[10300,5200,3500,1800],"trần anh tông|||nguyễn bỉnh khiêm":[21000,8400,3400,1400],"đường nguyễn đức cảnh|||giáp ranh phường thiên trường":[21000,8400,4200,2100],"giáp địa phận phường nam định|||đường nguyễn thị trinh":[21000,9400,4700,2400],"giáp địa phận phường nam định|||đường thanh bình":[20000,8000,4000,2000],"cầu lộc hạ|||đường thanh bình":[11300,6800,3400,1700],"cầu đông mạc|||kđt mỹ trung":[13000,7800,3900,2000],"cầu đông mạc|||đường phù nghĩa":[14300,6500,3900,2000],"đường đông mạc|||đường phù nghĩa":[14300,6500,3900,2000],"đường phù nghĩa|||bệnh viện đông y":[14300,6500,3900,2000],"đường phù nghĩa|||bệnh viện phổi nam định":[25000,10100,5100,2600],"đường phù nghĩa|||đường thanh bình":[15000,6800,4100,2100],"từ đường phù nghĩa|||nghĩa trang đệ tứ":[15000,6300,3800,1900],"nghĩa trang đệ tứ|||khu đô thị mỹ trung":[12000,6000,3000,1500],"đường thái bình|||khu đô thị mỹ trung":[15000,6300,3800,1900],"đường thái bình|||ngõ 43 nguyễn tuân":[15000,6300,3800,1900],"ngõ 43 nguyễn tuân|||thửa 31, tờ bản đồ số 40, số nhà 105 (nhà ông nam)":[23000,10350,4000,1800],"thửa 31, tờ bản đồ số 40, số nhà 105 (nhà ông nam)|||kđt mỹ trung":[12000,5400,2500,1100],"đường d2|||đường d3":[18000,0,0,0],"đường d2|||đường d1":[18000,0,0,0],"đường d2|||lưu hữu phước kéo dài":[20000,0,0,0],"đường n4|||đường n3":[15000,0,0,0],"đường n1|||đường n5,n6":[20000,0,0,0],"đường n1|||n4":[20000,0,0,0],"đầu đường|||cuối đường":[6000,3000,2000,1000],"đường d3|||đến hết công viên đường n1":[15000,7500,3750,1500],"đường d3|||đến hết công viên đường n2":[10000,5000,2500,1000],"đường n1|||đường n2":[10000,5000,2500,1000],"đường võ nguyên giáp|||cuối đường":[60000,24000,12000,6000],"giáp ranh phường thiên trường|||đường trần thánh tông":[30000,12000,6000,3000],"đường nguyễn đức cảnh|||đường phạm văn xô":[21500,9600,4800,2400],"từ đường lã xuân oai|||đến đường phạm thế lịch":[21500,9600,4800,2400],"đường phạm văn xô|||đường nguyễn đức cảnh":[24000,9600,4800,2400],"đường nguyễn đức thuận|||giáp ranh phường thiên trường":[24000,9600,4800,2400],"giáp ranh phường thiên trường|||cầu lộc hạ (đường ven mương t3-11 cũ)":[24000,9600,4800,2400],"đường nguyễn đức thuận|||cầu lộc hạ (đường ven mương t3-11 cũ)":[24000,9600,4800,2400],"đường phạm văn xô|||nguyễn thị trinh":[21000,8400,4200,2100],"đường thanh bình|||giáp kđt mỹ trung":[35000,14000,7000,3500],"đường nối lưu hữu phước qua bệnh viện 700 giường|||quốc lộ 10":[35000,0,0,0],"đường võ chí công|||cuối đường":[35000,0,0,0],"đường phạm văn tráng|||cuối đường":[21600,0,0,0],"đường doãn khuê|||cuối đường":[17000,0,0,0],"trần duy hưng|||cuối đường":[17000,0,0,0],"huy cận|||cuối đường":[17000,0,0,0],"phạm trung thứ|||cuối đường":[17000,0,0,0],"đặng hữu dương|||cuối đường":[17000,0,0,0],"đường vũ huy hào|||cuối đường":[19200,0,0,0],"các đường còn lại trong khu đô thị mỹ trung|||cuối đường":[16000,0,0,0],"đường 11,5m|||cuối đường":[18000,0,0,0],"đường 13,5m|||cuối đường":[19200,0,0,0],"đường 17,5m|||cuối đường":[21600,0,0,0],"đường 31m|||cuối đường":[35000,0,0,0],"đoạn cầu viềng|||đường rẽ vào tdp 6":[14000,6400,3200,1600],"đoạn đường rẽ vào tdp 6|||đường vào nhà thờ trần văn lan":[13000,6500,3300,1700],"đoạn đường vào nhà thờ trần văn lan|||dốc hữu bị":[9000,4600,2000,1000],"đoạn quốc lộ 10|||đường vào tdp 3":[10500,5300,2300,1200],"đoạn giáp đường vào tdp 3|||cầu bơi":[9500,4400,2200,1100],"cầu bơi|||hết nhà ông hồng (đội 8)":[4500,2300,1200,600],"giáp phường nam định|||chân cầu tân đệ":[14500,7300,3700,1900],"đoạn cầu tân phong|||lối vào đền cây quế":[16000,8100,4600,2300],"đoạn lối rẽ đền cây quế|||phà tân đệ cũ":[12000,7000,3000,1500],"quốc lộ 10 cũ|||đền cây quế":[10000,5600,2300,1200],"quốc lộ 10 cũ|||đến trường thcs mỹ tân":[10000,5600,2300,1200],"đền cây quế|||cuối tổ dân phố hưng phụ long (nhà ông huấn)":[7000,3500,1750,900],"quốc lộ 10|||hết nhà ông khôi":[7000,4200,2100,1100],"giáp nhà ông khôi|||hết nhà ông khỏe":[6000,3800,1500,800],"trường thcs mỹ tân|||đoàn kết":[7000,4000,2000,1000],"đường trục xã hồng hà 2|||hồng hà 1":[5000,2600,1700,900],"quốc lộ 10 mới|||hồng phúc":[5000,2500,1250,700],"đường huỳnh tấn phát (nằm ở giữa đường lương khánh thiện và đường vũ đình liệu)|||đường vũ đình liệu - khu đtm thống nhất":[15000,6000,3000,1500],"đoạn đường phạm ngọc hồ|||đường đoàn khuê - khu đtm thống nhất":[15000,6000,3000,1500],"tương đương n25b-n37b, n37a-n38a - kđt thống nhất|||cuối đường":[10000,4000,2000,1000],"đầu đường thái bình|||hết số nhà 98 (hộ ông trần như lưu)":[10000,5000,2500,1300],"đoạn cầu viềng|||cầu bơi":[14000,6450,3225,1700],"đoạn cầu bơi|||hết nhà ông nhân (đội 4)":[12000,6000,3000,1500],"hết nhà ông nhân (đội 4)|||hết nhà ông viên (đội 10 nhất đê)":[8000,4000,2000,1000],"ngoài đê sông hồng|||cuối đường":[2500,1500,800,400],"đường có chiều rộng mặt cắt từ 3,5m trở lên|||":[3000,0,0,0],"đường có chiều rộng mặt cắt từ 2m đến 3,5m|||":[2000,0,0,0],"đường có chiều rộng mặt cắt dưới 2m|||":[1500,0,0,0]},"Phường Đông A":{"giáp địa phận lộc hạ cũ|||đầu chân cầu vượt xã lộc an":[14000,7100,3600,1800],"đường đường d6 khu cn hòa xá|||hết địa phận phường đông a":[12600,5300,3200,1600],"đảo giao thông|||hết địa phận phường đông a":[30000,12000,6000,3000],"đường giải phóng|||cty vt ôtô nam định":[32000,12900,6500,3300],"phía không tiếp giáp đường sắt|||":[20000,8900,4500,2300],"phía tiếp giáp đường sắt|||":[9000,5000,3000,1500],"đường trần huy liệu|||đường điện biên":[42000,16800,8400,4200],"đường điện biên|||đường đông a":[50000,20000,10000,5000],"đài phun nước|||quốc lộ 10 mới":[58000,23200,9300,3800],"đường điện biên|||hết địa phận phường đông a":[48500,19400,7800,3200],"đường giải phóng|||đường trần anh tông":[25000,10000,4000,1600],"công ty vận tải ô tô|||hết địa phận phường đông a":[21000,8400,3400,1400],"đường đông a|||đường đặng văn ngữ":[21000,8400,3400,1400],"phố bùi huy bích|||đường đặng văn ngữ":[21000,8400,3400,1400],"đường đông a|||trương hán siêu":[21000,8400,3400,1400],"đầu đường|||cuối đường":[21000,8400,3400,1400],"trần anh tông|||nguyễn bỉnh khiêm":[21000,8400,3400,1400],"trung tâm tdtt|||đường điện biên":[21000,8400,3400,1400],"đường đông a|||đường hoàng minh giám":[21000,8400,3400,1400],"nguyễn văn hoan|||phạm công trứ":[21000,8400,3400,1400],"phùng chí kiên|||đường nguyễn biểu":[21000,8400,3400,1400],"nguyễn công trứ|||đường trần quang triều":[21000,8400,3400,1400],"đường trần anh tông|||đường nguyễn công trứ":[21000,8400,3400,1400],"đường trần anh tông|||khu dân cư tân an":[21000,8400,3400,1400],"phùng chí kiên|||đường đội nhân":[21000,8400,3400,1400],"nguyễn công trứ|||đường khúc hạo":[21000,8400,3400,1400],"phùng chí kiên|||đường đặng dung":[21000,8400,3400,1400],"nguyễn công trứ|||đường đốc ngữ":[21000,8400,3400,1400],"đường n1|||đặng văn ngữ":[21000,8400,3400,1400],"đường n4|||trần nguyên đán":[21000,8400,3400,1400],"nguyễn văn hoan|||đặng văn ngữ":[21000,9400,4700,2400],"nguyễn văn hoan|||đường m4":[21000,8400,3400,1400],"trần nguyên đán|||đường m1":[21000,8400,3400,1400],"khu dân cư lương xá, phú ốc đường n4|||cuối đường":[15000,6000,3000,1500],"khu dân cư lương xá, phú ốc đường d2|||cuối đường":[11000,4400,2200,1100],"khu dân cư lương xá, phú ốc đường d2-1|||cuối đường":[11000,4400,1800,800],"khu dân cư lương xá, phú ốc đường d2-2|||cuối đường":[11000,4400,1800,800],"khu dân cư lương xá, phú ốc đường d3|||cuối đường":[11000,4400,2200,1100],"khu dân cư lương xá, phú ốc đường d4|||cuối đường":[11000,4400,2200,1100],"khu dân cư lương xá, phú ốc đường d4-1|||cuối đường":[10000,4000,1600,700],"khu dân cư lương xá, phú ốc đường d4-2|||cuối đường":[10000,4000,1600,700],"khu dân cư lương xá, phú ốc đường d5|||cuối đường":[11000,4400,2200,1100],"khu dân cư lương xá, phú ốc đường n1|||cuối đường":[11000,4400,1800,800],"khu dân cư lương xá, phú ốc đường n1-1|||cuối đường":[11000,4400,1800,800],"khu dân cư lương xá, phú ốc đường n2|||cuối đường":[11000,4400,2200,1100],"khu dân cư lương xá, phú ốc đường n3|||cuối đường":[11000,4400,2200,1100],"khu dân cư lương xá, phú ốc đường n3-1|||cuối đường":[11000,4400,1800,800],"khu dân cư lương xá, phú ốc đường d7|||cuối đường":[11000,4400,2200,1100],"đường phúc trọng|||đường giải phóng":[45000,0,0,0],"đường đỗ mạnh đạo|||đường sắt":[33600,0,0,0],"đoạn phố ngô thế vinh|||khu dân cư cũ":[24000,0,0,0],"đoạn đường kè hồ d3|||cuối đường":[24000,0,0,0],"đường phúc trọng|||đường phạm văn ngọ":[42000,0,0,0],"đường phúc trọng|||đường lâm hữu lập":[26000,0,0,0],"đường phạm ngũ lão|||khu dân cư":[30800,0,0,0],"đường phùng khắc khoan|||ngô thế vinh":[28600,0,0,0],"đường phùng khắc khoan|||phạm đăng giảng":[28600,0,0,0],"đường trần xuân vinh|||phố phạm văn ngọ":[16000,6400,3200,1600],"phố phạm đăng giảng|||đường sắt":[16000,6400,3200,1600],"đường xuân thủy|||đường sắt":[16000,6400,3200,1600],"phố trần xuân thiều|||phố phạm văn ngọ":[16000,6400,3200,1600],"đường điện biên|||đường trương hán siêu":[15000,6000,3000,1500],"đường điện biên|||cuối đường":[10000,4000,2000,1000],"đường vĩnh giang|||nhà thờ phú ốc":[7500,3000,1500,800],"cầu hoàng|||ql 38b":[13000,5200,2600,1300],"đoạn ql 38b|||cầu bà sen":[10000,4000,2000,1000],"cầu bà sen|||hết địa phận phường đông a":[5000,2000,1000,500],"đường điện biên|||đại lộ thiên trường":[16000,6400,2600,1100],"cầu ốc đường điện biên|||đại lộ thiên trường":[15000,6000,2400,1000],"đường điện biên|||đường n4 (kdc lương xá, phú ốc)":[10500,4200,1700,700],"đường n4 (kdc lương xá, phú ốc)|||hết khu dân cư":[6000,2400,1000,400],"đường điện biên|||cầu hoàng":[15000,6800,4100,2100],"cầu hoàng|||đường vào khu lưu niệm đảng bộ xã lộc hòa":[13000,6500,3900,2000],"đường vào khu lưu niệm đảng bộ xã lộc hòa|||hết địa phận phường đông a":[10000,5000,3000,1500],"dốc lốc|||dốc mai":[10000,5000,2500,1300],"dốc mai|||cống 32":[7000,3500,1800,900],"cống 32|||cây xăng mỹ hà":[5500,2800,1400,700],"cây xăng mỹ hà|||hết địa phận phường đông a":[4500,2300,1000,500],"cầu chéo vị việt|||cống chéo phường đông a - tỉnh lộ 486 (63b)":[5000,2600,1400,700],"ngã ba dốc lốc|||cầu bùi":[19000,7000,3500,1800],"giáp địa giới phường mỹ lộc|||cống 32":[5000,2500,1300,700],"cầu kim|||cầu đập":[6000,2400,1000,400],"cầu đập|||đê ất hợi":[5000,2000,800,400],"giáp địa giới phường mỹ lộc|||cầu thịnh":[25000,12500,6300,3200],"cầu thịnh|||cầu kim":[20000,10000,5000,2500],"cầu kim|||đình sắc":[30000,15000,7500,3800],"dốc sắc|||cầu sắc hòa hậu":[15000,7500,3800,1900],"đình sắc|||đường tỉnh 476":[25000,12500,6300,3200],"đình sắc|||phủ mỹ":[20000,10000,5000,2500],"cầu tây|||cầu nội":[30000,15000,7500,3800],"đoạn ngã 3 xóm sau đình thịnh|||đường đại lộ thiên trường":[10000,5000,2500,1300],"phủ mỹ|||dốc mai":[10000,5000,2500,1300],"cầu kim|||đình kim":[5000,2500,1300,700],"đoạn ngã ba xóm sau đình thịnh|||cầu nội trong":[6000,3000,1500,800],"cầu nội|||cầu nội trong":[5000,2500,1300,700],"cầu thịnh|||đoạn ngã3 xóm sau đìnhthịnh":[6000,2400,1000,400],"trường mầm non mỹ thắng khu a|||nhà thờ như thức":[15000,6000,3000,1500],"san bóng chín mười|||phủ mỹ":[15000,6000,3000,1500],"cửa hàng htx mua bán cũ|||cầu nhân tiến":[7000,3500,1800,900],"đường 2 vào chợ sét|||cuối đường":[6000,3100,1400,700],"đường 3 vào chợ sét|||cuối đường":[5000,2600,1400,700],"cây xăng mỹ hà|||đê ất hợi":[5000,2500,1300,700],"đường có chiều rộng mặt cắt từ 3,5m trở lên khu vực lộc hòa và tdp bẩy tám, chín mười|||":[8000,0,0,0],"đường có chiều rộng mặt cắt từ 3,5m trở lên các tdp còn lại|||":[4000,0,0,0],"đường có chiều rộng mặt cắt từ 2m đến 3,5m khu vực lộc hòa và tdp bẩy tám, chín mười|||":[5000,0,0,0],"đường có chiều rộng mặt cắt từ 2m đến 3,5m các tdp còn lại|||":[2000,0,0,0],"đường có chiều rộng mặt cắt dưới 2m khu vực lộc hòa và tdp bẩy tám, chín mười|||":[2000,0,0,0],"đường có chiều rộng mặt cắt dưới 2m các tdp còn lại|||":[1500,0,0,0]},"Phường Thành Nam":{"đường văn cao|||đường trần huy liệu":[33600,13500,6800,3400],"đường trần huy liệu|||đường điện biên":[42000,16800,8400,4200],"đường giải phóng|||ngã ba mỹ trọng":[30000,12000,6000,3000],"ngã ba mỹ trọng|||quốc lộ 10 mới":[26000,10400,5200,2600],"quốc lộ 10 mới|||cầu an duyên":[20000,8400,5100,2600],"giải phóng|||quốc lộ 10 mới":[30000,12000,6000,3000],"đường phạm ngũ lão|||đường dầu khí":[18000,7200,3600,1800],"đường bùi xuân mẫn|||đường khuất duy tiến":[18000,7200,3600,1800],"đường giải phóng|||đường khuất duy tiến":[18000,7200,3600,1800],"đường trần huy liệu|||đường mỹ xá":[26000,10400,4200,1700],"từ đường mỹ xá|||đường trần huy liệu":[15000,6000,2400,1000],"đường n6, kcn hòa xá|||đường mỹ xá":[14000,5600,2300,1000],"giải phóng|||chùa phúc trọng":[19000,8400,4800,2400],"ga nam định|||khu cn":[19000,8400,4800,2400],"đường giải phóng|||trường nguyễn trãi":[22400,9800,5600,2800],"trường nguyễn trãi|||mương kênh gia":[14000,5900,3600,1800],"giáp địa phận lộc hạ cũ|||đầu chân cầu vượt xã lộc an":[14000,7100,3600,1800],"d7|||mương kênh gia":[19200,8400,4800,2400],"đường d7|||khu kênh gia":[19000,8400,4800,2400],"đường phạm ngũ lão|||dân cư mỹ xá - 15m":[20000,8000,4000,2000],"đường phạm ngũ lão|||đường n2 - 18,5m":[24000,9600,4800,2400],"đường phạm ngũ lão|||khu dân cư mỹ xá - 13m":[19000,8400,4800,2400],"đường n4|||đường n2 - 13m":[19000,8400,4800,2400],"đường phạm ngũ lão|||đường n1 - 20,5m":[24000,9600,4800,2400],"đường n3|||đường n1":[19000,8400,4800,2400],"đường vũ tuấn chiêu|||đường trần tuấn khải":[18000,7200,3600,1800],"ngô gia khảm|||lê văn phúc":[18000,7200,3600,1800],"đường d1|||đường d2":[18000,7200,3600,1800],"đường d1|||khu dân cư cũ":[18000,7200,3600,1800],"khu dân cư cũ|||đỗ mạnh đạo":[18000,7200,3600,1800],"đỗ mạnh đạo|||đường sắt":[33600,0,0,0],"đỗ mạnh đạo|||phùng khắc khoan":[19000,8400,4800,2400],"trần huy liệu|||quốc lộ 10":[18000,7200,3600,1800],"đường phúc trọng|||đường giải phóng":[45000,0,0,0],"đường d1|||đường d5":[33000,0,0,0],"đường d5|||đường d6":[28600,0,0,0],"phố đỗ tông phát|||phố trần văn gia":[28600,0,0,0],"đường phạm ngũ lão|||ngô thế vinh":[30800,0,0,0],"đường n4 (phùng khắc khoan)|||đường ngô thế vinh":[28600,0,0,0],"đường phùng khắc khoan|||đường phạm đăng giảng":[28600,0,0,0],"phố thích thuận đức|||đường đỗ mạnh đạo":[33000,0,0,0],"đường phùng khắc khoan|||đường đỗ mạnh đạo":[30800,0,0,0],"đường phùng khắc khoan|||đường d1a":[28600,0,0,0],"cầu bát di (giáp xã hiển khánh)|||cầu an duyên":[14000,7100,3600,1800],"tdp trung thượng đại đê|||giáp phường mỹ lộc":[12400,6200,3100,1600],"đường đường d6 khu cn hòa xá|||cầu vĩnh giang":[12600,5300,3200,1600],"giáp xã liên bảo (cũ)|||xã hợp hưng (cũ)":[9600,4800,2400,1200],"ngã ba chợ quán (đường 38b)|||cầu đồng lạc (giáp hợp hưng)":[4800,2400,1200,600],"đoạn nối đường khả chính - bối xuyên (giáp xã hợp hưng)|||đường ql 38b đi nam định (công ty tân phát trường sơn)":[6000,3000,1500,800],"đường có chiều rộng mặt cắt từ 3,5m trở lên|||":[2000,0,0,0],"đường có chiều rộng mặt cắt từ 2m đến 3,5m|||":[1500,0,0,0],"đường có chiều rộng mặt cắt dưới 2m|||":[1000,0,0,0]},"Phường Vị Khê":{"cầu đò quan|||cống trắng (đường trục phía nam)":[25700,10600,5900,3000],"cống trắng (đường trục phía nam)|||ngã tư lê đức thọ":[21000,10500,5250,2625],"ngã tư lê đức thọ|||cầu nam vân":[18000,9000,4500,2250],"cầu vòi|||cầu đỗ xá":[20000,10100,5100,2600],"cầu đỗ xá|||giáp xã nam hồng":[19000,9600,4900,2500],"đoạn vụng định lễ nam vân|||đất nhà ông hùng":[17900,9000,4600,2300],"đoạn chân cầu đò quan|||đường dẫn cầu tân phong":[6000,3600,1800,1200],"đường đê lạc long quân|||quốc lộ 21":[22000,11100,5600,2800],"cầu tân phong xã nam phong|||đường đê lạc long quân":[12000,4800,2400,1200],"đoạn từ trường nông nghiệp|||đê lạc long quân":[12000,6000,3000,1500],"cống khúc|||đê lạc long quân":[12000,6000,3000,1500],"từ đê lạc long quân (nhà ông chí, phù long 1)|||đường dẫn cầu tân phong":[5000,2500,1250,650],"đường dẫn cầu tân phong|||điếm ngô xá":[7000,3500,1750,900],"đường đê bối: từ điếm vạn diệp|||điếm ống bò":[3000,1500,800,400],"cầu cao|||giáp đất giáp xã nam trực":[16000,8100,4100,2100],"tỉnh lộ 490c (đường 55 cũ)|||ngã tư ql 21":[20000,10000,4000,2000],"đoạn đường đặng xuân bảng|||đường dẫn cầu tân phong":[25000,8000,4000,2000],"cầu cao (đường 490)|||cầu mì (giáp ranh phường hồng quang)":[10000,5100,2600,1300],"cầu mì (giáp ranh phường hồng quang)|||giáp trại cá giống (giáp đất hồng quang)":[10000,5000,3800,1900],"cầu đỗ xá|||chợ mành":[12000,6000,3800,1900],"chợ mành|||giáp xã nam hồng":[10000,5100,2600,1300],"đường mỹ điền: đoạn từ ngã ba đường 21|||đường dẫn cầu tân phong":[15000,7500,3800,1900],"đường mỹ điền: đoạn từ đường dẫn cầu tân phong|||đê hữu hồng":[12000,6000,3000,1500],"đường phong quang: đường ngô xá xã nam phong|||trạm bơm bùi hạ (4,000m3/h)":[11000,5500,2700,1400],"ngã ba quốc lộ 21|||đường an thắng":[11000,5500,2700,1400],"từ nhà ông kiên|||đường lê đức thọ":[7000,3500,1750,900],"đường lê đức thọ|||đường an thắng":[7000,3500,1750,900],"khu dân cư ao lân tuyền|||hết khu":[7000,3600,1800,900],"tuyến đường d1|||cuối đường":[23000,0,0,0],"đường d3|||cuối đường":[20000,0,0,0],"đường n1|||cuối đường":[19000,0,0,0],"đường n2|||cuối đường":[18000,0,0,0],"đường n2: đường nối từ đường d5|||vào trong kdc":[15500,0,0,0],"đường n3: đường nối từ đường d5|||vào trong kdc":[15000,0,0,0],"đường n4: đoạn từ đường d5 đến d4|||vào trong kdc":[15000,0,0,0],"đường d1|||cuối đường":[17000,0,0,0],"đường d2|||cuối đường":[18000,0,0,0],"đường d4|||cuối đường":[18000,0,0,0],"đường d5 (đường phía đông ngoài cùng khu dân cư, nối từ đường lê đức thọ vào khu dân cư)|||cuối đường":[16000,0,0,0],"đường d5|||cuối đường":[17000,0,0,0],"đường d6|||cuối đường":[22000,0,0,0],"đường n3|||cuối đường":[18000,0,0,0],"đường n4|||cuối đường":[18000,0,0,0],"đường có chiều rộng mặt cắt từ 3,5m trở lên|||thuộc khu vực phường nam phong cũ":[3000,0,0,0],"đường có chiều rộng mặt cắt từ 2m đến 3,5m|||":[2000,0,0,0],"đường có chiều rộng mặt cắt dưới 2m|||":[1000,0,0,0]},"Phường Hồng Quang":{"cống trắng (đường trục phía nam)|||ngã tư lê đức thọ":[21000,10500,5250,2625],"ngã tư lê đức thọ|||cầu nam vân":[18000,9000,4500,2250],"cầu nam vân|||cầu vòi":[18000,9000,4500,2250],"đoạn ngã ba cầu vòi|||cầu dứa":[16000,8000,4000,2000],"đoạn cầu dứa|||giáp đất xã nam trực":[15000,7500,3800,1900],"đoạn giáp thành phố nam định|||ngã tư đường lê đức thọ":[15600,7800,4000,2000],"đoạn ngã tư đường lê đức thọ|||cầu cao":[16000,8000,4000,2000],"đoạn cầu cao|||chợ cà":[15000,7500,3800,1900],"đoạn giáp đất nam cường|||giáp đất tt nam giang (phía tây đường)":[16000,8000,4000,2000],"cầu vượt sông đào|||tỉnh lộ 490c (đường 55 cũ)":[20000,10000,4000,2000],"tỉnh lộ 490c (đường 55 cũ)|||ngã tư ql 21":[20000,10000,4000,2000],"đoạn đường tỉnh lộ 490c|||đê đại hà":[5600,2800,1400,700],"đoạn đình thượng hữu|||trạm bơm":[7000,4000,2000,1000],"ngã 3 lê đức thọ|||ql 21":[7000,4000,2000,1000],"đoạn tl 490c|||đê đại hà":[8000,4000,2000,1000],"giáp đất xã nam toàn|||ngã ba quốc lộ 21":[9000,4600,2400,1200],"đoạn ngã ba quốc lộ 21|||cầu ảnh":[7000,3500,1800,900],"đoạn cầu ảnh|||cầu trắng":[7000,3500,1800,900],"đoạn cầu trắng|||giáp xã nam trực":[8000,4000,1600,800],"đoạn trạm bơm bùi hạ|||cầu vòi (dọc sông châu thành)":[6000,3000,1500,800],"đường vũ hữu lợi|||sông lèo":[35000,0,0,0],"sông lèo|||đường lê đức thọ (s2)":[18000,7200,3600,1800],"đường lê đức thọ (đường s2)|||phường vị khê":[16000,8000,4000,2000],"phường vị khê|||xã nam trực":[14000,7000,3500,1750],"xã nam trực|||ql 21":[14000,7000,3500,1750],"đoạn ngã ba đường tỉnh lộ 490c|||hết ubnd xã":[5000,2500,1300,700],"đoạn giáp ubnd xã|||đê đại hà (nam an)":[4000,2000,1100,600],"đoạn ngã ba tỉnh lộ 490c|||trường mn nam nghĩa":[5000,2500,1300,700],"đoạn trường mn nam nghĩa|||hết khu tái định cư số 01":[4000,2000,1000,500],"đoạn ngã ba vân đồn|||trường mn nam nghĩa":[4000,2000,1000,500],"đoạn chợ an lá|||đường quốc phòng":[3500,1500,800,400],"đoạn giáp đất xã nam trực (cầu nguyễn)|||đê đại hà":[5000,2200,1200,600],"cầu dứa|||tdp mộng giáo":[5000,2200,1200,600],"tdp mộng giáo|||xuống tdp bàn thạch":[4000,2000,1100,600],"công chào đường ql21|||cầu chiền":[7000,3500,1750,900],"đoạn đường vhl|||đường trục xã nam vân cũ":[10000,4000,2000,1000],"đường vũ hữu lợi qua ubnd xã|||đường đặng xuân bảng":[12000,5000,3000,1500],"đường trục trung tâm phía nam thành phố|||cuối đường":[35000,0,0,0],"tuyến đường chính số 2, số 3|||cuối đường":[30000,0,0,0],"tuyến đường số 4, số 4a|||cuối đường":[25000,0,0,0],"các tuyến đường còn lại trong kđt|||cuối đường":[23000,0,0,0],"đường n1|||cuối đường":[15000,0,0,0],"đường n2, d1|||cuối đường":[7000,0,0,0],"tuyến đường d1|||cuối đường":[23000,0,0,0],"tuyến đường d2|||cuối đường":[22000,0,0,0],"tuyến đường d4|||cuối đường":[17000,0,0,0],"tuyến đường d5|||cuối đường":[17000,0,0,0],"tuyến đường n3|||cuối đường":[20000,0,0,0],"tuyến đường n4|||cuối đường":[20000,0,0,0],"tuyến đường n5|||cuối đường":[20000,0,0,0],"khu tái định cư (khu tái định cư số 1, 2, 3)|||hết khu":[3500,1500,800,0],"khu tái định cư giáp mặt đường trục xã nghĩa an (cũ)|||hết khu":[4000,2000,1000,0],"đường n2|||cuối đường":[10000,0,0,0],"đường có chiều rộng mặt cắt từ 3,5m trở lên|||":[3500,0,0,0],"đường có chiều rộng mặt cắt từ 2 đến 3,5m|||":[3000,0,0,0],"đường có chiều rộng mặt cắt dưới 2m|||":[2000,0,0,0]},"Phường Mỹ Lộc":{"km số 4|||giáp ngân hàng nông nghiệp":[18000,9000,4600,2300],"ngân hàng nông nghiệp|||cầu đặng":[15000,7500,3800,1900],"cầu đặng|||hết cầu giáng":[15000,7500,3800,1900],"cầu giáng|||cổng ubnd xã mỹ thịnh (cũ)":[14000,7100,3600,1800],"đường phía nam đường sắt|||cuối đường":[5000,2500,1300,700],"giáp xã hiển khánh - huyện vụ bản (cũ)|||cây xăng dầu khí":[8000,4000,2000,1000],"giáp cây xăng dầu khí|||hết trạm thu phí mỹ lộc cũ":[10000,5100,2600,1300],"giáp trạm thu phí|||hết cây xăng hàng không":[8000,4000,2000,1000],"giáp cây xăng hàng không|||cầu họ":[9000,4500,2400,1200],"nam quốc lộ 21 (nam đường sắt)|||cuối đường":[4500,2300,1200,600],"ubnd xã mỹ lộc (cũ)|||ngã ba đồng nhuệ":[13000,6500,3300,1700],"ngã ba đồng nhuệ|||cầu mái (bắc quốc lộ 21)":[13000,6600,3300,1700],"giáp xã hiển khánh|||giáp khu dân cư chợ huyện mỹ thịnh":[5000,2500,1250,700],"đoạn đất nhà bà đỗ thị ngát (ngã ba trung quyên)|||chân cầu giáng":[4500,2300,1200,600],"cầu la|||giáp phường đông a (địa bàn xã mỹ tiến)":[8000,4000,2000,1000],"khu dân cư lương xá, phú ốc đường n4|||cuối đường":[15000,6000,3000,1500],"khu dân cư lương xá, phú ốc đường d2|||cuối đường":[11000,4400,2200,1100],"giáp tp nam định|||bia căm thù":[6000,3000,1500,800],"bia căm thù|||cầu đặng":[6000,3000,1200,600],"các tuyến đường còn lại trong khu đô thị|||cuối đường":[23000,0,0,0],"đại lộ thiên trường|||quốc lộ 21":[33000,0,0,0],"quốc lộ 21|||đường thịnh thắng (hết địa phận thị trấn mỹ lộc cũ)":[10000,5000,2500,1300],"đường thịnh thắng (giáp địa phận thị trấn mỹ lộc cũ)|||đến giáp ranh xã hiển khánh":[9000,4500,2300,1200],"quốc lộ 21|||giáp xã hiển khánh":[7500,3800,1900,1000],"phường đông a|||trạm thu phí":[20000,12400,6200,3100],"trạm thu phí|||ngã tư xóm đình":[17000,8600,4300,2200],"ngã tư xóm đình|||hết ranh phường mỹ lộc":[15000,7500,3800,1900],"đường thống nhất (cầu mái)|||trạm bơm cộng hưu":[7000,3600,1600,800],"từ đường 21|||bói trung":[5000,2500,1300,700],"đại lộ thiên trường|||đê ất hợi":[7500,3900,1700,900],"đường đê ất hợi khuvực mỹ thuận|||khu vực mỹ tiến":[6000,2400,1200,600],"khu vực chợ huyện bám đường|||đền trần quang khải":[8000,4000,2000,1000],"đường đa mễ|||mỹ tho":[6000,3000,1500,800],"mỹ tho|||xóm 7 cầu nhát":[6000,3000,1500,800],"cầu nhát|||lộc hòa":[6000,3000,1500,800],"nhà ông tuyến|||nhà bà gương (xóm 3) đi cầu nhát":[6000,3000,1500,800],"đoạn kho htx|||cống mỹ tho":[6000,3000,1500,800],"đường bà vằng|||an cổ":[7000,3600,1900,1000],"đoạn nhà ông yên tdp đa mễ tây|||đt 485b":[6000,3000,1500,800],"đường đền trần quang khải|||đường 485":[6000,2400,1200,600],"khu chợ huyện mỹ thịnh|||hết khu":[6000,3000,1500,800],"tuyến đê ất hợi quốc lộ 21 (cầu họ)|||cống đá":[5000,3000,1600,800],"cống đá|||chợ mạng (bao gồm cả khu vực chợ mạng)":[6000,3600,1920,1000],"trạm bơm (htx nhân phú)|||cống đá":[6000,3000,1600,800],"đường hạnh lâm khu vực cầu họ|||cuối đường":[5000,2500,1250,700],"khu tái định cư đường bt|||hết khu":[7000,3510,1755,900],"đoạn giáp thị trấn|||cổng trào tdp la chợ":[10000,4000,2000,1000],"đoạn cổng chào la chợ|||dốc la":[7000,2800,1400,700],"quốc lộ 21 cầu giáng|||giáp địa giới xã mỹ tiến":[9000,4600,2400,1200],"quốc lộ 21|||ngã 3 hào hưng, hào quang":[4800,2400,1200,600],"quốc lộ 21|||trạm bơm tổ dân phố mỹ tục":[5000,2500,1300,700],"quốc lộ 21|||chợ huyện xã mỹ thịnh":[10000,5100,2500,1300],"cầu lê|||nhà văn hóa nam lê xá (gồm 2 bên đường)":[6500,3300,1700,900],"cầu lê|||đại lộ thiên trường":[6500,3300,1700,900],"cầu đặng|||đại lộ thiên trường":[5000,2500,1300,700],"cầu đặng|||gốc đa rẽ vào tdp vạn đồn":[10000,4000,2000,1000],"gốc đa|||tdp vạn đồn":[6000,2400,1200,600],"ql21|||nhà văn hóa tdp an hưng":[4500,2300,1200,600],"đường 21|||hết ngã ba nhà ông phê":[10000,5000,2500,1300],"ngã ba nhà ông phê|||cầu dừa":[6000,3000,1600,800],"nhà ông phê|||ao cầu vồng":[5000,2600,1400,700],"đoạn cầu ông thưởng|||đường thịnh thắng":[6000,3000,1600,800],"ngã ba chợ hôm|||cầu đặng xóm 3":[8000,4200,1900,1000],"cầu chéo sông t3|||cầu kiều":[18000,9000,4600,2300],"đoạn cầu kiều|||hết địa phận phường mỹ lộc":[30000,15000,7600,3800],"đại lộ thiên trường|||hết nhà ông thưởng":[6000,3000,1200,600],"bưu điện đặng xá|||đại lộ thiên trường":[10000,5100,2600,1300],"khu tái định cư đường nam định - phủ lý|||hết khu":[22500,11300,5700,2900],"các tuyến đường trong khu đô thị thị trấn mỹ lộc (thuộc địa giới xã mỹ hưng)|||hết khu":[18000,7200,3600,1800],"khu tái định cư đường sắt tốc độ cao|||hết khu":[18000,7200,3600,1800],"tuyến đường d1|||":[23500,0,0,0],"đường d3 (các lô biệt thự)|||":[13000,0,0,0],"đường n3|||":[12000,0,0,0],"đường n1, n2, d2|||":[15500,0,0,0],"đoạn dốc la ( đất nhà ông kế)|||cửa hàng lang xá":[6000,3000,1200,600],"đoạn cửa hàng lang xá|||lăng nhà thánh":[5000,2600,1400,700],"đoạn lăng nhà thánh|||giáp xã mỹ hà":[4000,2100,1300,700],"đoạn dốc la|||cầu chéo vị việt":[6000,3100,1400,700],"đường liên tdp đoạn (dốc nguộn|||phạm thức)":[3000,1600,1000,500],"đại lộ thiên trường|||quốc lộ 21 (tuyến tránh)":[18000,9000,4600,2300],"các tuyến đường trong khu đô thị thị trấn mỹ lộc|||hết khu":[13000,5200,2600,1300],"đường d3, n2|||cuối đường":[15000,0,0,0],"các tuyến đường còn lại|||cuối đường":[10000,0,0,0],"đường có chiều rộng mặt cắt từ 3,5m trở lên|||":[3000,0,0,0],"đường có chiều rộng mặt cắt từ 2m đến 3,5m|||":[2000,0,0,0],"đường có chiều rộng mặt cắt dưới 2m|||":[1000,0,0,0]}};

// HM-11: các ô lỗi/dòng thiếu quét từ PL02 .docx (#DIV/0!, "Chưa hoàn thiện", dòng không có trong bảng)
let BGD_DOCX_ISSUES = {"errCells": [["Phường Trường Thi", "11", "Đường Văn Cao", "Cầu Gia", "Cầu Vượt", "VT4 trung bình", "#DIV/0!"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D1", "Cuối đường", "VT1 cao nhất", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D1", "Cuối đường", "VT1 thấp nhất", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D1", "Cuối đường", "VT1 trung bình", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường D3", "Cuối đường", "VT1 cao nhất", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường D3", "Cuối đường", "VT1 thấp nhất", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường D3", "Cuối đường", "VT1 trung bình", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường N1", "Cuối đường", "VT1 cao nhất", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường N1", "Cuối đường", "VT1 thấp nhất", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường N1", "Cuối đường", "VT1 trung bình", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường N2", "Cuối đường", "VT1 cao nhất", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường N2", "Cuối đường", "VT1 thấp nhất", "chưa hoàn thiện"], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường N2", "Cuối đường", "VT1 trung bình", "chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D1", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D1", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D1", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D2", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D2", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D2", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D4", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D4", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D4", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D5", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D5", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D5", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N3", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N3", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N3", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N4", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N4", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N4", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N5", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N5", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N5", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"], ["Phường Hồng Quang", "20", "Khu dân cư tập trung Nam Quang", "Đường N1", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "20", "Khu dân cư tập trung Nam Quang", "Đường N1", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "20", "Khu dân cư tập trung Nam Quang", "Đường N1", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"], ["Phường Hồng Quang", "20", "Khu dân cư tập trung Nam Quang", "Đường N2", "Cuối đường", "VT1 cao nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "20", "Khu dân cư tập trung Nam Quang", "Đường N2", "Cuối đường", "VT1 thấp nhất", "Chưa hoàn thiện"], ["Phường Hồng Quang", "20", "Khu dân cư tập trung Nam Quang", "Đường N2", "Cuối đường", "VT1 trung bình", "Chưa hoàn thiện"]], "missingRows": [["Phường Nam Định", "157", "Đường Vũ Ngọc Phan - Dãy A", "Đường Phù Nghĩa", "Hết địa phấn phường Nam Định", false], ["Phường Nam Định", "190", "Đường Bái (Thôn Bái qua Thượng Lỗi ra đường Trần Thái Tông)", "Đương Trần Thái Tông", "Đường Kênh", false], ["Phường Nam Định", "237", "Đường nội thị tại phường Nam Định", "Phố Đỗ Huy Cảnh: Đưỡng Võ Nguyên Giáp", "Phố Đào Duy Từ", false], ["Phường Nam Định", "237", "Đường nội thị tại phường Nam Định", "Phố Nguyễn Tuấn Thông (Đường D1 khuTĐC phục vụGPMB phườg Cửa Nam - đường N1 khu TĐC phục vụ GPMB phường Cửa Nam)", "Cuối đường", false], ["Phường Trường Thi", "6", "Các tuyến đường trục chính trên địa bàn phường Trường Thi", "Ngã ba tổ dân phố Định Trạch", "Đường Chợ Lời- Đai Thắng (tổ dân phố Cao Phương)", false], ["Phường Trường Thi", "11", "Đường Văn Cao", "Công ty dệt kim Thắng Lợi", "Đường Song Hào", false], ["Phường Trường Thi", "11", "Đường Văn Cao", "Ngã tư Song Hào", "Cầu Gia", false], ["Phường Trường Thi", "11", "Đường Văn Cao", "Cầu Gia", "Cầu Vượt", true], ["Phường Thiên Trường", "20", "Khu tái định cư Liên Hà", "Khu tái định cư Liên Hà", "Khu tái định cư Liên Hà", false], ["Phường Đông A", "4", "Từ hết địa phận Cty Vận tải ô tô đến Cầu ốc", "Từ hết địa phận Cty Vận tải ô tô", "Cầu ốc", false], ["Phường Đông A", "4", "Từ Cầu ốc đến hết địa giới phường Đông A", "Cầu ốc", "Hết địa giới phường Đông A", false], ["Phường Đông A", "32", "Khu TĐC khu vực chùa thôn Phúc Trọng phường Mỹ Xá và khu Bãi Viên phường Lộc Hòa (Khu TĐC Phúc Tân)", "Khu TĐC khu vực chùa thôn Phúc Trọng phường Mỹ Xá và khu Bãi Viên phường Lộc Hòa (Khu TĐC Phúc Tân)", "Khu TĐC khu vực chùa thôn Phúc Trọng phường Mỹ Xá và khu Bãi Viên phường Lộc Hòa (Khu TĐC Phúc Tân)", false], ["Phường Đông A", "47", "Đường nội thị phường Đông A", "San bóng Chín Mười", "Phủ Mỹ", false], ["Phường Thành Nam", "48", "Đường nội thị phường Thành Nam (Thuộc phường Mỹ Xá cũ)", "Đường nội thị phường Thành Nam (Thuộc phường Mỹ Xá cũ)", "Đường nội thị phường Thành Nam (Thuộc phường Mỹ Xá cũ)", false], ["Phường Thành Nam", "49", "Các tuyến đường còn lại trên địa bàn phường (thuộc xã Đại An cũ)", "Các tuyến đường còn lại trên địa bàn phường (thuộc xã Đại An cũ)", "Các tuyến đường còn lại trên địa bàn phường (thuộc xã Đại An cũ)", false], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D1", "Cuối đường", true], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường D3", "Cuối đường", true], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường N1", "Cuối đường", true], ["Phường Vị Khê", "15", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Đường N2", "Cuối đường", true], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D1", "Cuối đường", true], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D2", "Cuối đường", true], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D4", "Cuối đường", true], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường D5", "Cuối đường", true], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N3", "Cuối đường", true], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N4", "Cuối đường", true], ["Phường Hồng Quang", "17", "Khu dân cư tập trung Đông Phong - Địch Lễ", "Tuyến đường N5", "Cuối đường", true], ["Phường Hồng Quang", "20", "Khu dân cư tập trung Nam Quang", "Đường N1", "Cuối đường", true], ["Phường Hồng Quang", "20", "Khu dân cư tập trung Nam Quang", "Đường N2", "Cuối đường", true]], "nguon": "PL02_Thanh Pho Nam Dinh (cu).docx"};

let BGD_PL02_STAT = null; // HM-11b: {file, rows, byWard:{ward:số dòng PL02}}
try { const _sv = JSON.parse(localStorage.getItem('td_pl02_issues_v1') || 'null'); if (_sv && _sv.issues && _sv.issues.errCells) { BGD_DOCX_ISSUES = _sv.issues; BGD_PL02_STAT = _sv.stat || null; } } catch (e) {}
async function bgd_importPL02(file) { // HM-11b
  const st = document.getElementById('bgd-pl02-status'), say = (t, c) => { if (st) { st.textContent = t; st.style.color = c || '#555'; } };
  if (!file) return;
  try {
    say('⌛ Đang đọc ' + file.name + '…');
    for (let i = 0; i < 40 && typeof PizZip === 'undefined'; i++) await new Promise(r => setTimeout(r, 250)); // thư viện nạp lúc rảnh
    if (typeof PizZip === 'undefined' && window.TD && TD.net && TD.net.ensureLib) { try { await TD.net.ensureLib('PizZip'); } catch (e) {} } // HM-27: bản nhúng lỗi ⇒ dự phòng có SRI (nếu đã bật)
    if (typeof PizZip === 'undefined') throw new Error('Thư viện đọc .docx chưa sẵn sàng — thử lại sau vài giây');
    const zip = new PizZip(await file.arrayBuffer()), f = zip.file('word/document.xml');
    if (!f) throw new Error('Không phải tệp .docx hợp lệ');
    const rows = TD.pl02.parse(f.asText());
    if (rows.length < 50) throw new Error('Không tìm thấy bảng giá (chỉ đọc được ' + rows.length + ' dòng) — có đúng PL02 không?');
    const iss = TD.pl02.issues(rows, W), byWard = {};
    rows.forEach(r => { byWard[r.ward] = (byWard[r.ward] || 0) + 1; });
    iss.nguon = file.name;
    BGD_DOCX_ISSUES = iss; BGD_PL02_STAT = { file: file.name, rows: rows.length, byWard: byWard };
    try { localStorage.setItem('td_pl02_issues_v1', JSON.stringify({ issues: iss, stat: BGD_PL02_STAT, at: new Date().toISOString() })); } catch (e) {}
    say('✅ Đã đọc ' + rows.length.toLocaleString('vi-VN') + ' dòng · ' + iss.errCells.length + ' ô lỗi · ' + iss.missingRows.length + ' dòng chưa có trong bảng đang nạp', '#15803d');
    bgd_renderAudit();
  } catch (e) { console.error('[HM-11b]', e); say('⛔ ' + e.message, '#dc2626'); }
}


// Helper: normalize string for lookup
function bgd_normKey(s){return s?s.toLowerCase().trim().replace(/\s+/g,' '):''}
let _bgd_idx = null;
function bgd_lookup(ward, tu, den, duong){ // HM-11: khoá trùng (cùng từ|đến, nhiều đường) ⇒ không xác định
  if(!_bgd_idx) _bgd_idx = TD.giadat.index(W);
  return TD.giadat.lookupUBND(_bgd_idx, bgd_UBND, ward, tu, den, duong);
}
function bgd_getUBND(ward, tu, den){
  return bgd_lookup(ward, tu, den).price;
}

const bgd_WARDS = Object.keys(W);
const VT_LABELS = ['VT1','VT2','VT3','VT4'];

// ===== NAVIGATION (BGD sub-nav) =====
function bgd_showSection(id, btn) {
  document.querySelectorAll('#page-giadat .section').forEach(s => s.classList.remove('active'));
  const el = document.getElementById(id);
  if(el) el.classList.add('active');
  document.querySelectorAll('.bgd-snav-btn').forEach(b => b.classList.remove('active'));
  if(btn) btn.classList.add('active');
  if(id === 'loi-du-lieu') { try { bgd_renderAudit(); } catch(e) { console.error('[HM-11]', e); } }
}

// ===== KH CALCULATOR =====
function kh_getCoeff(area, loai) {
  if(!area || area <= 0) return { val:1, label: loai==='nn'?'K3':'K2', note:'1,00 (mặc định – chưa nhập DT)' };
  if(loai === 'nn') {
    if(area < 200)   return {val:1,    label:'K3', note:'K3.1 – DT<200m²'};
    if(area < 500)   return {val:0.95, label:'K3', note:'K3.2 – 200–500m²'};
    if(area < 2000)  return {val:0.9,  label:'K3', note:'K3.3 – 500–2.000m²'};
    if(area < 5000)  return {val:0.8,  label:'K3', note:'K3.4 – 2.000–5.000m²'};
    if(area < 10000) return {val:0.7,  label:'K3', note:'K3.5 – 5.000–10.000m²'};
    return                  {val:0.5,  label:'K3', note:'K3.6 – DT≥10.000m²'};
  }
  if(area < 100)  return {val:1,   label:'K2', note:'DT<100m²'};
  if(area < 300)  return {val:0.9, label:'K2', note:'100–300m²'};
  if(area < 500)  return {val:0.8, label:'K2', note:'300–500m²'};
  if(area < 1000) return {val:0.7, label:'K2', note:'500–1.000m²'};
  return               {val:0.5, label:'K2', note:'DT≥1.000m²'};
}

function kh_liveCalc() {
  const dongia = parseFloat(document.getElementById('kh-dongia').value) || 0;
  const loai   = document.getElementById('kh-loaidat').value;
  const area   = parseFloat(document.getElementById('kh-dientich').value) || 0;
  const cf     = kh_getCoeff(area, loai);
  // update K23 badge
  const badge  = document.getElementById('kh-k23-badge');
  if(badge) {
    badge.textContent = cf.label + ' = ' + cf.val.toFixed(2) + '  ·  ' + cf.note;
    badge.style.background = cf.val < 1 ? '#fde8e6' : (cf.val === 1 ? '#dbeafe' : '#d5f5e3');
    badge.style.color      = cf.val < 1 ? '#c0392b' : (cf.val === 1 ? '#1d4ed8' : '#1a7a30');
  }
  const k1 = parseFloat(document.getElementById('kh-k1').value);
  const k4 = parseFloat(document.getElementById('kh-k4').value);
  const k5 = parseFloat(document.getElementById('kh-k5').value);
  const h1 = parseFloat(document.getElementById('kh-h1').value);
  const h2 = parseFloat(document.getElementById('kh-h2').value);
  const hs = k1 * cf.val * k4 * k5 * h1 * h2;
  const hsEl = document.getElementById('kh-preview-hs');
  const valEl = document.getElementById('kh-preview-val');
  if(hsEl) hsEl.textContent = hs.toFixed(4);
  if(valEl) {
    valEl.textContent = dongia > 0
      ? Math.round(dongia * hs).toLocaleString('vi-VN') + ' đ/m²'
      : '— (chưa nhập đơn giá)';
  }
}

function kh_tinhGia() {
  const dongia = parseFloat(document.getElementById('kh-dongia').value) || 0;
  if(dongia <= 0) { alert('Vui lòng nhập đơn giá lựa chọn từ bảng!'); return; }
  const loai = document.getElementById('kh-loaidat').value;
  const area = parseFloat(document.getElementById('kh-dientich').value) || 0;
  const cf   = kh_getCoeff(area, loai);
  const k1   = parseFloat(document.getElementById('kh-k1').value);
  const k4   = parseFloat(document.getElementById('kh-k4').value);
  const k5   = parseFloat(document.getElementById('kh-k5').value);
  const h1   = parseFloat(document.getElementById('kh-h1').value);
  const h2   = parseFloat(document.getElementById('kh-h2').value);
  const tongHS = k1 * cf.val * k4 * k5 * h1 * h2;
  const tong   = dongia * tongHS;
  const areaStr = area > 0 ? ' (' + area.toLocaleString('vi-VN') + ' m²)' : '';

  const rv = document.getElementById('kh-result-value');
  if(rv) rv.textContent = Math.round(tong).toLocaleString('vi-VN', {maximumFractionDigits:0});

  const items = [
    ['Đơn giá tra bảng', dongia.toLocaleString('vi-VN') + ' đ', false],
    ['K1 – Mặt tiếp giáp', k1.toFixed(2), k1 > 1],
    [cf.label + ' – DT' + areaStr, cf.val.toFixed(2), cf.val !== 1],
    ['K4 – Mặt tiền chính', k4.toFixed(2), k4 !== 1],
    ['K5 – Hình dáng', k5.toFixed(2), k5 !== 1],
    ['H1 – Lợi thế', h1.toFixed(2), h1 > 1],
    ['H2 – Bất lợi', h2.toFixed(2), h2 < 1],
    ['Tổng hệ số K×H', tongHS.toFixed(4), true],
  ];
  const bkEl = document.getElementById('kh-breakdown');
  if(bkEl) bkEl.innerHTML = items.map(function(item) {
    return '<div class="kh-bd-item"><div class="kh-bd-label">' + item[0] + '</div>'
         + '<div class="kh-bd-val' + (item[2] ? ' hi' : '') + '">' + item[1] + '</div></div>';
  }).join('');

  const box = document.getElementById('kh-result');
  if(box) {
    box.classList.add('show');
    try { box.scrollIntoView({behavior:'smooth', block:'nearest'}); } catch(e) {}
  }
}

function kh_reset() {
  const ids = ['kh-dongia','kh-dientich'];
  ids.forEach(function(id) { const el = document.getElementById(id); if(el) el.value=''; });
  const sels = ['kh-loaidat','kh-k1','kh-k5','kh-h1','kh-h2'];
  sels.forEach(function(id) { const el = document.getElementById(id); if(el) el.selectedIndex=0; });
  const k4el = document.getElementById('kh-k4'); if(k4el) k4el.selectedIndex=1;
  const box  = document.getElementById('kh-result'); if(box) box.classList.remove('show');
  kh_liveCalc();
}

// ===== BUILD WARD TABS =====
function bgd_buildWardTabs() {
  const container = document.getElementById('ward-tabs');
  const wardInfo = {
    'Phường Nam Định': {icon:'🏛️', rows: W['Phường Nam Định']?.length},
    'Phường Trường Thi': {icon:'📚', rows: W['Phường Trường Thi']?.length},
    'Phường Thiên Trường': {icon:'🌟', rows: W['Phường Thiên Trường']?.length},
    'Phường Đông A': {icon:'🏭', rows: W['Phường Đông A']?.length},
    'Phường Thành Nam': {icon:'🏙️', rows: W['Phường Thành Nam']?.length},
    'Phường Vị Khê': {icon:'🌿', rows: W['Phường Vị Khê']?.length},
    'Phường Hồng Quang': {icon:'🌸', rows: W['Phường Hồng Quang']?.length},
    'Phường Mỹ Lộc': {icon:'🦋', rows: W['Phường Mỹ Lộc']?.length},
  };
  const totalRows = bgd_WARDS.reduce((s,w)=>(s+(W[w]||[]).length),0);
  const allBtn = `<button class="ward-tab ${bgd_currentWard==='__ALL__'?'active-ward':''}" onclick="bgd_selectWard('__ALL__',this)">
    🗂 Tất cả phường <span style="opacity:.6;font-size:.75rem;">(${totalRows})</span>
  </button>`;
  container.innerHTML = allBtn + bgd_WARDS.map(w => {
    const info = wardInfo[w] || {icon:'📍', rows:0};
    return `<button class="ward-tab ${w===bgd_currentWard?'active-ward':''}" onclick="bgd_selectWard('${w}',this)">
      ${info.icon} ${w.replace('Phường ','')} <span style="opacity:.6;font-size:.75rem;">(${info.rows})</span>
    </button>`;
  }).join('');
}

function bgd_selectWard(ward, btn) {
  bgd_currentWard = ward;
  bgd_currentPage = 1;
  document.querySelectorAll('.ward-tab').forEach(b => b.classList.remove('active-ward'));
  if(btn) btn.classList.add('active-ward');
  document.getElementById('search-duong').value = '';
  document.getElementById('price-min').value = '';
  document.getElementById('price-max').value = '';
  bgd_filterAndRender();
}

// ===== TABLE HEADERS =====
function bgd_buildHeader() {
  const showVT = (vt) => bgd_currentVT === 'all' || bgd_currentVT === vt;
  let th = `<tr>
    <th rowspan="2" style="width:40px">STT</th>
    <th rowspan="2" style="min-width:160px">Tên đường / Khu vực</th>
    <th rowspan="2" style="min-width:120px">Từ</th>
    <th rowspan="2" style="min-width:120px">Đến</th>`;
  ['vt1','vt2','vt3','vt4'].forEach((vt,i) => {
    if(showVT(vt)) th += `<th colspan="3" style="text-align:center;background:${['#1a3a6b','#1e4d8c','#2460a7','#2873c2'][i]}">VT${i+1}</th>`;
  });
  th += `</tr><tr>`;
  ['vt1','vt2','vt3','vt4'].forEach((vt,i) => {
    if(showVT(vt)) {
      th += `<th style="min-width:90px">Cao nhất</th><th style="min-width:90px">Thấp nhất</th><th style="min-width:90px;background:#2D5016;color:#C8E6A0;">UBND (NQ38)</th>`;
    }
  });
  th += `</tr>`;
  document.getElementById('table-head').innerHTML = th;
}

// ===== FILTER & RENDER =====
function bgd_filterAndRender() {
  const q = (document.getElementById('search-duong').value || '').toLowerCase();
  const pMin = parseFloat(document.getElementById('price-min').value) / 1000 || 0;
  const pMax = parseFloat(document.getElementById('price-max').value) / 1000 || Infinity;
  
  let rows;
  if(bgd_currentWard === '__ALL__') {
    // Combine all wards, each row tagged with its ward name
    rows = [];
    bgd_WARDS.forEach(w => {
      (W[w]||[]).forEach(r => rows.push([...r, w]));
    });
  } else {
    rows = (W[bgd_currentWard] || []).map(r => [...r, bgd_currentWard]);
  }
  bgd_filteredRows = rows.filter(r => {
    const text = r[1].toLowerCase();
    if(q && !text.includes(q)) return false;
    const v1tb = r[6] || 0; // VT1 trung bình is index 6
    if(v1tb > 0 && (v1tb < pMin || v1tb > pMax)) return false;
    return true;
  });
  
  bgd_currentPage = 1;
  bgd_buildHeader();
  bgd_renderTable();
  bgd_renderPagination();
  bgd_renderStats();
}

function bgd_fmtPrice(v) {
  if(!v || v === 0) return '<span style="opacity:.3">–</span>';
  return (v * 1000).toLocaleString('vi-VN', {maximumFractionDigits:0});
}
function bgd_fmtUBND(v) {
  if(v === null || v === undefined) return '<span style="opacity:.3">N/A</span>';
  if(v === 0) return '<span style="opacity:.3">–</span>';
  // UBND values from PDF are in nghìn đồng (same scale as HTML data)
  return (v * 1000).toLocaleString('vi-VN', {maximumFractionDigits:0});
}

function bgd_renderTable() {
  const start = (bgd_currentPage-1) * bgd_PAGE_SIZE;
  const pageRows = bgd_filteredRows.slice(start, start+bgd_PAGE_SIZE);
  const showVT = (vt) => bgd_currentVT === 'all' || bgd_currentVT === vt;
  
  if(pageRows.length === 0) {
    document.getElementById('table-body').innerHTML = `<tr><td colspan="16" style="text-align:center;padding:24px;color:#666;font-style:italic;">Không tìm thấy dữ liệu phù hợp</td></tr>`;
    return;
  }
  
  let prev_stt = null;
  const tbody = pageRows.map((r, ri) => {
    const [stt, ten, tu, den, v1c,v1t,_v1tb, v2c,v2t,_v2tb, v3c,v3t,_v3tb, v4c,v4t,_v4tb, _ward] = r;
    const rowWard = _ward || bgd_currentWard;
    // Look up UBND prices
    const _lk = bgd_lookup(rowWard, tu, den, ten);
    const ubndRow = _lk.price;
    const _U = v => _lk.ambiguous ? '<span title="Khoá (từ|đến) trùng ở nhiều đường — bảng NQ38 không có tên đường nên không xác định giá của đường này" style="color:#b45309;font-size:.75rem;">⚠ trùng khoá</span>' : bgd_fmtUBND(v);
    const v1ubnd = ubndRow ? ubndRow[0] : null;
    const v2ubnd = ubndRow ? ubndRow[1] : null;
    const v3ubnd = ubndRow ? ubndRow[2] : null;
    const v4ubnd = ubndRow ? ubndRow[3] : null;
    const isNew = stt !== prev_stt;
    prev_stt = stt;
    const rowStyle = (start+ri) % 2 === 0 ? '' : 'background:#FAFAF8;';
    
    let tds = `<td class="num" style="color:#6b7280;">${stt}</td>`;
    tds += `<td><strong style="font-size:.88rem;">${ten}</strong></td>`;
    tds += `<td style="font-size:.82rem;color:#555;">${tu}</td>`;
    tds += `<td style="font-size:.82rem;color:#555;">${den}</td>`;
    
    if(showVT('vt1')) tds += `<td class="num num-red">${bgd_fmtPrice(v1c)}</td><td class="num">${bgd_fmtPrice(v1t)}</td><td class="num" style="background:#F0F7E6;color:#2D5016;font-weight:700;">${_U(v1ubnd)}</td>`;
    if(showVT('vt2')) tds += `<td class="num num-red">${bgd_fmtPrice(v2c)}</td><td class="num">${bgd_fmtPrice(v2t)}</td><td class="num" style="background:#F0F7E6;color:#2D5016;font-weight:700;">${_U(v2ubnd)}</td>`;
    if(showVT('vt3')) tds += `<td class="num num-red">${bgd_fmtPrice(v3c)}</td><td class="num">${bgd_fmtPrice(v3t)}</td><td class="num" style="background:#F0F7E6;color:#2D5016;font-weight:700;">${_U(v3ubnd)}</td>`;
    if(showVT('vt4')) tds += `<td class="num num-red">${bgd_fmtPrice(v4c)}</td><td class="num">${bgd_fmtPrice(v4t)}</td><td class="num" style="background:#F0F7E6;color:#2D5016;font-weight:700;">${_U(v4ubnd)}</td>`;
    
    return `<tr style="${rowStyle}">${tds}</tr>`;
  }).join('');
  
  document.getElementById('table-body').innerHTML = tbody;
}

function bgd_renderPagination() {
  const total = bgd_filteredRows.length;
  const totalPages = Math.ceil(total / bgd_PAGE_SIZE);
  const pg = document.getElementById('pagination');
  
  if(totalPages <= 1) { pg.innerHTML = `<span class="page-info">${total} tuyến đường/đoạn</span>`; return; }
  
  let html = `<span class="page-info">${total} kết quả · Trang ${bgd_currentPage}/${totalPages}</span>`;
  
  if(bgd_currentPage > 1) html += `<button class="page-btn" onclick="bgd_goPage(1)">«</button><button class="page-btn" onclick="bgd_goPage(${bgd_currentPage-1})">‹</button>`;
  
  const start = Math.max(1, bgd_currentPage-2);
  const end = Math.min(totalPages, bgd_currentPage+2);
  for(let i=start; i<=end; i++) {
    html += `<button class="page-btn ${i===bgd_currentPage?'active-page':''}" onclick="bgd_goPage(${i})">${i}</button>`;
  }
  
  if(bgd_currentPage < totalPages) html += `<button class="page-btn" onclick="bgd_goPage(${bgd_currentPage+1})">›</button><button class="page-btn" onclick="bgd_goPage(${totalPages})">»</button>`;
  
  pg.innerHTML = html;
}

function bgd_goPage(p) {
  bgd_currentPage = p;
  bgd_renderTable();
  bgd_renderPagination();
  try { document.getElementById('main-table').scrollIntoView({behavior:'smooth', block:'start'}); } catch(e) { document.getElementById('main-table').scrollIntoView(); }
}

function bgd_renderStats() {
  const rows = bgd_filteredRows;
  const withV1 = rows.filter(r => r[6] > 0);
  if(!withV1.length) { document.getElementById('stats-bar').innerHTML = ''; return; }
  
  const v1tbs = withV1.map(r => r[6]);
  const maxP = Math.max(...v1tbs) * 1000;
  const minP = Math.min(...v1tbs) * 1000;
  const avgP = (v1tbs.reduce((a,b)=>a+b,0)/v1tbs.length) * 1000;
  
  document.getElementById('stats-bar').innerHTML = `
    <div class="stat-item"><div class="stat-label">TỔNG ĐOẠN ĐƯỜNG</div><div class="stat-val">${rows.length}</div></div>
    <div class="stat-item"><div class="stat-label">VT1 MAX (TB)</div><div class="stat-val" style="color:var(--red)">${maxP.toLocaleString('vi-VN',{maximumFractionDigits:0})}</div></div>
    <div class="stat-item"><div class="stat-label">VT1 MIN (TB)</div><div class="stat-val" style="color:var(--success)">${minP.toLocaleString('vi-VN',{maximumFractionDigits:0})}</div></div>
    <div class="stat-item"><div class="stat-label">VT1 TRUNG BÌNH</div><div class="stat-val" style="color:var(--gold)">${Math.round(avgP).toLocaleString('vi-VN',{maximumFractionDigits:0})}</div></div>
  `;
}

function bgd_setVT(btn, vt) {
  document.querySelectorAll('.pill').forEach(p => p.classList.remove('active-pill'));
  btn.classList.add('active-pill');
  bgd_currentVT = vt;
  bgd_buildHeader();
  bgd_renderTable();
}

// ===== CALCULATE PRICE =====
function bgd_getK2(area, loai) { // HM-11: một bảng ngưỡng PL01 cho cả hai nơi
  return TD.giadat.coeff(area, loai);
}

function bgd_tinhGia() {
  const dongia = parseFloat(document.getElementById('inp-dongia').value) || 0;
  if(dongia <= 0) { alert('Vui lòng nhập đơn giá lựa chọn!'); return; }
  const k1 = parseFloat(document.getElementById('inp-k1').value);
  const area = parseFloat(document.getElementById('inp-dientich').value) || 0;
  const loai = document.getElementById('inp-loaidat').value;
  const k2 = bgd_getK2(area, loai);
  const k4 = parseFloat(document.getElementById('inp-k4').value);
  const k5 = parseFloat(document.getElementById('inp-k5').value);
  const h1 = parseFloat(document.getElementById('inp-h1').value);
  const h2 = parseFloat(document.getElementById('inp-h2').value);
  const tong = dongia * k1 * k2 * k4 * k5 * h1 * h2;
  const box = document.getElementById('result-box');
  document.getElementById('result-value').textContent = tong.toLocaleString('vi-VN',{maximumFractionDigits:0});
  box.classList.add('show');
  document.getElementById('result-breakdown').innerHTML = `
    <div class="breakdown-item"><div class="breakdown-label">Đơn giá lựa chọn</div><div class="breakdown-val">${dongia.toLocaleString('vi-VN')}</div></div>
    <div class="breakdown-item"><div class="breakdown-label">K1 (Mặt tiếp giáp)</div><div class="breakdown-val">${k1}</div></div>
    <div class="breakdown-item"><div class="breakdown-label">K2 (${area>0?area+'m²':'–'})</div><div class="breakdown-val">${k2}</div></div>
    <div class="breakdown-item"><div class="breakdown-label">K4 (Mặt tiền)</div><div class="breakdown-val">${k4}</div></div>
    <div class="breakdown-item"><div class="breakdown-label">K5 (Hình dáng)</div><div class="breakdown-val">${k5}</div></div>
    <div class="breakdown-item"><div class="breakdown-label">H1 (Lợi thế)</div><div class="breakdown-val">${h1}</div></div>
    <div class="breakdown-item"><div class="breakdown-label">H2 (Bất lợi)</div><div class="breakdown-val">${h2}</div></div>
    <div class="breakdown-item"><div class="breakdown-label">Tổng hệ số</div><div class="breakdown-val">${(k1*k2*k4*k5*h1*h2).toFixed(4)}</div></div>
  `;
  window._bgdLastResult = tong;
  document.getElementById('result-breakdown').insertAdjacentHTML('beforeend', '<div style="grid-column:1/-1;margin-top:8px"><button class="btn btn-green" onclick="bgd_toHoSo()">📤 Đưa sang hồ sơ vay (G0)</button></div>');
  try { box.scrollIntoView({behavior:'smooth',block:'nearest'}); } catch(e) { box.scrollIntoView(); }
}

function bgd_renderAudit() { // HM-11
  const esc = x => String(x == null ? '' : x).replace(/[&<>"]/g, c => ({'&':'&amp;','<':'&lt;','>':'&gt;','"':'&quot;'}[c]));
  const A = TD.giadat.audit(W, bgd_UBND), D = BGD_DOCX_ISSUES;
  const kpi = (t, v, c) => `<div style="flex:1 1 170px;border:1px solid #e5e7eb;border-radius:8px;padding:10px 12px;background:#fff"><div style="font-size:1.4rem;font-weight:800;color:${c||'#111827'}">${v.toLocaleString('vi-VN')}</div><div style="font-size:.8rem;color:#555">${t}</div></div>`;
  const tbl = (title, head, rows, note) => `<div class="card" style="margin:12px 0;padding:0"><div class="card-head"><span>${title} — ${rows.length} dòng</span></div>${note?`<div style="padding:6px 12px;font-size:.82rem;color:#555">${note}</div>`:''}<div class="table-wrap" style="max-height:340px"><table class="data-table"><thead><tr>${head.map(h=>`<th>${h}</th>`).join('')}</tr></thead><tbody>${rows.slice(0,400).map(r=>`<tr>${r.map(c=>`<td>${esc(c)}</td>`).join('')}</tr>`).join('')||'<tr><td colspan="'+head.length+'" style="text-align:center;color:#15803d">✅ Không có</td></tr>'}</tbody></table></div>${rows.length>400?'<div style="padding:6px 12px;font-size:.8rem">Hiển thị 400 dòng đầu.</div>':''}</div>`;
  const fmt = v => (v*1000).toLocaleString('vi-VN');
  document.getElementById('bgd-audit-body').innerHTML =
    `<div style="display:flex;flex-wrap:wrap;gap:10px">${kpi('Dòng bảng giá đang nạp', A.rows)}${kpi('Nhóm khoá (từ|đến) trùng', A.dupGroups.length, '#b45309')}${kpi('Dòng bị ảnh hưởng', A.dupRows, '#b45309')}${kpi('…trong đó có giá NQ38 (đang ẩn)', A.dupAffectedUBND, '#dc2626')}${kpi('TB ≠ (cao+thấp)/2', A.tbLech.length, '#b45309')}${kpi('Giá NQ38 > giá thấp nhất', A.ubndCaoHonThap.length, '#b45309')}${kpi('Ô lỗi trong PL02 .docx', D.errCells.length, '#dc2626')}${kpi('Dòng PL02 không có trong bảng', D.missingRows.length, '#dc2626')}</div>` +
    tbl('🔁 Khoá (từ|đến) trùng ở nhiều đường', ['PHƯỜNG','TỪ|||ĐẾN','CÁC ĐƯỜNG','SỐ DÒNG','CÓ GIÁ NQ38'], A.dupGroups.map(g => [g.ward, g.key.replace('|||',' → '), g.roads.join(' ; '), g.n, g.ubnd ? 'có (không gán)' : 'không']), 'Bảng NQ38 chỉ khoá theo từ|đến nên không biết giá thuộc đường nào ⇒ app hiện “⚠ trùng khoá” thay vì gán nhầm. Cần đối chiếu bản gốc NQ38 (PDF) để bổ sung tên đường.') +
    tbl('🧮 Trung bình ≠ (cao nhất + thấp nhất)/2', ['PHƯỜNG','STT','ĐƯỜNG','TỪ','ĐẾN','VT','CAO','THẤP','TB','TB KỲ VỌNG'], A.tbLech.map(x => [x.ward,x.stt,x.duong,x.tu,x.den,'VT'+x.vt,fmt(x.cao),fmt(x.thap),fmt(x.tb),fmt(x.ky_vong)])) +
    tbl('📈 Giá NQ38 cao hơn giá thấp nhất (CV 39/2026)', ['PHƯỜNG','STT','ĐƯỜNG','TỪ','ĐẾN','VT','GIÁ NQ38','THẤP NHẤT'], A.ubndCaoHonThap.map(x => [x.ward,x.stt,x.duong,x.tu,x.den,'VT'+x.vt,fmt(x.ubnd),fmt(x.thap)])) +
    (BGD_PL02_STAT ? tbl('⚖️ Đối chiếu số dòng theo phường: bảng đang nạp / PL02 .docx / chênh lệch', ['PHƯỜNG','BẢNG ĐANG NẠP','PL02 .docx','CHÊNH LỆCH'],
      Array.from(new Set(Object.keys(W).concat(Object.keys(BGD_PL02_STAT.byWard)))).map(w => { const a = (W[w] || []).length, b = BGD_PL02_STAT.byWard[w] || 0; return [w, a, b, (a - b) ? '⚠️ ' + (a - b) : '✅ 0']; }),
      'Chênh lệch ≠ 0: bảng nạp trong app khác PL02 (dòng thiếu/thừa) — xem danh sách dưới đây. Nguồn: ' + esc(BGD_PL02_STAT.file)) : '') +
    tbl('🛑 Ô lỗi trong PL02 .docx (“#DIV/0!”, “Chưa hoàn thiện”)', ['PHƯỜNG','STT','ĐƯỜNG','TỪ','ĐẾN','CỘT','NỘI DUNG Ô'], D.errCells, 'Nguồn: ' + esc(D.nguon) + '. Các ô này không có số nên không dùng để tính; cần cơ quan ban hành bổ sung.') +
    tbl('📄 Dòng PL02 .docx không có trong bảng đang nạp', ['PHƯỜNG','STT','ĐƯỜNG','TỪ','ĐẾN','CÓ Ô LỖI'], D.missingRows.map(r => [r[0],r[1],r[2],r[3],r[4],r[5]?'có':'']));
}
function bgd_toHoSo() { // HM-11: đưa kết quả sang hồ sơ vay (ô G0 — calcGiaDat)
  const v = window._bgdLastResult || 0, el = document.getElementById('giaDatG0');
  if(!(v > 0)) { alert('Hãy bấm Tính trước.'); return; }
  if(!el) { try { showToast('Chưa mở hồ sơ vay có ô đơn giá đất (G0) — hãy mở hồ sơ vay trước', 'red'); } catch(e) {} return; }
  el.value = Math.round(v); try { el.dispatchEvent(new Event('input', {bubbles:true})); } catch(e) {}
  try { calcGiaDat(); showToast('✅ Đã đưa ' + Math.round(v).toLocaleString('vi-VN') + ' đ/m² sang hồ sơ vay (G0)', 'green'); } catch(e) { console.error(e); }
}

function bgd_resetForm() {
  ['inp-dongia','inp-dientich'].forEach(id => document.getElementById(id).value='');
  ['inp-k1','inp-k4','inp-k5','inp-h1','inp-h2'].forEach(id => document.getElementById(id).selectedIndex=0);
  document.getElementById('result-box').classList.remove('show');
}

// ===== INIT =====
bgd_buildWardTabs();
bgd_filterAndRender();

/* ═══════════════════════════════════════════════════════════════
   PRO-33 FILE ARCHIVE SYSTEM
   Lưu trữ dữ liệu và báo cáo với snapshot + compare
   ═══════════════════════════════════════════════════════════════ */

window._PRE_SNAPS = [];

let _archiveDataList = [];
var _archiveReportList = []; window._archiveReportList = _archiveReportList;
let _currentArchiveTab = 'data';

// Initialize archive system
function archiveInit() {
  archiveLoadFromStorage();
  archiveRenderDataList();
  archiveRenderReportList();
}

// Switch between tabs
function archiveSwitchTab(tab) {
  _currentArchiveTab = tab;
  document.getElementById('archive-data-pane').style.display = tab === 'data' ? 'block' : 'none';
  document.getElementById('archive-report-pane').style.display = tab === 'report' ? 'block' : 'none';
  const dailyPane = document.getElementById('archive-daily-pane');
  if (dailyPane) dailyPane.style.display = tab === 'daily' ? 'block' : 'none';

  document.getElementById('tab-data-archive').style.borderBottomColor = tab === 'data' ? 'var(--green-main)' : 'transparent';
  document.getElementById('tab-data-archive').style.color = tab === 'data' ? 'var(--green-main)' : 'var(--gray-500)';
  
  document.getElementById('tab-report-archive').style.borderBottomColor = tab === 'report' ? 'var(--green-main)' : 'transparent';
  document.getElementById('tab-report-archive').style.color = tab === 'report' ? 'var(--green-main)' : 'var(--gray-500)';

  const dailyTabBtn = document.getElementById('tab-daily-archive');
  if (dailyTabBtn) {
    dailyTabBtn.style.borderBottomColor = tab === 'daily' ? 'var(--green-main)' : 'transparent';
    dailyTabBtn.style.color = tab === 'daily' ? 'var(--green-main)' : 'var(--gray-500)';
  }

  // 🏷️ Cập nhật tag status banner khi chuyển sang tab Báo cáo
  if (tab === 'report') archiveRenderReportList();
  if (tab === 'daily') archiveRenderDailyList();
}

// Save data snapshot
function archiveSaveData() {
  const timestamp = new Date();
  const dd = String(timestamp.getDate()).padStart(2,'0');
  const mm = String(timestamp.getMonth()+1).padStart(2,'0');
  const yyyy = timestamp.getFullYear();
  const HH = String(timestamp.getHours()).padStart(2,'0');
  const MM = String(timestamp.getMinutes()).padStart(2,'0');
  // ✅ Nếu đến từ import file nguồn → dùng ngày file (vd: 25/04/2026), ngược lại giữ tên cũ
  const fileName = window._importSourceDate || `Data ${dd}/${mm}/${yyyy} ${HH}:${MM}`;
  window._importSourceDate = null; // reset sau khi dùng
  
  const backup = {
    type: 'data',
    name: fileName,
    date: timestamp.toLocaleString('vi-VN'),
    timestamp: timestamp.getTime(),
    data: DATA,
    dataSize: JSON.stringify(DATA).length,
    recordCount: (DATA.qltd || []).length
  };
  
  _archiveDataList.push(backup);
  archiveSaveToStorage();
  archiveRenderDataList();
  
  alert(`✅ Đã lưu trữ dữ liệu: ${fileName}`);
}

// Save report snapshot
function archiveSaveReport() {
  const timestamp = new Date();
  const dd = String(timestamp.getDate()).padStart(2,'0');
  const mm = String(timestamp.getMonth()+1).padStart(2,'0');
  const yyyy = timestamp.getFullYear();
  const HH = String(timestamp.getHours()).padStart(2,'0');
  const MM = String(timestamp.getMinutes()).padStart(2,'0');
  // ✅ Nếu đến từ import file nguồn → dùng ngày file, ngược lại giữ tên cũ
  const fileName = window._importSourceDate || `Report ${dd}/${mm}/${yyyy} ${HH}:${MM}`;
  // Lưu lại nguồn ngày để gắn tag (nếu là import IPCAS với ngày file ≠ today)
  const importDate = window._importDateActual || null; // format dd/mm/yyyy nếu import
  window._importSourceDate = null;
  window._importDateActual = null;

  const currentData = DATA.qltd || [];
  const report = {
    type: 'report',
    name: fileName,
    date: timestamp.toLocaleString('vi-VN'),
    timestamp: timestamp.getTime(),
    reportData: currentData,
    customers: TD.metrics.countCustomers(currentData), // HM-09
    accounts: currentData.length,
    totalBalance: currentData.reduce((sum, r) => sum + (Number(r[11]) || 0), 0),
    // 🏷️ Tag mốc so sánh — auto-detect từ ngày file (nếu import) hoặc ngày hệ thống
    tag: archiveDetectTag(importDate, timestamp)
  };

  _archiveReportList.push(report);
  archiveSaveToStorage();
  archiveRenderReportList();

  const tagLbl = report.tag ? archiveTagLabel(report.tag) : '(chưa gắn mốc)';
  const idx    = _archiveReportList.length - 1;
  // Hiển thị toast + gợi ý tải xuống ngay để đảm bảo không mất dữ liệu
  if (typeof showToast === 'function') {
    showToast(`✅ Đã lưu trữ báo cáo: ${fileName} — 🏷️ ${tagLbl}`, 'green');
  }
  // Nhắc nhở tải xuống sau 600ms để user có thể hành động ngay
  setTimeout(() => {
    const ok = confirm(
      `✅ Đã lưu snapshot: "${fileName}"\n🏷️ Mốc: ${tagLbl}\n\n` +
      `⚠️ LƯU Ý QUAN TRỌNG:\n` +
      `• Dữ liệu snapshot (reportData) tồn tại trong bộ nhớ và sessionStorage.\n` +
      `• Nếu đóng tab/trình duyệt, dữ liệu này sẽ MẤT vĩnh viễn.\n` +
      `• Bấm OK để TẢI XUỐNG ngay file JSON để giữ lâu dài.\n` +
      `• Bấm Hủy để bỏ qua (có thể tải sau bằng nút ⬇️ trong danh sách).`
    );
    if (ok && typeof archiveDownloadReport === 'function') archiveDownloadReport(idx);
  }, 600);
}

/* ═══════════════════════════════════════════════════════════════
   🏷️ HỆ THỐNG TAG MỐC SO SÁNH
   Mỗi snapshot có 1 tag đại diện cho mốc thời gian:
     • year_end → 31/12/YYYY
     • quarter  → Q1(31/03), Q2(30/06), Q3(30/09)
     • month    → T1,T2,T4,T5,T7,T8,T10,T11 (tháng lẻ)
     • month    → "Đầu tháng MM/YYYY"
     • other    → "Mốc khác" (mặc định nếu không phải mốc đặc biệt)
     • null     → Chưa gắn

   Auto-detect rule (theo nghiệp vụ Agribank):
     • 31/12/YYYY hoặc 01/01/(YYYY+1) → year (YYYY+1)
     • 31/03 hoặc 01/04 → quarter 2
     • 30/06 hoặc 01/07 → quarter 3
     • 30/09 hoặc 01/10 → quarter 4
     • Cuối tháng (31/x, 30/x, 28/29 cho T2) hoặc 01/x → month (next/curr)
     • Khác → other
   ═══════════════════════════════════════════════════════════════ */

function archiveDetectTag(importDateStr, fallbackTimestamp) {
  // importDateStr: "dd/mm/yyyy" hoặc null
  // fallbackTimestamp: Date hoặc number
  //
  // TAG KINDS (v2 — nghiệp vụ Agribank):
  //   year_end  → 31/12/YYYY  (mốc cuối năm, dùng cả cho Quý IV)
  //   quarter   → 31/03 (Q1), 30/06 (Q2), 30/09 (Q3)
  //   month     → cuối tháng còn lại (T1, T2, T4, T5, T7, T8, T10, T11)
  //   other     → ngày giữa tháng, không phải mốc đặc biệt
  let d = null;
  if (importDateStr) {
    const m = String(importDateStr).match(/^(\d{1,2})\/(\d{1,2})\/(\d{4})/);
    if (m) d = new Date(+m[3], +m[2]-1, +m[1]);
  }
  if (!d && fallbackTimestamp) {
    d = new Date(fallbackTimestamp);
  }
  if (!d || isNaN(d)) return null;

  const day   = d.getDate();
  const month = d.getMonth() + 1; // 1-12
  const year  = d.getFullYear();
  const lastDay = new Date(year, month, 0).getDate(); // ngày cuối tháng

  // ── YEAR-END: 31/12 ──────────────────────────────────────────
  if (day === 31 && month === 12) {
    return { kind: 'year_end', year: year };
  }
  // 01/01/YYYY → tương đương 31/12 năm trước
  if (day === 1 && month === 1) {
    return { kind: 'year_end', year: year - 1 };
  }

  // ── QUARTER-END ───────────────────────────────────────────────
  // Q1: 31/03 hoặc 01/04
  if ((day === 31 && month === 3) || (day === 1 && month === 4)) {
    return { kind: 'quarter', year: year, quarter: 1 };
  }
  // Q2: 30/06 hoặc 01/07
  if ((day === 30 && month === 6) || (day === 1 && month === 7)) {
    return { kind: 'quarter', year: year, quarter: 2 };
  }
  // Q3: 30/09 hoặc 01/10
  if ((day === 30 && month === 9) || (day === 1 && month === 10)) {
    return { kind: 'quarter', year: year, quarter: 3 };
  }

  // ── MONTH-END (các tháng không phải cuối quý / cuối năm) ──────
  // Cuối tháng → tag tháng đó (không "đẩy" sang tháng kế tiếp như cũ)
  if (day === lastDay) {
    return { kind: 'month', year: year, month: month };
  }
  // Ngày 01 → tương đương cuối tháng trước
  if (day === 1) {
    const prevMonth = month === 1 ? 12 : month - 1;
    const prevYear  = month === 1 ? year - 1 : year;
    return { kind: 'month', year: prevYear, month: prevMonth };
  }

  // ── Ngày khác ─────────────────────────────────────────────────
  return { kind: 'other' };
}

function archiveTagLabel(tag) {
  if (!tag || !tag.kind) return '(chưa gắn)';
  if (tag.kind === 'year_end') return `📅 31/12/${tag.year}`;
  if (tag.kind === 'quarter') {
    const qEnd = ['31/03','30/06','30/09'][tag.quarter - 1] || `Q${tag.quarter}`;
    return `📊 Quý ${tag.quarter} (${qEnd}/${tag.year})`;
  }
  if (tag.kind === 'month') return `📆 T${String(tag.month).padStart(2,'0')}/${tag.year}`;
  if (tag.kind === 'other') return '📋 Mốc khác';
  return '(chưa gắn)';
}

function archiveTagChipHtml(tag, idx) {
  const lbl = archiveTagLabel(tag);
  let cls = 'archive-tag-none';
  if (tag && tag.kind === 'year_end') cls = 'archive-tag-year';
  else if (tag && tag.kind === 'quarter') cls = 'archive-tag-quarter';
  else if (tag && tag.kind === 'month')   cls = 'archive-tag-month';
  else if (tag && tag.kind === 'other')   cls = 'archive-tag-other';
  return `<span class="archive-tag-chip ${cls}">${lbl}</span>`;
}

// Tạo HTML <select> để chỉnh tag cho 1 dòng
function archiveTagSelectHtml(idx, tag) {
  const cur = archiveTagToSelectValue(tag);
  const curYear = new Date().getFullYear();
  const years = [curYear - 1, curYear, curYear + 1];

  let opts = `<option value="">— Chưa gắn —</option>`;

  // 31/12 (Year-end)
  opts += `<optgroup label="📅 31/12 (Cuối năm)">`;
  years.forEach(y => {
    opts += `<option value="year_end-${y}" ${cur===`year_end-${y}`?'selected':''}>31/12/${y}</option>`;
  });
  opts += `</optgroup>`;

  // Quý (chỉ Q1, Q2, Q3 — Q4 = 31/12 đã có trên)
  opts += `<optgroup label="📊 Cuối Quý">`;
  years.forEach(y => {
    [[1,'31/03'],[2,'30/06'],[3,'30/09']].forEach(([q, lbl]) => {
      opts += `<option value="quarter-${y}-${q}" ${cur===`quarter-${y}-${q}`?'selected':''}>Quý ${q} (${lbl}/${y})</option>`;
    });
  });
  opts += `</optgroup>`;

  // Tháng (chỉ T1,T2,T4,T5,T7,T8,T10,T11 — T3,T6,T9,T12 đã có ở Quý/Cuối năm)
  opts += `<optgroup label="📆 Cuối tháng">`;
  [curYear, curYear - 1].forEach(y => {
    [1,2,4,5,7,8,10,11].forEach(m => {
      const mm = String(m).padStart(2,'0');
      opts += `<option value="month-${y}-${m}" ${cur===`month-${y}-${m}`?'selected':''}>T${mm}/${y}</option>`;
    });
  });
  opts += `</optgroup>`;

  opts += `<option value="other" ${cur==='other'?'selected':''}>📋 Mốc khác</option>`;

  return `<select class="archive-tag-select" onchange="archiveSetTagFromSelect(${idx},this.value)">${opts}</select>`;
}

function archiveTagToSelectValue(tag) {
  if (!tag || !tag.kind) return '';
  if (tag.kind === 'year_end') return `year_end-${tag.year}`;
  if (tag.kind === 'quarter')  return `quarter-${tag.year}-${tag.quarter}`;
  if (tag.kind === 'month')    return `month-${tag.year}-${tag.month}`;
  if (tag.kind === 'other')    return 'other';
  return '';
}

function archiveSelectValueToTag(val) {
  if (!val) return null;
  if (val === 'other') return { kind: 'other' };
  let m;
  if ((m = val.match(/^year_end-(\d{4})$/))) return { kind: 'year_end', year: +m[1] };
  if ((m = val.match(/^quarter-(\d{4})-([1-4])$/))) return { kind: 'quarter', year: +m[1], quarter: +m[2] };
  if ((m = val.match(/^month-(\d{4})-(\d{1,2})$/))) return { kind: 'month', year: +m[1], month: +m[2] };
  return null;
}

function archiveSetTagFromSelect(idx, val) {
  if (idx < 0 || idx >= _archiveReportList.length) return;
  const tag = archiveSelectValueToTag(val);
  _archiveReportList[idx].tag = tag;
  archiveSaveToStorage();
  archiveRenderReportList();
  archiveRenderTagStatus();
  showToast(`🏷️ Đã gắn mốc: ${archiveTagLabel(tag)}`, 'green');
}

/* Tìm snapshot có tag khớp với mốc cần (dùng cho auto-fill BCKH).
   Trả về snapshot khớp NGUYÊN VẸN (gồm reportData), hoặc null.
   kind: 'year_end' | 'quarter' | 'month'
   year: number; quarterOrMonth: number (quarter 1-3, hoặc month 1-12) */
function archiveFindByTag(kind, year, quarterOrMonth) {
  const list = (Array.isArray(_archiveReportList) ? _archiveReportList : [])
    .filter(r => r && Array.isArray(r.reportData) && r.reportData.length)
    .slice()
    .sort((a,b) => (b.timestamp || 0) - (a.timestamp || 0)); // v13.9.9: nếu trùng tag, lấy bản mới nhất/đầy đủ
  for (const r of list) {
    const t = r.tag;
    if (!t || t.kind !== kind) continue;
    if (kind === 'year_end' && t.year === year) return r;
    if (kind === 'quarter'  && t.year === year && t.quarter === quarterOrMonth) return r;
    if (kind === 'month'    && t.year === year && t.month   === quarterOrMonth) return r;
  }
  return null;
}

/* Render banner "Mốc so sánh hiện tại" — show đủ 14 mốc chính */
function archiveRenderTagStatus() {
  const el = document.getElementById('archive-tag-status');
  if (!el) return;

  const yr = new Date().getFullYear();
  const prevYr = yr - 1;

  const card = (title, snap, hint) => {
    const found = !!snap;
    const bg     = found ? 'linear-gradient(135deg,#e8f5ec,#d4f1dc)' : '#fef3e2';
    const border = found ? 'var(--green-main)' : 'var(--orange)';
    const status = found
      ? `✅ <strong style="font-size:10.5px">${snap.name}</strong>`
      : `⚠ <em style="color:var(--orange);font-size:10px">Chưa có snapshot</em>`;
    const sub = found
      ? `<small style="color:var(--gray-700)">${snap.date}</small>`
      : `<small style="color:var(--gray-500);font-size:9.5px">${hint}</small>`;
    return `<div style="flex:1;min-width:160px;max-width:240px;background:${bg};border-left:3px solid ${border};
              border-radius:6px;padding:7px 10px;font-size:11px">
      <div style="font-weight:700;color:var(--navy);margin-bottom:2px">${title}</div>
      <div>${status}</div><div style="margin-top:1px">${sub}</div>
    </div>`;
  };

  const yearPrev   = archiveFindByTag('year_end', prevYr);
  const q1         = archiveFindByTag('quarter', yr, 1);
  const q2         = archiveFindByTag('quarter', yr, 2);
  const q3         = archiveFindByTag('quarter', yr, 3);
  const yearCurr   = archiveFindByTag('year_end', yr);
  const months     = {};
  [1,2,4,5,7,8,10,11].forEach(m => { months[m] = archiveFindByTag('month', yr, m); });

  el.innerHTML = `
    <div style="margin-bottom:8px;font-size:11px;font-weight:700;color:var(--navy)">
      📌 Trạng thái snapshot các mốc so sánh năm ${yr}
    </div>
    <div style="display:flex;gap:8px;flex-wrap:wrap;margin-bottom:8px">
      ${card(`📅 31/12/${prevYr}`, yearPrev,  `Cuối năm ${prevYr}`)}
      ${card(`📊 Q1 (31/03/${yr})`, q1,       `Cuối Q1`)}
      ${card(`📊 Q2 (30/06/${yr})`, q2,       `Cuối Q2`)}
      ${card(`📊 Q3 (30/09/${yr})`, q3,       `Cuối Q3`)}
      ${card(`📅 31/12/${yr}`,      yearCurr, `Cuối năm ${yr}`)}
    </div>
    <div style="display:flex;gap:8px;flex-wrap:wrap">
      ${[1,2,4,5,7,8,10,11].map(m =>
        card(`T${String(m).padStart(2,'0')}/${yr}`, months[m], `Cuối T${m}/${yr}`)
      ).join('')}
    </div>`;
}


// Render data archive list
function archiveRenderDataList() {
  const tbody = document.getElementById('archive-data-list');
  if (!tbody) return;
  
  tbody.innerHTML = _archiveDataList.length === 0 ? 
    `<tr><td colspan="6" style="padding:20px; text-align:center; color:var(--gray-500)">Chưa có dữ liệu lưu trữ</td></tr>` :
    _archiveDataList.map((item, idx) => `
      <tr id="data-row-${idx}" style="border-bottom:1px solid var(--gray-200); ${idx % 2 === 0 ? 'background:var(--gray-50)' : ''}">
        <td style="padding:8px; text-align:center; width:38px">
          <input type="checkbox" class="data-chk" data-idx="${idx}"
            onchange="archiveDataCheckChange()"
            style="width:14px;height:14px;cursor:pointer;accent-color:var(--green-accent)">
        </td>
        <td id="data-name-cell-${idx}" style="padding:8px">
          <span id="data-name-text-${idx}" style="display:inline-flex;align-items:center;gap:6px">
            📄 <span style="font-weight:600;color:var(--navy)">${escapeHtml(item.name)}</span>
            <button onclick="archiveStartEdit('data',${idx})" title="Đổi tên" style="background:none;border:none;cursor:pointer;font-size:13px;padding:2px 4px;border-radius:4px;color:var(--gray-400);transition:color .15s" onmouseover="this.style.color='var(--green-main)'" onmouseout="this.style.color='var(--gray-400)'">✏️</button>
          </span>
          <span id="data-name-edit-${idx}" style="display:none;align-items:center;gap:5px">
            <input id="data-name-input-${idx}" type="text" value="${item.name.replace(/"/g,'&quot;')}"
              style="padding:4px 8px;border:1.5px solid var(--green-main);border-radius:6px;font-size:12px;font-family:inherit;font-weight:600;color:var(--navy);outline:none;min-width:200px;box-shadow:0 0 0 3px rgba(26,122,48,.1)"
              onkeydown="if(event.key==='Enter')archiveConfirmEdit('data',${idx});else if(event.key==='Escape')archiveCancelEdit('data',${idx})">
            <button onclick="archiveConfirmEdit('data',${idx})" title="Lưu" style="background:var(--green-main);border:none;cursor:pointer;color:#fff;font-size:12px;font-weight:700;padding:4px 8px;border-radius:5px">✅</button>
            <button onclick="archiveCancelEdit('data',${idx})" title="Hủy" style="background:var(--gray-200);border:none;cursor:pointer;color:var(--gray-700);font-size:12px;font-weight:700;padding:4px 8px;border-radius:5px">✕</button>
          </span>
        </td>
        <td style="padding:8px; text-align:center; font-size:10px">${item.date}</td>
        <td style="padding:8px; text-align:right">${(item.dataSize / 1024).toFixed(1)} KB</td>
        <td style="padding:8px; text-align:center">${item.data ? (item.data.qltd || []).length : (item.recordCount ?? '—')}</td>
        <td style="padding:8px; text-align:center; white-space:nowrap">
          <button class="btn btn-sm btn-outline" onclick="archiveRestoreData(${idx})" title="${item.data ? 'Khôi phục' : 'Không khả dụng sau reload'}" ${item.data ? '' : 'style="opacity:.4;cursor:not-allowed"'}>🔄</button>
          <button class="btn btn-sm btn-outline" onclick="archiveDownloadData(${idx})" title="${item.data ? 'Tải xuống' : 'Không khả dụng sau reload'}" ${item.data ? '' : 'style="opacity:.4;cursor:not-allowed"'}>⬇️</button>
          <button class="btn btn-sm btn-red" onclick="archiveDeleteOneData(${idx})" title="Xóa">🗑️</button>
        </td>
      </tr>
    `).join('');

  // Reset select-all checkbox
  const chkAll = document.getElementById('data-chk-all');
  if (chkAll) chkAll.checked = false;
  archiveDataCheckChange();
}

// Render report archive list
function archiveRenderReportList() {
  const tbody = document.getElementById('archive-report-list');
  if (!tbody) return;

  tbody.innerHTML = _archiveReportList.length === 0 ?
    `<tr><td colspan="6" style="padding:20px; text-align:center; color:var(--gray-500)">Chưa có báo cáo lưu trữ</td></tr>` :
    _archiveReportList.map((item, idx) => `
      <tr id="rpt-row-${idx}" style="border-bottom:1px solid var(--gray-200); ${idx % 2 === 0 ? 'background:var(--gray-50)' : ''}">
        <td style="padding:8px; text-align:center; width:38px">
          <input type="checkbox" class="rpt-chk" data-idx="${idx}"
            onchange="archiveReportCheckChange()"
            style="width:14px;height:14px;cursor:pointer;accent-color:var(--green-accent)">
        </td>
        <td style="padding:8px; font-weight:600; color:var(--navy)">
          <span id="rpt-name-text-${idx}" style="display:inline-flex;align-items:center;gap:6px;flex-wrap:wrap">
            📊 <span>${escapeHtml(item.name)}</span>
            ${item.source === 'IPCAS Import' ? '<span style="font-size:9px;background:#dbeafe;color:#1d4ed8;padding:1px 6px;border-radius:3px;font-weight:700">IPCAS</span>' : ''}
            ${!item.reportData ? '<span style="font-size:9px;background:#fef3c7;color:#92400e;padding:1px 7px;border-radius:3px;font-weight:700;border:1px solid #d97706" title="reportData không có trong bộ nhớ — tải xuống để lưu lâu dài. Refresh trang sẽ mất dữ liệu nếu không có backup sessionStorage.">⚠ Chỉ meta</span>' : '<span style="font-size:9px;background:#dcfce7;color:#166534;padding:1px 7px;border-radius:3px;font-weight:700;border:1px solid #86efac" title="reportData đầy đủ trong bộ nhớ — Auto-fill hoạt động.">✅ Đầy đủ</span>'}
            <button onclick="archiveStartEdit('report',${idx})" title="Đổi tên" style="background:none;border:none;cursor:pointer;font-size:13px;padding:2px 4px;border-radius:4px;color:var(--gray-400);transition:color .15s" onmouseover="this.style.color='var(--green-main)'" onmouseout="this.style.color='var(--gray-400)'">✏️</button>
          </span>
          <span id="rpt-name-edit-${idx}" style="display:none;align-items:center;gap:5px">
            <input id="rpt-name-input-${idx}" type="text" value="${item.name.replace(/"/g,'&quot;')}"
              style="padding:4px 8px;border:1.5px solid var(--green-main);border-radius:6px;font-size:12px;font-family:inherit;font-weight:600;color:var(--navy);outline:none;min-width:200px;box-shadow:0 0 0 3px rgba(26,122,48,.1)"
              onkeydown="if(event.key==='Enter')archiveConfirmEdit('report',${idx});else if(event.key==='Escape')archiveCancelEdit('report',${idx})">
            <button onclick="archiveConfirmEdit('report',${idx})" title="Lưu" style="background:var(--green-main);border:none;cursor:pointer;color:#fff;font-size:12px;font-weight:700;padding:4px 8px;border-radius:5px">✅</button>
            <button onclick="archiveCancelEdit('report',${idx})" title="Hủy" style="background:var(--gray-200);border:none;cursor:pointer;color:var(--gray-700);font-size:12px;font-weight:700;padding:4px 8px;border-radius:5px">✕</button>
          </span>
        </td>
        <td style="padding:6px; text-align:center">
          <div style="display:flex;flex-direction:column;gap:3px;align-items:center">
            ${archiveTagChipHtml(item.tag, idx)}
            ${archiveTagSelectHtml(idx, item.tag)}
          </div>
        </td>
        <td style="padding:8px; text-align:center; font-size:10px; color:var(--gray-500)">${item.date}</td>
        <td style="padding:8px; text-align:center">${item.customers} KH / ${item.accounts} TK</td>
        <td style="padding:8px; text-align:center; white-space:nowrap">
          <button class="btn btn-sm btn-outline" onclick="archiveDownloadReport(${idx})" title="Tải xuống">⬇️</button>
          <button class="btn btn-sm btn-red" onclick="archiveDeleteOneReport(${idx})" title="Xóa">🗑️</button>
        </td>
      </tr>
    `).join('');

  // Reset select-all checkbox
  const chkAll = document.getElementById('rpt-chk-all');
  if (chkAll) chkAll.checked = false;
  archiveReportCheckChange();

  // Cập nhật banner mốc so sánh
  archiveRenderTagStatus();
}

/* ═══════════════════════════════════════════════════════════════
   📅 LƯU TRỮ HÀNG NGÀY — dùng lại snapshot Báo cáo đã có,
   không tạo kho lưu trữ riêng. Loại các ngày trùng mốc chính thức
   (năm/quý/tháng), trừ ngày trùng với dữ liệu hiện tại.
   ═══════════════════════════════════════════════════════════════ */

// Snapshot đã gắn mốc chính thức (năm/quý/tháng)?
function archiveIsMilestoneSnap(item) {
  return !!(item && item.tag && ['year_end', 'quarter', 'month'].includes(item.tag.kind));
}

// Ngày (dd/mm/yyyy) của 1 snapshot, ưu tiên timestamp
function archiveSnapDateStr(item) {
  if (item && item.timestamp) {
    const d = new Date(item.timestamp);
    return `${String(d.getDate()).padStart(2,'0')}/${String(d.getMonth()+1).padStart(2,'0')}/${d.getFullYear()}`;
  }
  const m = String((item && (item.name || item.date)) || '').match(/\b(\d{1,2})\/(\d{1,2})\/(\d{4})\b/);
  return m ? `${m[1].padStart(2,'0')}/${m[2].padStart(2,'0')}/${m[3]}` : '';
}

// Các ngày hiện đã có snapshot mốc chính thức
function archiveMilestoneDatesSet() {
  const s = new Set();
  _archiveReportList.forEach(item => { if (archiveIsMilestoneSnap(item)) s.add(archiveSnapDateStr(item)); });
  return s;
}

function archiveRenderDailyList() {
  const tbody = document.getElementById('archive-daily-list');
  if (!tbody) return;

  const todayStr = archiveSnapDateStr({ timestamp: Date.now() });
  const milestoneDates = archiveMilestoneDatesSet();

  const list = _archiveReportList
    .map((item, idx) => ({ item, idx, dateStr: archiveSnapDateStr(item) }))
    .filter(({ item, dateStr }) => {
      if (archiveIsMilestoneSnap(item)) return false;
      if (milestoneDates.has(dateStr) && dateStr !== todayStr) return false;
      return true;
    })
    .sort((a, b) => (b.item.timestamp || 0) - (a.item.timestamp || 0));

  // Gộp các bản trùng ngày (giữ bản mới nhất) — trừ ngày = hôm nay thì giữ tất cả
  const seenDates = new Set();
  const filtered = [];
  list.forEach(row => {
    if (row.dateStr === todayStr) { filtered.push(row); return; }
    if (seenDates.has(row.dateStr)) return;
    seenDates.add(row.dateStr);
    filtered.push(row);
  });

  tbody.innerHTML = filtered.length === 0
    ? `<tr><td colspan="4" style="padding:20px; text-align:center; color:var(--gray-500)">Chưa có snapshot hàng ngày phù hợp</td></tr>`
    : filtered.map(({ item, idx, dateStr }) => `
      <tr style="border-bottom:1px solid var(--gray-200)">
        <td style="padding:8px">📊 ${escapeHtml(item.name)}</td>
        <td style="padding:8px; text-align:center; font-size:10px">${dateStr}</td>
        <td style="padding:8px; text-align:center">
          ${dateStr === todayStr ? '<span style="font-size:9px;background:#dbeafe;color:#1d4ed8;padding:1px 7px;border-radius:3px;font-weight:700">Dữ liệu hiện tại</span>' : '<span style="font-size:9px;background:#f3f4f6;color:#374151;padding:1px 7px;border-radius:3px;font-weight:700">Hàng ngày</span>'}
        </td>
        <td style="padding:8px; text-align:center; white-space:nowrap">
          <button class="btn btn-sm btn-outline" onclick="archiveShowDailyDiff('snap-${idx}','current')">🔍 So với hiện tại</button>
        </td>
      </tr>`).join('');
}

// Tìm snapshot gần nhất với 1 ngày báo cáo do người dùng chọn
function archiveFindNearestDaily() {
  const inp = document.getElementById('daily-target-date');
  const resultEl = document.getElementById('daily-nearest-result');
  if (!inp || !inp.value) { if (resultEl) resultEl.innerHTML = '<p style="color:var(--orange);font-size:11px">Vui lòng chọn ngày báo cáo.</p>'; return; }
  const target = new Date(inp.value + 'T00:00:00').getTime();

  let best = null, bestIdx = -1, bestDiff = Infinity;
  _archiveReportList.forEach((item, idx) => {
    if (!item.timestamp) return;
    const diff = Math.abs(item.timestamp - target);
    if (diff < bestDiff) { bestDiff = diff; best = item; bestIdx = idx; }
  });

  if (!best) { resultEl.innerHTML = '<p style="color:var(--gray-500);font-size:11px">Không tìm thấy snapshot nào có timestamp hợp lệ.</p>'; return; }

  const days = Math.round(bestDiff / 86400000);
  resultEl.innerHTML = `
    <div style="background:var(--green-pale);border-left:3px solid var(--green-main);padding:10px 12px;border-radius:6px;font-size:11px">
      Gần nhất: <strong>${best.name}</strong> (${archiveSnapDateStr(best)}) — cách ngày chọn ${days} ngày.
      <button class="btn btn-sm btn-outline" style="margin-left:8px" onclick="archiveShowDailyDiff('snap-${bestIdx}','current')">🔍 So với hiện tại</button>
    </div>`;
}

// So sánh biến động số dư nợ theo từng khách hàng giữa 2 snapshot (mặc định: snapshot vs dữ liệu hiện tại)
function archiveShowDailyDiff(aVal, bVal) {
  const el = document.getElementById('daily-diff-result');
  if (!el) return;
  const A = archiveGetSnapByValue(aVal);
  const B = archiveGetSnapByValue(bVal);
  if (!A || !B) { el.innerHTML = '<p style="color:var(--orange);font-size:11px">Không tìm thấy snapshot để so sánh.</p>'; return; }

  const aRows = A.reportData || [];
  const bRows = B.reportData || [];
  const fmt = n => (typeof bckhFmtMoney === 'function') ? bckhFmtMoney(n) : Math.round(n).toLocaleString('vi-VN');

  const aByKH = {}, bByKH = {};
  aRows.forEach(r => { const cif = r[0]; if (!cif) return; aByKH[cif] = aByKH[cif] || { name: r[1], cb: r[12], total: 0 }; aByKH[cif].total += Number(r[11]) || 0; });
  bRows.forEach(r => { const cif = r[0]; if (!cif) return; bByKH[cif] = bByKH[cif] || { name: r[1], cb: r[12], total: 0 }; bByKH[cif].total += Number(r[11]) || 0; });

  const allCIFs = new Set([...Object.keys(aByKH), ...Object.keys(bByKH)]);
  const diffs = [...allCIFs].map(cif => {
    const a = aByKH[cif] ? aByKH[cif].total : 0, b = bByKH[cif] ? bByKH[cif].total : 0;
    const info = bByKH[cif] || aByKH[cif] || {};
    return { cif, name: info.name, cb: info.cb, a, b, delta: b - a };
  }).filter(d => d.delta !== 0)
    .sort((x, y) => Math.abs(y.delta) - Math.abs(x.delta))
    .slice(0, 30);

  if (diffs.length === 0) {
    el.innerHTML = `<p style="color:var(--gray-500);font-size:11px;padding:12px">Không có biến động số dư nợ giữa "${escapeHtml(A.name)}" và "${escapeHtml(B.name)}".</p>`;
    return;
  }

  el.innerHTML = `
    <div style="margin:10px 0 6px;font-size:12px;font-weight:700;color:var(--navy)">📊 Biến động số dư nợ: ${escapeHtml(A.name)} → ${escapeHtml(B.name)} (Top ${diffs.length})</div>
    <div style="border:1px solid var(--gray-200);border-radius:8px;overflow:hidden">
      <table style="width:100%;border-collapse:collapse;font-size:11px">
        <thead style="background:var(--navy);color:#fff"><tr>
          <th style="padding:6px 8px;text-align:left">Khách hàng</th>
          <th style="padding:6px 8px;text-align:left">CBTD</th>
          <th style="padding:6px 8px;text-align:right">Trước</th>
          <th style="padding:6px 8px;text-align:right">Sau</th>
          <th style="padding:6px 8px;text-align:right">Chênh lệch</th>
        </tr></thead>
        <tbody>
          ${diffs.map((d, i) => {
            const color = d.delta > 0 ? '#15803d' : '#b91c1c';
            return `<tr style="border-top:1px solid var(--gray-200);${i % 2 ? 'background:var(--gray-50)' : ''}">
              <td style="padding:5px 8px;font-weight:600;color:var(--navy)">${escapeHtml(d.name || '')}</td>
              <td style="padding:5px 8px;color:var(--gray-600)">${escapeHtml(d.cb || '')}</td>
              <td style="padding:5px 8px;text-align:right">${fmt(d.a)}</td>
              <td style="padding:5px 8px;text-align:right">${fmt(d.b)}</td>
              <td style="padding:5px 8px;text-align:right;color:${color};font-weight:700">${d.delta > 0 ? '+' : ''}${fmt(d.delta)}</td>
            </tr>`;
          }).join('')}
        </tbody>
      </table>
    </div>`;
}

// Restore data
function archiveRestoreData(idx) {
  if (idx < 0 || idx >= _archiveDataList.length) return;
  const item = _archiveDataList[idx];
  if (!item.data) {
    showToast('⚠️ Dữ liệu đầy đủ không còn trong bộ nhớ (đã tắt/mở lại). Vui lòng tải file JSON về và khôi phục thủ công.', 'gold');
    return;
  }
  if (!confirm('⚠️ Đây sẽ thay thế TOÀN BỘ dữ liệu hiện tại. Bạn chắc chắn?')) return;
  
  DATA = JSON.parse(JSON.stringify(item.data));
  saveData();
  location.reload();
}

// Download backup
function archiveDownloadBackup(item, type) {
  const json = JSON.stringify(item, null, 2);
  const blob = new Blob([json], { type: 'application/json' });
  const url = URL.createObjectURL(blob);
  const a = document.createElement('a');
  a.href = url;
  // ✅ PRO-38: Sanitize filename (browser không cho ký tự / : trong tên file)
  // Display name giữ "Data 25/04/2026 01:36", file thực tế "Data 25-04-2026 01-36.json"
  const safeFilename = (item.name || 'archive').replace(/[\/\\:*?"<>|]/g, '-');
  a.download = `${safeFilename}.json`;
  a.click();
  URL.revokeObjectURL(url);
}

function archiveDownloadData(idx) {
  if (idx < 0 || idx >= _archiveDataList.length) return;
  archiveDownloadBackup(_archiveDataList[idx], 'data');
}

function archiveDownloadReport(idx) {
  if (idx < 0 || idx >= _archiveReportList.length) return;
  archiveDownloadBackup(_archiveReportList[idx], 'report');
}

// Delete archive
function archiveDeleteData(idx) {
  if (idx < 0 || idx >= _archiveDataList.length) return;
  if (!confirm('Xóa vĩnh viễn file này?')) return;
  
  _archiveDataList.splice(idx, 1);
  archiveSaveToStorage();
  archiveRenderDataList();
}

function archiveDeleteReport(idx) {
  if (idx < 0 || idx >= _archiveReportList.length) return;
  if (!confirm('Xóa vĩnh viễn file này?')) return;
  
  _archiveReportList.splice(idx, 1);
  archiveSaveToStorage();
  archiveRenderReportList();
}

/* ─────────────────────────────────────────────────────────────
   INLINE EDIT TÊN FILE / TÊN BÁO CÁO
   ───────────────────────────────────────────────────────────── */
function archiveStartEdit(type, idx) {
  const prefix = type === 'data' ? 'data' : 'rpt';
  const textEl = document.getElementById(`${prefix}-name-text-${idx}`);
  const editEl = document.getElementById(`${prefix}-name-edit-${idx}`);
  const inputEl = document.getElementById(`${prefix}-name-input-${idx}`);
  if (!textEl || !editEl || !inputEl) return;
  textEl.style.display = 'none';
  editEl.style.display = 'inline-flex';
  inputEl.focus();
  inputEl.select();
}

function archiveConfirmEdit(type, idx) {
  const prefix = type === 'data' ? 'data' : 'rpt';
  const list = type === 'data' ? _archiveDataList : _archiveReportList;
  const inputEl = document.getElementById(`${prefix}-name-input-${idx}`);
  if (!inputEl || idx < 0 || idx >= list.length) return;
  const newName = inputEl.value.trim();
  if (!newName) { showToast('⚠️ Tên không được để trống', 'gold'); inputEl.focus(); return; }
  list[idx].name = newName;
  archiveSaveToStorage();
  if (type === 'data') archiveRenderDataList();
  else archiveRenderReportList();
  showToast(`✅ Đã đổi tên thành: ${newName}`, 'green');
}

function archiveCancelEdit(type, idx) {
  const prefix = type === 'data' ? 'data' : 'rpt';
  const textEl = document.getElementById(`${prefix}-name-text-${idx}`);
  const editEl = document.getElementById(`${prefix}-name-edit-${idx}`);
  if (!textEl || !editEl) return;
  editEl.style.display = 'none';
  textEl.style.display = 'inline-flex';
}

/* ─────────────────────────────────────────────────────────────
   HỆ THỐNG XÓA BẢN LƯU TRỮ BÁO CÁO — NÂNG CẤP
   ───────────────────────────────────────────────────────────── */

// Trạng thái pending xóa: 'one' | 'selected' | 'all'
let _archiveDeleteMode = null;
let _archiveDeleteIdx  = null;
let _archiveDeleteTargetType = 'report'; // 'report' | 'data'

/* Cập nhật nút "Xóa đã chọn" + badge số lượng */
/* ═══════════════════════════════════════════════════════════════
   DATA ARCHIVE — CHECKBOX & BULK DELETE (giống Report Archive)
   ═══════════════════════════════════════════════════════════════ */
function archiveDataCheckChange() {
  const chks  = document.querySelectorAll('.data-chk:checked');
  const total = document.querySelectorAll('.data-chk').length;
  const count = chks.length;

  const btnDel = document.getElementById('btn-delete-selected-data');
  const cntEl  = document.getElementById('data-sel-count');
  if (btnDel) btnDel.style.display = count > 0 ? 'inline-flex' : 'none';
  if (cntEl)  cntEl.textContent = count;

  const allChk = document.getElementById('data-chk-all');
  if (allChk) {
    allChk.checked       = count > 0 && count === total;
    allChk.indeterminate = count > 0 && count < total;
  }

  document.querySelectorAll('.data-chk').forEach(c => {
    const row = c.closest('tr');
    if (row) row.style.background = c.checked ? '#fef9c3' : '';
  });
}

function archiveToggleAllData(checked) {
  document.querySelectorAll('.data-chk').forEach(c => { c.checked = checked; });
  archiveDataCheckChange();
}

/* Xóa 1 dòng — mở modal xác nhận */
function archiveDeleteOneData(idx) {
  if (idx < 0 || idx >= _archiveDataList.length) return;
  _archiveDeleteTargetType = 'data';
  _archiveDeleteMode = 'one';
  _archiveDeleteIdx  = idx;
  const item = _archiveDataList[idx];

  document.getElementById('archive-delete-msg').innerHTML =
    `Bạn có chắc muốn xóa bản lưu trữ này?<br>
     <span style="color:var(--red);font-size:13px">💾 ${escapeHtml(item.name)}</span>`;

  document.getElementById('archive-delete-preview').style.display = 'none';
  document.getElementById('modal-archive-delete').style.display = 'flex';
}

/* Xóa các dòng đã chọn — mở modal xác nhận */
function archiveDeleteSelectedData() {
  const idxs = [...document.querySelectorAll('.data-chk:checked')].map(c => Number(c.dataset.idx));
  if (idxs.length === 0) { showToast('Chưa chọn bản lưu trữ nào', 'gold'); return; }

  _archiveDeleteTargetType = 'data';
  _archiveDeleteMode = 'selected';
  _archiveDeleteIdx  = idxs;

  document.getElementById('archive-delete-msg').innerHTML =
    `Xóa <strong style="color:var(--red)">${idxs.length}</strong> bản lưu trữ dữ liệu đã chọn?`;

  const previewBody = document.getElementById('archive-delete-preview-list');
  previewBody.innerHTML = idxs.map(i => {
    const it = _archiveDataList[i];
    return `<tr style="border-top:1px solid var(--gray-200)">
      <td style="padding:5px 10px">💾 ${escapeHtml(it.name)}</td>
      <td style="padding:5px 10px;text-align:center;font-size:10px;color:var(--gray-500)">${it.date}</td>
    </tr>`;
  }).join('');

  document.getElementById('archive-delete-preview').style.display = 'block';
  document.getElementById('modal-archive-delete').style.display = 'flex';
}

/* Xóa tất cả dữ liệu — mở modal xác nhận */
function archiveDeleteAllData() {
  if (_archiveDataList.length === 0) { showToast('Chưa có bản lưu trữ nào', 'gold'); return; }

  _archiveDeleteTargetType = 'data';
  _archiveDeleteMode = 'all';
  _archiveDeleteIdx  = null;

  document.getElementById('archive-delete-msg').innerHTML =
    `Xóa <strong style="color:var(--red)">toàn bộ ${_archiveDataList.length} bản lưu trữ dữ liệu</strong>?`;

  const previewBody = document.getElementById('archive-delete-preview-list');
  previewBody.innerHTML = _archiveDataList.map(it => `
    <tr style="border-top:1px solid var(--gray-200)">
      <td style="padding:5px 10px">💾 ${escapeHtml(it.name)}</td>
      <td style="padding:5px 10px;text-align:center;font-size:10px;color:var(--gray-500)">${it.date}</td>
    </tr>`).join('');

  document.getElementById('archive-delete-preview').style.display = _archiveDataList.length > 0 ? 'block' : 'none';
  document.getElementById('modal-archive-delete').style.display = 'flex';
}

function archiveReportCheckChange() {
  const chks  = document.querySelectorAll('.rpt-chk:checked');
  const total = document.querySelectorAll('.rpt-chk').length;
  const count = chks.length;

  const btnDel = document.getElementById('btn-delete-selected-reports');
  const cntEl  = document.getElementById('rpt-sel-count');
  if (btnDel) btnDel.style.display = count > 0 ? 'inline-flex' : 'none';
  if (cntEl)  cntEl.textContent = count;

  // Đồng bộ select-all checkbox (indeterminate nếu chọn một phần)
  const allChk = document.getElementById('rpt-chk-all');
  if (allChk) {
    allChk.checked       = count > 0 && count === total;
    allChk.indeterminate = count > 0 && count < total;
  }

  // Highlight dòng đã chọn
  document.querySelectorAll('.rpt-chk').forEach(c => {
    const row = c.closest('tr');
    if (row) row.style.background = c.checked ? '#fef9c3' : '';
  });
}

/* Chọn / bỏ chọn tất cả */
function archiveToggleAllReports(checked) {
  document.querySelectorAll('.rpt-chk').forEach(c => { c.checked = checked; });
  archiveReportCheckChange();
}

/* Xóa 1 dòng — mở modal */
function archiveDeleteOneReport(idx) {
  if (idx < 0 || idx >= _archiveReportList.length) return;
  _archiveDeleteTargetType = 'report';
  _archiveDeleteMode = 'one';
  _archiveDeleteIdx  = idx;
  const item = _archiveReportList[idx];

  document.getElementById('archive-delete-msg').innerHTML =
    `Bạn có chắc muốn xóa bản lưu trữ này?<br>
     <span style="color:var(--red);font-size:13px">📊 ${escapeHtml(item.name)}</span>`;

  const previewEl = document.getElementById('archive-delete-preview');
  previewEl.style.display = 'none';

  document.getElementById('modal-archive-delete').style.display = 'flex';
}

/* Xóa các dòng đã chọn — mở modal */
function archiveDeleteSelectedReports() {
  const idxs = [...document.querySelectorAll('.rpt-chk:checked')].map(c => Number(c.dataset.idx));
  if (idxs.length === 0) { showToast('Chưa chọn bản lưu trữ nào', 'gold'); return; }

  _archiveDeleteTargetType = 'report';
  _archiveDeleteMode = 'selected';
  _archiveDeleteIdx  = idxs;

  document.getElementById('archive-delete-msg').innerHTML =
    `Xóa <strong style="color:var(--red)">${idxs.length}</strong> bản lưu trữ đã chọn?`;

  const previewBody = document.getElementById('archive-delete-preview-list');
  previewBody.innerHTML = idxs.map(i => {
    const it = _archiveReportList[i];
    return `<tr style="border-top:1px solid var(--gray-200)">
      <td style="padding:5px 10px">📊 ${escapeHtml(it.name)}</td>
      <td style="padding:5px 10px;text-align:center;font-size:10px;color:var(--gray-500)">${it.date}</td>
    </tr>`;
  }).join('');

  const previewEl = document.getElementById('archive-delete-preview');
  previewEl.style.display = 'block';

  document.getElementById('modal-archive-delete').style.display = 'flex';
}

/* Xóa tất cả — mở modal */
function archiveDeleteAllReports() {
  if (_archiveReportList.length === 0) { showToast('Chưa có bản lưu trữ nào', 'gold'); return; }

  _archiveDeleteTargetType = 'report';
  _archiveDeleteMode = 'all';
  _archiveDeleteIdx  = null;

  document.getElementById('archive-delete-msg').innerHTML =
    `Xóa <strong style="color:var(--red)">toàn bộ ${_archiveReportList.length} bản lưu trữ</strong>?`;

  const previewBody = document.getElementById('archive-delete-preview-list');
  previewBody.innerHTML = _archiveReportList.map(it => `
    <tr style="border-top:1px solid var(--gray-200)">
      <td style="padding:5px 10px">📊 ${escapeHtml(it.name)}</td>
      <td style="padding:5px 10px;text-align:center;font-size:10px;color:var(--gray-500)">${it.date}</td>
    </tr>`).join('');

  const previewEl = document.getElementById('archive-delete-preview');
  previewEl.style.display = _archiveReportList.length > 0 ? 'block' : 'none';

  document.getElementById('modal-archive-delete').style.display = 'flex';
}

/* Thực thi xóa sau khi user xác nhận */
function archiveConfirmDelete() {
  const isData = (_archiveDeleteTargetType === 'data');
  const list   = isData ? _archiveDataList : _archiveReportList;

  // Thu thập IDB keys trước khi xóa
  const idbKeysToDelete = [];
  if (!isData) {
    // Report: xóa rpt_ keys
    if (_archiveDeleteMode === 'one' && list[_archiveDeleteIdx]) {
      idbKeysToDelete.push(_idbKey(list[_archiveDeleteIdx]));
    } else if (_archiveDeleteMode === 'selected') {
      _archiveDeleteIdx.forEach(i => { if (list[i]) idbKeysToDelete.push(_idbKey(list[i])); });
    } else if (_archiveDeleteMode === 'all') {
      list.forEach(item => idbKeysToDelete.push(_idbKey(item)));
    }
  } else {
    // Data: xóa dat_ keys — FIX: trước đây bị bỏ qua, gây orphan data tồn đọng trong IDB
    if (_archiveDeleteMode === 'one' && list[_archiveDeleteIdx]) {
      idbKeysToDelete.push(_idbDataKey(list[_archiveDeleteIdx]));
    } else if (_archiveDeleteMode === 'selected') {
      _archiveDeleteIdx.forEach(i => { if (list[i]) idbKeysToDelete.push(_idbDataKey(list[i])); });
    } else if (_archiveDeleteMode === 'all') {
      list.forEach(item => idbKeysToDelete.push(_idbDataKey(item)));
    }
  }

  if (_archiveDeleteMode === 'one') {
    list.splice(_archiveDeleteIdx, 1);
    showToast('🗑️ Đã xóa bản lưu trữ', 'green');
  } else if (_archiveDeleteMode === 'selected') {
    const sorted = [..._archiveDeleteIdx].sort((a, b) => b - a);
    sorted.forEach(i => list.splice(i, 1));
    showToast(`🗑️ Đã xóa ${sorted.length} bản lưu trữ`, 'green');
  } else if (_archiveDeleteMode === 'all') {
    if (isData) { _archiveDataList = []; showToast('🗑️ Đã xóa toàn bộ lưu trữ dữ liệu', 'green'); }
    else        { _archiveReportList = []; window._archiveReportList = _archiveReportList; showToast('🗑️ Đã xóa toàn bộ lưu trữ báo cáo', 'green'); }
  }

  // Xóa reportData khỏi IDB (fire-and-forget)
  idbKeysToDelete.forEach(k => _archIdbDelete(k).catch(() => {}));

  archiveSaveToStorage();
  if (isData) archiveRenderDataList(); else archiveRenderReportList();
  closeArchiveDeleteModal();
}

function closeArchiveDeleteModal() {
  document.getElementById('modal-archive-delete').style.display = 'none';
  _archiveDeleteMode = null;
  _archiveDeleteIdx  = null;
}

// Storage persistence
/* ═══════════════════════════════════════════════════════════════
   💾 IndexedDB WRAPPER — Lưu trữ reportData bền vững
   Thay thế sessionStorage (chỉ tồn tại trong 1 phiên tab).
   IndexedDB tồn tại qua cả khi đóng/mở lại trình duyệt.
   ═══════════════════════════════════════════════════════════════ */
const _IDB_NAME    = 'TWIN_Archive_v1';
const _IDB_STORE   = 'reportData';
const _IDB_VERSION = 1;

function _idbOpen() {
  return new Promise((resolve, reject) => {
    if (!window.indexedDB) { reject(new Error('IndexedDB not supported')); return; }
    const req = indexedDB.open(_IDB_NAME, _IDB_VERSION);
    req.onupgradeneeded = e => {
      const db = e.target.result;
      if (!db.objectStoreNames.contains(_IDB_STORE)) {
        db.createObjectStore(_IDB_STORE); // key = external string key
      }
    };
    req.onsuccess  = e => resolve(e.target.result);
    req.onerror    = e => reject(e.target.error);
    req.onblocked  = () => reject(new Error('IDB blocked'));
  });
}

function _archIdbPut(key, value) {
  return _idbOpen().then(db => new Promise((resolve, reject) => {
    const tx  = db.transaction(_IDB_STORE, 'readwrite');
    const req = tx.objectStore(_IDB_STORE).put(value, key);
    req.onsuccess = () => { db.close(); resolve(); };
    req.onerror   = e  => { db.close(); reject(e.target.error); };
  }));
}

function _archIdbGet(key) {
  return _idbOpen().then(db => new Promise((resolve, reject) => {
    const tx  = db.transaction(_IDB_STORE, 'readonly');
    const req = tx.objectStore(_IDB_STORE).get(key);
    req.onsuccess = e  => { db.close(); resolve(e.target.result); };
    req.onerror   = e  => { db.close(); reject(e.target.error); };
  }));
}

function _archIdbDelete(key) {
  return _idbOpen().then(db => new Promise((resolve, reject) => {
    const tx  = db.transaction(_IDB_STORE, 'readwrite');
    const req = tx.objectStore(_IDB_STORE).delete(key);
    req.onsuccess = () => { db.close(); resolve(); };
    req.onerror   = e  => { db.close(); reject(e.target.error); };
  }));
}

function _archIdbGetAllKeys() {
  return _idbOpen().then(db => new Promise((resolve, reject) => {
    const tx  = db.transaction(_IDB_STORE, 'readonly');
    const req = tx.objectStore(_IDB_STORE).getAllKeys();
    req.onsuccess = e  => { db.close(); resolve(e.target.result || []); };
    req.onerror   = e  => { db.close(); reject(e.target.error); };
  }));
}

/* Tạo key ổn định cho 1 snapshot dựa trên timestamp lúc lưu */
function _idbKey(item)     { return `rpt_${item.timestamp || item.name}`; }
function _idbDataKey(item) { return `dat_${item.timestamp || item.name}`; }

/* Lưu item.data của TẤT CẢ data-archive vào IDB */
async function idbSaveAllDataItems() {
  const validKeys = new Set();
  for (const item of _archiveDataList) {
    const k = _idbDataKey(item);
    validKeys.add(k);
    if (item.data) {
      try { await _archIdbPut(k, item.data); } catch(e) { console.warn('[IDB] dat put:', e); }
    }
  }
  // Dọn orphan keys dat_*
  try {
    const allKeys = await _archIdbGetAllKeys();
    for (const k of allKeys) {
      if (k.startsWith('dat_') && !validKeys.has(k)) await _archIdbDelete(k).catch(()=>{});
    }
  } catch(e) {}
}

/* Khôi phục item.data từ IDB vào _archiveDataList */
async function idbRestoreAllDataItems() {
  let restored = 0;
  for (const item of _archiveDataList) {
    if (item.data && typeof item.data === 'object') continue;
    try {
      const d = await _archIdbGet(_idbDataKey(item));
      if (d && typeof d === 'object') { item.data = d; restored++; }
    } catch(e) {}
  }
  if (restored > 0) {
    (0)&&console.log(`[IDB] ✅ Khôi phục data cho ${restored}/${_archiveDataList.length} data-archive`);
    archiveRenderDataList();
  }
  return restored;
}

/* Lưu reportData của TẤT CẢ snapshot vào IDB — gọi sau mỗi lần archive */
async function idbSaveAllReportData() {
  const validKeys = new Set();
  for (const item of _archiveReportList) {
    const k = _idbKey(item);
    validKeys.add(k);
    if (item.reportData) {
      try { await _archIdbPut(k, item.reportData); } catch(e) { console.warn('[IDB] put failed:', e); }
    }
  }
  // Dọn dẹp orphan keys (snapshot đã xóa)
  try {
    const allKeys = await _archIdbGetAllKeys();
    for (const k of allKeys) {
      if (!validKeys.has(k)) await _archIdbDelete(k).catch(() => {});
    }
  } catch(e) {}
}

/* Khôi phục reportData từ IDB vào _archiveReportList sau khi load metadata */
async function idbRestoreAllReportData() {
  let restored = 0;
  for (const item of _archiveReportList) {
    if (item.reportData && Array.isArray(item.reportData)) continue; // đã có
    try {
      const data = await _archIdbGet(_idbKey(item));
      if (Array.isArray(data) && data.length > 0) {
        item.reportData = data;
        restored++;
      }
    } catch(e) {}
  }
  if (restored > 0) {
    (0)&&console.log(`[IDB] ✅ Khôi phục reportData cho ${restored}/${_archiveReportList.length} snapshot`);
    archiveRenderReportList(); // cập nhật badge ✅/⚠
  }
  return restored;
}

function archiveSaveToStorage() {
  // localStorage: metadata only (không có reportData — tránh quota 5MB)
  try {
    const dataMeta   = _archiveDataList.map(({ data, ...rest }) => rest);
    const reportMeta = _archiveReportList.map(({ reportData, ...rest }) => rest);
    localStorage.setItem('_archiveDataList',   JSON.stringify(dataMeta));
    localStorage.setItem('_archiveReportList', JSON.stringify(reportMeta));
  } catch (e) {
    console.warn('⚠️ LocalStorage save failed:', e);
  }
  // IndexedDB: toàn bộ reportData VÀ data — bền vững, không giới hạn dung lượng
  idbSaveAllReportData().catch(e => console.warn('[IDB] saveReports failed:', e));
  idbSaveAllDataItems().catch(e => console.warn('[IDB] saveDataItems failed:', e));
}

function archiveLoadFromStorage() {
  try {
    _archiveDataList   = JSON.parse(localStorage.getItem('_archiveDataList')   || '[]');
    _archiveReportList = JSON.parse(localStorage.getItem('_archiveReportList') || '[]');
    window._archiveReportList = _archiveReportList;
    // 🚀 Nếu archive trống → nạp _PRE_SNAPS vào bộ nhớ ngay lập tức (đồng bộ)
    if (_archiveReportList.length === 0 && window._PRE_SNAPS && window._PRE_SNAPS.length > 0) {
      window._PRE_SNAPS.forEach(function(s) {
        _archiveReportList.push(Object.assign({}, s.meta, {reportData: s.rd}));
      });
      var metaOnly = _archiveReportList.map(function(r){var m=Object.assign({},r);delete m.reportData;return m;});
      try{localStorage.setItem('_archiveReportList',JSON.stringify(metaOnly));}catch(e){}
      if (typeof idbSaveAllReportData === 'function') {
        idbSaveAllReportData().catch(function(e){console.warn('[PRE_SNAPS] IDB:',e);});
      }
      (0)&&console.log('[PRE_SNAPS] ✅ Loaded',_archiveReportList.length,'snapshots into archive');
      window._PRE_SNAPS = null;
    }

    // ✅ Migration 1: Đổi tên dd.mm.yyyy → dd/mm/yyyy
    const normDotDate = s => s ? s.replace(/\b(\d{1,2})\.(\d{1,2})\.(\d{4})\b/g, (_, d, m, y) =>
      `${d.padStart(2,'0')}/${m.padStart(2,'0')}/${y}`) : s;
    let migrated = false;
    _archiveDataList.forEach(item => {
      const fixed = normDotDate(item.name);
      if (fixed !== item.name) { item.name = fixed; migrated = true; }
    });
    _archiveReportList.forEach(item => {
      const fixed = normDotDate(item.name);
      if (fixed !== item.name) { item.name = fixed; migrated = true; }
    });

    // ✅ Migration 2: kind:'year' → 'year_end'
    _archiveReportList.forEach(item => {
      if (item.tag && item.tag.kind === 'year') {
        item.tag = { kind: 'year_end', year: item.tag.year - 1 };
        migrated = true;
      }
    });

    // ✅ Migration 3: Auto-detect tag cho snapshot chưa có tag
    _archiveReportList.forEach(item => {
      if (item.tag !== undefined) return;
      let detected = null;
      const m = String(item.name || '').match(/\b(\d{1,2})\/(\d{1,2})\/(\d{4})\b/);
      if (m) {
        detected = archiveDetectTag(`${m[1].padStart(2,'0')}/${m[2].padStart(2,'0')}/${m[3]}`, null);
      }
      if (!detected && item.timestamp) {
        const t = archiveDetectTag(null, new Date(item.timestamp));
        if (t && t.kind !== 'other') detected = t;
      }
      item.tag = detected || null;
      migrated = true;
    });

    // Lưu lại nếu có migration (KHÔNG gọi idbSaveAllReportData ở đây vì reportData chưa load)
    if (migrated) {
      try {
        const dataMeta   = _archiveDataList.map(({ data, ...rest }) => rest);
        const reportMeta = _archiveReportList.map(({ reportData, ...rest }) => rest);
        localStorage.setItem('_archiveDataList',   JSON.stringify(dataMeta));
        localStorage.setItem('_archiveReportList', JSON.stringify(reportMeta));
      } catch(e) {}
    }

    // ⚡ Khôi phục reportData từ IndexedDB (async — không block UI)
    idbRestoreAllReportData().catch(e => console.warn('[IDB] restore reports failed:', e));
    // ⚡ Khôi phục data từ IndexedDB — FIX: trước đây bị bỏ quên, gây mất data khi reload
    idbRestoreAllDataItems().catch(e => console.warn('[IDB] restore data failed:', e));

  } catch (e) {
    console.warn('⚠️ Failed to load archives:', e);
    _archiveDataList   = [];
    _archiveReportList = [];
    window._archiveReportList = _archiveReportList;
  }
}

// Stub functions for UI buttons
function archiveExportData() {
  if (_archiveDataList.length === 0) { alert('Chưa có dữ liệu lưu trữ'); return; }
  alert('Chọn file từ danh sách ở trên để tải về');
}

function archiveImportData() {
  alert('Tính năng khôi phục sẽ được thêm vào phiên bản tiếp theo');
}

function archiveExportReport() {
  if (_archiveReportList.length === 0) { alert('Chưa có báo cáo lưu trữ'); return; }
  alert('Chọn file từ danh sách ở trên để tải về');
}

/* ═══════════════════════════════════════════════════════════════════════
   📊 SO SÁNH 2 SNAPSHOT TỰ CHỌN
   ───────────────────────────────────────────────────────────────────────
   Mở modal cho user chọn 2 snapshot (A=cũ, B=mới hoặc DATA hiện tại)
   → render bảng so sánh chi tiết theo CBTD và phòng.
   ═══════════════════════════════════════════════════════════════════════ */
function archiveComparisons() {
  if (_archiveReportList.length < 1) {
    alert('Cần có ít nhất 1 snapshot trong Lưu trữ Báo cáo để so sánh.\nVào QLTD → Archive Report để tạo snapshot.');
    return;
  }
  archiveOpenCompareModal();
}

function archiveOpenCompareModal() {
  let modal = document.getElementById('modal-archive-compare');
  if (!modal) {
    modal = document.createElement('div');
    modal.className = 'modal-overlay';
    modal.id = 'modal-archive-compare';
    modal.style.display = 'none';
    modal.onclick = (e) => { if (e.target === modal) archiveCloseCompareModal(); };
    modal.innerHTML = `
      <div class="modal" style="max-width:1100px;max-height:92vh">
        <div class="modal-header" style="background:linear-gradient(135deg,#1e40af,#3b82f6)">
          <h2 style="color:#fff">📊 So sánh 2 snapshot báo cáo</h2>
          <button class="modal-close" onclick="archiveCloseCompareModal()" style="color:#fff;opacity:.9">✕</button>
        </div>
        <div class="modal-body" style="padding:0;max-height:calc(92vh - 70px);overflow-y:auto">
          <div style="padding:14px 18px;background:#eef5ff;border-bottom:1px solid #c7d8ed;display:flex;gap:12px;flex-wrap:wrap;align-items:end">
            <div style="flex:1;min-width:240px">
              <label style="font-size:11px;font-weight:700;color:#1e40af;display:block;margin-bottom:4px">📌 Snapshot A (mốc cũ)</label>
              <select id="cmp-snap-a" onchange="archiveRenderCompareResult()" style="width:100%;padding:7px 10px;border:1.5px solid #93c5fd;border-radius:6px;font-size:12px;background:#fff"></select>
            </div>
            <div style="font-size:18px;color:#1e40af;font-weight:700;margin:0 4px;align-self:center;padding-bottom:4px">vs</div>
            <div style="flex:1;min-width:240px">
              <label style="font-size:11px;font-weight:700;color:#1e40af;display:block;margin-bottom:4px">📌 Snapshot B (mốc mới)</label>
              <select id="cmp-snap-b" onchange="archiveRenderCompareResult()" style="width:100%;padding:7px 10px;border:1.5px solid #93c5fd;border-radius:6px;font-size:12px;background:#fff"></select>
            </div>
            <button class="btn btn-blue btn-sm" onclick="archiveSwapSnapshots()" title="Đổi vị trí A và B">🔄 Hoán đổi</button>
          </div>
          <div id="cmp-result" style="padding:14px 18px"></div>
        </div>
      </div>`;
    document.body.appendChild(modal);
  }

  // Populate dropdowns
  const optionsHtml = (selectedIdx) => {
    let opts = '';
    _archiveReportList.forEach((s, i) => {
      const tagLbl = (typeof archiveTagLabel === 'function') ? archiveTagLabel(s.tag) : '';
      opts += `<option value="snap-${i}" ${selectedIdx === `snap-${i}` ? 'selected' : ''}>${escapeHtml(s.name)} ${tagLbl ? '— ' + tagLbl : ''}</option>`;
    });
    opts += `<option value="current" ${selectedIdx === 'current' ? 'selected' : ''}>📊 DATA HIỆN TẠI (DATA.qltd)</option>`;
    return opts;
  };

  // Default: A = oldest snapshot, B = current data
  const aSel = document.getElementById('cmp-snap-a');
  const bSel = document.getElementById('cmp-snap-b');
  aSel.innerHTML = optionsHtml('snap-0');
  bSel.innerHTML = optionsHtml('current');

  modal.style.display = 'flex';
  archiveRenderCompareResult();
}

function archiveCloseCompareModal() {
  const m = document.getElementById('modal-archive-compare');
  if (m) m.style.display = 'none';
}

function archiveSwapSnapshots() {
  const a = document.getElementById('cmp-snap-a');
  const b = document.getElementById('cmp-snap-b');
  if (!a || !b) return;
  const tmp = a.value;
  a.value = b.value;
  b.value = tmp;
  archiveRenderCompareResult();
}

function archiveGetSnapByValue(val) {
  if (val === 'current') {
    return {
      name: '📊 DATA hiện tại',
      date: new Date().toLocaleString('vi-VN'),
      reportData: DATA?.qltd || [],
      _isCurrent: true
    };
  }
  const m = String(val).match(/^snap-(\d+)$/);
  if (!m) return null;
  return _archiveReportList[+m[1]] || null;
}

function archiveRenderCompareResult() {
  const el = document.getElementById('cmp-result');
  if (!el) return;
  const aVal = document.getElementById('cmp-snap-a')?.value;
  const bVal = document.getElementById('cmp-snap-b')?.value;
  const A = archiveGetSnapByValue(aVal);
  const B = archiveGetSnapByValue(bVal);
  if (!A || !B) { el.innerHTML = '<p style="color:var(--gray-500);text-align:center;padding:30px">Chọn 2 snapshot để so sánh</p>'; return; }
  if (aVal === bVal) {
    el.innerHTML = '<p style="color:var(--orange);text-align:center;padding:30px">⚠ Hai snapshot trùng nhau. Chọn 2 mốc khác nhau.</p>';
    return;
  }

  const aRows = A.reportData || [];
  const bRows = B.reportData || [];

  // Tổng quan
  const sumDN = rows => rows.reduce((s, r) => s + (Number(r[11]) || 0), 0);
  const countKH = rows => new Set(rows.map(r => r[0]).filter(Boolean)).size;
  const fnNH  = (typeof isNganHan  === 'function') ? isNganHan  : v => /ngắn|thấu/i.test(v||'');
  const fnTDH = (typeof isTrungHan === 'function') ? isTrungHan : v => /trung|dài/i.test(v||'');
  const sumByType = (rows, fn) => rows.filter(r => fn(r[13])).reduce((s, r) => s + (Number(r[11]) || 0), 0);

  const aDN = sumDN(aRows), bDN = sumDN(bRows);
  const aKH = countKH(aRows), bKH = countKH(bRows);
  const aNH = sumByType(aRows, fnNH), bNH = sumByType(bRows, fnNH);
  const aTDH = sumByType(aRows, fnTDH), bTDH = sumByType(bRows, fnTDH);

  const fmt = n => (typeof bckhFmtMoney === 'function') ? bckhFmtMoney(n) : Math.round(n).toLocaleString('vi-VN');
  const fmtSign = (delta, base) => {
    const pct = base ? (delta / base) * 100 : 0;
    const sign = delta > 0 ? '+' : (delta < 0 ? '−' : '');
    const color = delta > 0 ? '#15803d' : (delta < 0 ? '#b91c1c' : '#6b7280');
    const arrow = delta > 0 ? 'Tăng' : (delta < 0 ? 'Giảm' : '─');
    return `<span style="color:${color};font-weight:700">${arrow} ${sign}${fmt(Math.abs(delta))}${base ? ` (${pct >= 0 ? '+' : ''}${pct.toFixed(1)}%)` : ''}</span>`;
  };

  // Stat cards
  const statRow = `
    <div style="display:grid;grid-template-columns:repeat(auto-fit,minmax(220px,1fr));gap:10px;margin-bottom:14px">
      ${[
        ['💰 Tổng dư nợ', aDN, bDN, fmt],
        ['📊 Dư nợ ngắn hạn', aNH, bNH, fmt],
        ['🏠 Dư nợ trung-dài hạn', aTDH, bTDH, fmt],
        ['👥 Số khách hàng', aKH, bKH, n => Math.round(n).toLocaleString('vi-VN')]
      ].map(([lbl, av, bv, f]) => `
        <div style="background:#fff;border:1px solid var(--gray-200);border-radius:8px;padding:10px 12px">
          <div style="font-size:10px;font-weight:700;color:var(--gray-500);text-transform:uppercase;letter-spacing:.4px;margin-bottom:4px">${lbl}</div>
          <div style="display:flex;justify-content:space-between;align-items:baseline;gap:10px">
            <div><div style="font-size:9px;color:var(--gray-400)">A</div><div style="font-weight:700;color:var(--navy)">${f(av)}</div></div>
            <div style="font-size:14px;color:var(--gray-300)">→</div>
            <div style="text-align:right"><div style="font-size:9px;color:var(--gray-400)">B</div><div style="font-weight:700;color:var(--navy)">${f(bv)}</div></div>
          </div>
          <div style="font-size:11px;text-align:center;margin-top:6px;border-top:1px dashed var(--gray-200);padding-top:5px">
            ${fmtSign(bv - av, av)}
          </div>
        </div>`).join('')}
    </div>`;

  // CBTD breakdown
  const aByCB = {}, bByCB = {};
  for (const r of aRows) {
    const cb = String(r[12] || '').trim() || '(N/A)';
    aByCB[cb] = (aByCB[cb] || 0) + (Number(r[11]) || 0);
  }
  for (const r of bRows) {
    const cb = String(r[12] || '').trim() || '(N/A)';
    bByCB[cb] = (bByCB[cb] || 0) + (Number(r[11]) || 0);
  }
  const allCBs = [...new Set([...Object.keys(aByCB), ...Object.keys(bByCB)])]
    .map(name => ({ name, a: aByCB[name] || 0, b: bByCB[name] || 0, delta: (bByCB[name] || 0) - (aByCB[name] || 0) }))
    .sort((x, y) => Math.abs(y.delta) - Math.abs(x.delta));

  const cbRows = allCBs.map((x, i) => {
    const pct = x.a ? (x.delta / x.a) * 100 : 0;
    const color = x.delta > 0 ? '#15803d' : (x.delta < 0 ? '#b91c1c' : '#6b7280');
    return `
      <tr style="border-top:1px solid var(--gray-200);${i % 2 === 0 ? '' : 'background:var(--gray-50)'}">
        <td style="padding:5px 8px;color:var(--gray-500)">${i + 1}</td>
        <td style="padding:5px 8px;font-weight:600;color:var(--navy)">${escapeHtml(x.name)}</td>
        <td style="padding:5px 8px;text-align:right;color:var(--gray-700)">${fmt(x.a)}</td>
        <td style="padding:5px 8px;text-align:right;color:var(--gray-700)">${fmt(x.b)}</td>
        <td style="padding:5px 8px;text-align:right;color:${color};font-weight:700">${x.delta > 0 ? '+' : ''}${fmt(x.delta)}</td>
        <td style="padding:5px 8px;text-align:right;color:${color};font-weight:600">${x.a ? `${pct >= 0 ? '+' : ''}${pct.toFixed(1)}%` : '—'}</td>
      </tr>`;
  }).join('');

  el.innerHTML = `
    <div style="display:flex;gap:8px;flex-wrap:wrap;font-size:11px;margin-bottom:12px">
      <span style="background:#dbeafe;color:#1e40af;padding:4px 10px;border-radius:5px"><strong>A:</strong> ${escapeHtml(A.name)} <span style="opacity:.7">(${A.date})</span></span>
      <span style="font-size:14px;color:var(--gray-400);align-self:center">→</span>
      <span style="background:#dcfce7;color:#15803d;padding:4px 10px;border-radius:5px"><strong>B:</strong> ${escapeHtml(B.name)} <span style="opacity:.7">(${B.date})</span></span>
    </div>

    ${statRow}

    <h4 style="margin:14px 0 8px;color:var(--navy);font-size:13px">📋 So sánh chi tiết theo CBTD</h4>
    <div style="border:1px solid var(--gray-200);border-radius:6px;overflow:hidden">
      <table style="width:100%;border-collapse:collapse;font-size:11px">
        <thead style="background:var(--navy);color:#fff">
          <tr>
            <th style="padding:6px 8px;text-align:left;width:40px">#</th>
            <th style="padding:6px 8px;text-align:left">CBTD</th>
            <th style="padding:6px 8px;text-align:right;width:120px">A (cũ)</th>
            <th style="padding:6px 8px;text-align:right;width:120px">B (mới)</th>
            <th style="padding:6px 8px;text-align:right;width:120px">Biến động</th>
            <th style="padding:6px 8px;text-align:right;width:80px">%</th>
          </tr>
        </thead>
        <tbody>${cbRows || `<tr><td colspan="6" style="padding:30px;text-align:center;color:var(--gray-500)">Không có dữ liệu CBTD để so sánh</td></tr>`}</tbody>
      </table>
    </div>

    ${archiveRenderCustomerChanges(aRows, bRows)}
  `;
}

// QA-FEATURE: phan tich chi tiet KH moi / da tat toan / doi nhom no giua 2 moc so sanh
function archiveRenderCustomerChanges(aRows, bRows) {
  const aMap = new Map(), bMap = new Map();
  aRows.forEach(r => { const ma = String(r[0]||'').trim(); if (ma && !aMap.has(ma)) aMap.set(ma, r); });
  bRows.forEach(r => { const ma = String(r[0]||'').trim(); if (ma && !bMap.has(ma)) bMap.set(ma, r); });

  const newCust = [], closedCust = [], groupWorse = [], groupBetter = [];
  const nhomNum = s => { const m = String(s||'').match(/\d/); return m ? +m[0] : 0; };

  bMap.forEach((r, ma) => { if (!aMap.has(ma)) newCust.push(r); });
  aMap.forEach((r, ma) => { if (!bMap.has(ma)) closedCust.push(r); });
  aMap.forEach((rA, ma) => {
    const rB = bMap.get(ma);
    if (!rB) return;
    const nA = nhomNum(rA[18]), nB = nhomNum(rB[18]);
    if (nA && nB && nA !== nB) {
      const item = { ma, ten: rB[1]||rA[1], nA: rA[18], nB: rB[18] };
      if (nB > nA) groupWorse.push(item); else groupBetter.push(item);
    }
  });
  groupWorse.sort((x,y) => (nhomNum(y.nB)-nhomNum(y.nA)) - (nhomNum(x.nB)-nhomNum(x.nA)));

  const fmtM = n => (typeof bckhFmtMoney === 'function') ? bckhFmtMoney(n) : Math.round(n).toLocaleString('vi-VN');
  const listBlock = (title, items, color, bg, rowFn, emptyTxt) => `
    <details style="margin-top:10px;border:1px solid ${color}44;border-radius:8px;overflow:hidden">
      <summary style="cursor:pointer;padding:9px 12px;background:${bg};color:${color};font-weight:700;font-size:12px">${title} (${items.length})</summary>
      <div style="max-height:280px;overflow-y:auto">
        ${items.length ? `<table style="width:100%;border-collapse:collapse;font-size:11px">${items.map(rowFn).join('')}</table>`
                        : `<div style="padding:14px;text-align:center;color:var(--gray-500)">${emptyTxt}</div>`}
      </div>
    </details>`;

  return `
    <h4 style="margin:16px 0 4px;color:var(--navy);font-size:13px">🔍 Biến động khách hàng chi tiết (theo mã KH)</h4>
    ${listBlock('🆕 Khách hàng mới xuất hiện', newCust, '#15803d', '#dcfce7',
      r => `<tr style="border-top:1px solid #e5e7eb"><td style="padding:5px 8px;font-weight:600">${escapeHtml(String(r[1]||''))}</td><td style="padding:5px 8px;color:var(--gray-500)">${escapeHtml(String(r[0]||''))}</td><td style="padding:5px 8px;text-align:right;color:#15803d;font-weight:700">${fmtM(Number(r[11])||0)}</td></tr>`,
      'Không có khách hàng mới trong kỳ này.')}
    ${listBlock('📕 Khách hàng đã tất toán / không còn dư nợ', closedCust, '#b91c1c', '#fde8e6',
      r => `<tr style="border-top:1px solid #e5e7eb"><td style="padding:5px 8px;font-weight:600">${escapeHtml(String(r[1]||''))}</td><td style="padding:5px 8px;color:var(--gray-500)">${escapeHtml(String(r[0]||''))}</td><td style="padding:5px 8px;text-align:right;color:var(--gray-500)">${fmtM(Number(r[11])||0)} (mốc A)</td></tr>`,
      'Không có khách hàng tất toán trong kỳ này.')}
    ${listBlock('⚠ Nhảy nhóm nợ XẤU HƠN — cần chú ý', groupWorse, '#b45309', '#fef3e2',
      x => `<tr style="border-top:1px solid #e5e7eb"><td style="padding:5px 8px;font-weight:600">${escapeHtml(x.ten)}</td><td style="padding:5px 8px;color:var(--gray-500)">${escapeHtml(x.ma)}</td><td style="padding:5px 8px;text-align:right"><span style="color:var(--gray-500)">${escapeHtml(x.nA)}</span> → <span style="color:#b45309;font-weight:700">${escapeHtml(x.nB)}</span></td></tr>`,
      'Không có khách hàng nào nhảy nhóm nợ xấu hơn — tốt.')}
    ${listBlock('✅ Cải thiện nhóm nợ (tốt lên)', groupBetter, '#15803d', '#dcfce7',
      x => `<tr style="border-top:1px solid #e5e7eb"><td style="padding:5px 8px;font-weight:600">${escapeHtml(x.ten)}</td><td style="padding:5px 8px;color:var(--gray-500)">${escapeHtml(x.ma)}</td><td style="padding:5px 8px;text-align:right"><span style="color:var(--gray-500)">${escapeHtml(x.nA)}</span> → <span style="color:#15803d;font-weight:700">${escapeHtml(x.nB)}</span></td></tr>`,
      'Chưa có khách hàng nào cải thiện nhóm nợ giữa 2 mốc.')}
  `;
}

// Initialize on load
archiveInit();

/* ═══════════════════════════════════════════════════════════════
   AUTO-SYNC ENGINE — PRO-38
   Tự động đọc file IPCAS từ folder máy tính theo lịch định sẵn
   Sử dụng File System Access API (Chrome/Edge 86+)
   ═══════════════════════════════════════════════════════════════ */

const AUTOSYNC_STORAGE_KEY = '_autoSyncConfig';

// State
let _asFileHandle   = null;   // FileSystemFileHandle
let _asIntervalMin  = 10;
let _asEnabled      = false;
let _asTimerID      = null;
let _asCountdownID  = null;
let _asNextSync     = null;
let _asLastModified = null;
let _asSmartCheck   = true;
let _asAction       = 'ask';
let _asLogLines     = [];

/* ── Mở modal ────────────────────────────────────────────── */
function openAutoSyncModal() {
  autoSyncLoadConfig();
  autoSyncRenderModal();
  // Try compat with both openModal patterns
  const modal = document.getElementById('modal-autosync');
  if (modal) {
    modal.classList.add('open');
    modal.style.display = 'flex';
  }
}

function closeAutoSyncModal() {
  const modal = document.getElementById('modal-autosync');
  if (modal) {
    modal.classList.remove('open');
    modal.style.display = 'none';
  }
}

/* ── LocalStorage config ─────────────────────────────────── */
function autoSyncSaveConfig() {
  try {
    localStorage.setItem(AUTOSYNC_STORAGE_KEY, JSON.stringify({
      intervalMin: _asIntervalMin,
      enabled: _asEnabled,
      smartCheck: _asSmartCheck,
      action: _asAction,
      lastModified: _asLastModified,
      logLines: _asLogLines.slice(-60),
    }));
  } catch(e) {}
}
function autoSyncLoadConfig() {
  try {
    const raw = localStorage.getItem(AUTOSYNC_STORAGE_KEY);
    if (!raw) return;
    const cfg = JSON.parse(raw);
    _asIntervalMin  = cfg.intervalMin  || 10;
    _asEnabled      = cfg.enabled      || false;
    _asSmartCheck   = cfg.smartCheck   !== false;
    _asAction       = cfg.action       || 'ask';
    _asLastModified = cfg.lastModified || null;
    _asLogLines     = cfg.logLines     || [];
  } catch(e) {}
}

/* ── Render modal ────────────────────────────────────────── */
function autoSyncRenderModal() {
  document.querySelectorAll('.autosync-interval-btn').forEach(btn => {
    btn.classList.toggle('selected', +btn.dataset.min === _asIntervalMin);
  });
  const sc = document.getElementById('autosync-smart');
  if (sc) sc.checked = _asSmartCheck;
  const ar = document.querySelector(`input[name="autosync-action"][value="${_asAction}"]`);
  if (ar) ar.checked = true;
  const tog = document.getElementById('autosync-toggle');
  if (tog) tog.checked = _asEnabled;
  if (_asFileHandle) {
    document.getElementById('autosync-file-name').textContent = '📄 ' + _asFileHandle.name;
    document.getElementById('autosync-file-meta').textContent = 'File đã chọn — hệ thống có quyền đọc';
    document.getElementById('autosync-file-picker').style.borderColor = 'var(--green-main)';
    document.getElementById('autosync-file-picker').style.background  = 'var(--green-pale)';
  }
  autoSyncUpdateStatusUI();
  autoSyncRenderLog();
}

function autoSyncUpdateStatusUI() {
  const dot  = document.getElementById('autosync-dot');
  const txt  = document.getElementById('autosync-status-text');
  const cdn  = document.getElementById('autosync-countdown');
  const last = document.getElementById('autosync-last-sync');
  const topStatus    = document.getElementById('autosync-status');
  const topBadge     = document.getElementById('autosync-badge');
  const sidebarBadge = document.getElementById('badge-autosync');
  const btnSync      = document.getElementById('btn-autosync');

  if (!dot) return;

  if (_asEnabled && _asFileHandle) {
    dot.className = 'autosync-status-dot active';
    txt.textContent = `🔄 Đang chạy — mỗi ${_asIntervalMin} phút · ${_asFileHandle.name}`;
    if (cdn) cdn.style.display = 'block';
    if (topStatus)    topStatus.style.display    = 'inline';
    if (topBadge)     topBadge.style.display     = 'block';
    if (sidebarBadge) sidebarBadge.style.display = 'inline-flex';
    if (btnSync) btnSync.style.background = 'var(--green-dark)';
  } else if (_asEnabled && !_asFileHandle) {
    dot.className = 'autosync-status-dot error';
    txt.textContent = '⚠️ Bật nhưng chưa chọn file nguồn';
    if (topStatus)    { topStatus.textContent = '⚠️ Chưa chọn file'; topStatus.style.display = 'inline'; }
    if (topBadge)     topBadge.style.display = 'block';
    if (sidebarBadge) sidebarBadge.style.display = 'inline-flex';
  } else {
    dot.className = 'autosync-status-dot';
    txt.textContent = 'Chưa bật Auto-Sync';
    if (cdn)          cdn.style.display          = 'none';
    if (topStatus)    topStatus.style.display    = 'none';
    if (topBadge)     topBadge.style.display     = 'none';
    if (sidebarBadge) sidebarBadge.style.display = 'none';
    if (btnSync) btnSync.style.background = 'var(--navy-mid)';
  }
  if (last && _asLastModified) {
    const d = new Date(_asLastModified);
    last.textContent = 'File: ' + d.toLocaleString('vi-VN', { hour:'2-digit', minute:'2-digit', day:'2-digit', month:'2-digit' });
  }
}

/* ── Chọn file (File System Access API) ─────────────────── */
async function autoSyncPickFile() {
  if (!window.showOpenFilePicker) {
    alert('⚠️ Tính năng này yêu cầu Chrome hoặc Edge phiên bản 86 trở lên.\nVui lòng cập nhật trình duyệt và thử lại.');
    return;
  }
  try {
    const [handle] = await window.showOpenFilePicker({
      types: [{
        description: 'File IPCAS (Excel / CSV)',
        accept: {
          'application/vnd.openxmlformats-officedocument.spreadsheetml.sheet': ['.xlsx', '.xlsm'],
          'application/vnd.ms-excel': ['.xls'],
          'text/csv': ['.csv'],
        }
      }],
      multiple: false,
    });
    _asFileHandle = handle;
    document.getElementById('autosync-file-name').textContent = '📄 ' + handle.name;
    document.getElementById('autosync-file-meta').textContent = 'Đã cấp quyền đọc — sẵn sàng sync';
    document.getElementById('autosync-file-picker').style.borderColor = 'var(--green-main)';
    document.getElementById('autosync-file-picker').style.background  = 'var(--green-pale)';
    autoSyncLog('info', 'Đã chọn file: ' + handle.name);
    autoSyncUpdateStatusUI();
    autoSyncSaveConfig();
    if (_asEnabled) { autoSyncStop(); autoSyncStart(); }
  } catch(e) {
    if (e.name !== 'AbortError') autoSyncLog('err', 'Lỗi chọn file: ' + e.message);
  }
}

/* ── Chu kỳ ─────────────────────────────────────────────── */
function autoSyncSelectInterval(min) {
  _asIntervalMin = min;
  document.querySelectorAll('.autosync-interval-btn').forEach(btn => {
    btn.classList.toggle('selected', +btn.dataset.min === min);
  });
  autoSyncSaveConfig();
  if (_asEnabled) { autoSyncStop(); autoSyncStart(); }
}

/* ── Bật / Tắt ──────────────────────────────────────────── */
function autoSyncToggle(enabled) {
  const sc = document.getElementById('autosync-smart');
  const ar = document.querySelector('input[name="autosync-action"]:checked');
  if (sc) _asSmartCheck = sc.checked;
  if (ar) _asAction     = ar.value;
  _asEnabled = enabled;
  autoSyncSaveConfig();
  if (enabled) {
    if (!_asFileHandle) {
      autoSyncLog('warn', 'Chưa chọn file — vui lòng chọn file nguồn trước');
      autoSyncUpdateStatusUI();
      return;
    }
    autoSyncStart();
    autoSyncLog('ok', `Auto-Sync BẬT — chu kỳ ${_asIntervalMin} phút · hành động: ${_asAction}`);
  } else {
    autoSyncStop();
    autoSyncLog('info', 'Auto-Sync ĐÃ TẮT');
  }
  autoSyncUpdateStatusUI();
  autoSyncRenderLog();
}

/* ── Timer ───────────────────────────────────────────────── */
function autoSyncStart() {
  autoSyncStop();
  const ms = _asIntervalMin * 60 * 1000;
  _asNextSync   = new Date(Date.now() + ms);
  _asTimerID    = setInterval(autoSyncRun, ms);
  _asCountdownID= setInterval(autoSyncTickCountdown, 1000);
  autoSyncTickCountdown();
}
function autoSyncStop() {
  if (_asTimerID)     { clearInterval(_asTimerID);     _asTimerID = null; }
  if (_asCountdownID) { clearInterval(_asCountdownID); _asCountdownID = null; }
  _asNextSync = null;
  const cdn = document.getElementById('autosync-countdown');
  if (cdn) cdn.style.display = 'none';
  const ts = document.getElementById('autosync-status');
  if (ts) ts.style.display = 'none';
}
function autoSyncTickCountdown() {
  if (!_asNextSync) return;
  const diff = _asNextSync - Date.now();
  if (diff < 0) return;
  const m = Math.floor(diff / 60000);
  const s = Math.floor((diff % 60000) / 1000);
  const label = `⏱ Sync tiếp: ${m > 0 ? m + ' phút ' : ''}${String(s).padStart(2,'0')} giây`;
  const cdn = document.getElementById('autosync-countdown');
  if (cdn) { cdn.textContent = label; cdn.style.display = 'block'; }
  const ts = document.getElementById('autosync-status');
  if (ts && ts.style.display !== 'none') ts.textContent = label;
}

/* ── Thực hiện sync ─────────────────────────────────────── */
async function autoSyncRun() {
  if (!_asFileHandle) { autoSyncLog('warn', 'Không có file handle — bỏ qua'); return; }
  _asNextSync = new Date(Date.now() + _asIntervalMin * 60 * 1000);

  try {
    // Kiểm tra / xin lại quyền
    const perm = await _asFileHandle.queryPermission({ mode: 'read' });
    if (perm !== 'granted') {
      const req = await _asFileHandle.requestPermission({ mode: 'read' });
      if (req !== 'granted') {
        autoSyncLog('err', 'Không có quyền đọc file — user từ chối');
        showToast('⚠️ Auto-Sync cần quyền đọc file — mở modal để xác nhận lại', 'red');
        return;
      }
    }

    const file = await _asFileHandle.getFile();
    const modTime = file.lastModified;

    // Smart check
    if (_asSmartCheck && _asLastModified && modTime === _asLastModified) {
      autoSyncLog('info', `[${asFmtNow()}] File chưa thay đổi — bỏ qua`);
      return;
    }

    autoSyncLog('ok', `[${asFmtNow()}] File mới/cập nhật: ${file.name} (${(file.size/1024).toFixed(0)} KB)`);
    _asLastModified = modTime;
    autoSyncSaveConfig();
    autoSyncUpdateStatusUI();

    if (_asAction === 'notify') {
      showToast(`🔄 File IPCAS thay đổi lúc ${asFmtNow()} — mở "Nhập IPCAS" để import`, 'gold');
      return;
    }

    // Parse — uses existing parsers from main app
    let rows;
    const fn = file.name.toLowerCase();
    if (fn.endsWith('.csv'))                    rows = parseCSV(await file.text());
    else if (/\.(xlsx|xlsm)$/.test(fn))         rows = await parseXLSX(file);
    else if (/\.xls$/.test(fn))                 rows = await parseXLS_legacy(file);
    else { autoSyncLog('err', 'Định dạng không hỗ trợ: ' + file.name); return; }

    if (!rows || rows.length < 2) { autoSyncLog('err', 'File rỗng hoặc thiếu dữ liệu'); return; }

    const transformed = transformIPCAS(rows);

    autoSyncLog('ok', `Parsed: ${rows.length} dòng gốc → ${transformed.length} bản ghi hợp lệ`);

    if (_asAction === 'ask') {
      pendingImportRows = transformed;
      closeAutoSyncModal();
      const fInfo = document.getElementById('import-file-info');
      const fPrev = document.getElementById('import-preview');
      const fSync = document.getElementById('import-sync-panel');
      const fBtn  = document.getElementById('btn-do-import');
      if (fInfo) fInfo.textContent = `🔄 Auto-Sync: ${file.name}`;
      if (fPrev) fPrev.style.display = 'block';
      if (fSync) fSync.style.display = 'none';
      if (typeof previewImport === 'function') previewImport(transformed);
      if (fBtn) {
        fBtn.disabled = false;
        fBtn.style.opacity = '1';
        fBtn.textContent = `✅ Xác nhận nhập (${transformed.length} bản ghi)`;
      }
      if (typeof openModal === 'function') openModal('modal-import');
      else {
        const mi = document.getElementById('modal-import');
        if (mi) { mi.classList.add('open'); mi.style.display = 'flex'; }
      }
      showToast(`🔄 Auto-Sync phát hiện file mới — vui lòng xác nhận nhập`, 'gold');

    } else if (_asAction === 'auto') {
      const keep = transformed.filter(r => (Number(r[11]) || 0) > 0);
      if (!keep.length) { autoSyncLog('warn', 'Không có bản ghi dư nợ > 0 — bỏ qua'); return; }
      DATA.qltd = keep;
      saveData();
      rebuildAll();
      autoSyncLog('ok', `✅ Tự động import ${keep.length} bản ghi (loại ${transformed.length - keep.length} dư nợ = 0)`);
      showToast(`✅ Auto-Sync xong: ${keep.length} bản ghi lúc ${asFmtNow()}`, 'green');
    }

  } catch(e) {
    autoSyncLog('err', `Lỗi sync: ${e.message}`);
    console.error('[AutoSync]', e);
  }
}

/* ── Sync thủ công ──────────────────────────────────────── */
async function autoSyncRunNow() {
  if (!_asFileHandle) { alert('⚠️ Chưa chọn file nguồn'); return; }
  const sc = document.getElementById('autosync-smart');
  const ar = document.querySelector('input[name="autosync-action"]:checked');
  if (sc) _asSmartCheck = sc.checked;
  if (ar) _asAction     = ar.value;
  const origLM    = _asLastModified;
  _asLastModified = null;           // force check
  autoSyncLog('info', `▶️ Sync thủ công lúc ${asFmtNow()}...`);
  await autoSyncRun();
  if (!_asEnabled) _asLastModified = origLM;
  autoSyncRenderLog();
}

/* ── Xóa cài đặt ────────────────────────────────────────── */
function autoSyncClear() {
  if (!confirm('Xóa toàn bộ cài đặt Auto-Sync?')) return;
  autoSyncStop();
  _asFileHandle = null; _asEnabled = false; _asIntervalMin = 10;
  _asSmartCheck = true; _asAction = 'ask'; _asLastModified = null; _asLogLines = [];
  localStorage.removeItem(AUTOSYNC_STORAGE_KEY);
  autoSyncRenderModal();
  showToast('🗑️ Đã xóa cài đặt Auto-Sync', 'red');
}

/* ── Log ────────────────────────────────────────────────── */
function autoSyncLog(type, msg) {
  _asLogLines.push({ type, msg });
  if (_asLogLines.length > 100) _asLogLines = _asLogLines.slice(-80);
  autoSyncSaveConfig();
  autoSyncRenderLog();
}
function autoSyncRenderLog() {
  const el = document.getElementById('autosync-log');
  if (!el) return;
  if (!_asLogLines.length) {
    el.innerHTML = '<div class="log-line info">[Hệ thống] Chưa có hoạt động nào...</div>';
    return;
  }
  // Use simple HTML escape (avoid name clash)
  const esc = s => String(s).replace(/[&<>"']/g, c => ({'&':'&amp;','<':'&lt;','>':'&gt;','"':'&quot;',"'":'&#39;'}[c]));
  el.innerHTML = _asLogLines.slice().reverse().map(l =>
    `<div class="log-line ${l.type}">${esc(l.msg)}</div>`
  ).join('');
}
function asFmtNow() {
  return new Date().toLocaleTimeString('vi-VN', { hour:'2-digit', minute:'2-digit', second:'2-digit' });
}

/* ── Khởi động khi load trang ───────────────────────────── */
(function autoSyncInit() {
  autoSyncLoadConfig();
  // FileSystemFileHandle không persist qua localStorage/reload
  // → reset enabled, hiện reminder
  if (_asEnabled) {
    _asEnabled = false;
    autoSyncSaveConfig();
    setTimeout(() => {
      showToast('🔄 Auto-Sync đã cài đặt — mở lại để cấp quyền đọc file và bật lại', 'gold');
    }, 2500);
  }
  autoSyncUpdateStatusUI();
})();

/* ═══════════════════════════════════════════════════════════════
   AUTO-SYNC: DÒ TÌM FILE THEO NGÀY DD.MM.YYYY TRONG THƯ MỤC
   ═══════════════════════════════════════════════════════════════ */
async function autoSyncPickFolder() {
  if (!window.showDirectoryPicker) {
    alert('⚠️ Tính năng này yêu cầu Chrome hoặc Edge phiên bản 86 trở lên.\nVui lòng cập nhật trình duyệt và thử lại.');
    return;
  }
  try {
    const dirHandle = await window.showDirectoryPicker({ mode: 'read' });
    autoSyncLog('info', `📁 Đang quét thư mục: ${dirHandle.name}...`);

    const today = new Date();
    today.setHours(0, 0, 0, 0);
    // Pattern: DD.MM.YYYY hoặc DD/MM/YYYY trong tên file
    const datePattern = /(\d{1,2})[./](\d{1,2})[./](\d{4})/;
    const candidates = [];

    for await (const [name, handle] of dirHandle.entries()) {
      if (handle.kind !== 'file') continue;
      if (!/\.(xlsx|xlsm|xls|csv)$/i.test(name)) continue;
      const m = datePattern.exec(name);
      if (!m) continue;
      const dd = parseInt(m[1],10), mm = parseInt(m[2],10), yyyy = parseInt(m[3],10);
      if (mm < 1 || mm > 12 || dd < 1 || dd > 31 || yyyy < 2000 || yyyy > 2100) continue;
      const fileDate = new Date(yyyy, mm - 1, dd);
      if (isNaN(fileDate.getTime())) continue;
      const file = await handle.getFile();
      candidates.push({ name, handle, fileDate, lastModified: file.lastModified });
    }

    if (!candidates.length) {
      autoSyncLog('warn', '⚠️ Không tìm thấy file nào có định dạng ngày DD.MM.YYYY trong thư mục');
      showToast('⚠️ Không tìm thấy file .xlsx/.csv có ngày DD.MM.YYYY', 'gold');
      return;
    }

    // Sắp xếp: (1) ngày gần hôm nay nhất, (2) tie-break: mới sửa gần nhất
    candidates.sort((a, b) => {
      const diffA = Math.abs(a.fileDate - today);
      const diffB = Math.abs(b.fileDate - today);
      if (diffA !== diffB) return diffA - diffB;
      return b.lastModified - a.lastModified;
    });

    const best = candidates[0];
    const fmtDate = `${String(best.fileDate.getDate()).padStart(2,'0')}/${String(best.fileDate.getMonth()+1).padStart(2,'0')}/${best.fileDate.getFullYear()}`;
    _asFileHandle = best.handle;

    const nameEl = document.getElementById('autosync-file-name');
    const metaEl = document.getElementById('autosync-file-meta');
    const picker = document.getElementById('autosync-file-picker');
    if (nameEl) nameEl.textContent = '📄 ' + best.name;
    if (metaEl) metaEl.textContent = `Tìm tự động · Ngày file: ${fmtDate} · Sửa lần cuối: ${new Date(best.lastModified).toLocaleString('vi-VN', {day:'2-digit',month:'2-digit',year:'numeric',hour:'2-digit',minute:'2-digit'})}`;
    if (picker) { picker.style.borderColor = 'var(--green-main)'; picker.style.background = 'var(--green-pale)'; }

    autoSyncLog('ok', `✅ Tìm được ${candidates.length} file — chọn: ${best.name} (ngày ${fmtDate})`);
    if (candidates.length > 1) {
      autoSyncLog('info', `ℹ️ Các file khác (gần ngày): ${candidates.slice(1, 4).map(c=>c.name).join(', ')}${candidates.length > 4 ? ` và ${candidates.length-4} file khác` : ''}`);
    }
    autoSyncUpdateStatusUI();
    autoSyncSaveConfig();
    if (_asEnabled) { autoSyncStop(); autoSyncStart(); }
  } catch(e) {
    if (e.name !== 'AbortError') autoSyncLog('err', 'Lỗi quét thư mục: ' + e.message);
  }
}

/* v14.3.2: khối "COLUMN FILTER SYSTEM" (const _colFilterState + 3 hàm
   buildColumnFilters/colFilterApply/_colFilterReapply) đã được DỜI sang
   script lõi #td-root-cause-fixes-v14_3_2 ở đầu <head> — xem giải thích
   ở đó (fix ReferenceError: buildColumnFilters is not defined). Không
   để lại bản sao ở đây để tránh lỗi khai báo trùng (SyntaxError:
   Identifier '_colFilterState' has already been declared). */

